{"Antlers (2021)": "Synopsis : In an isolated Oregon town, a middle-school teacher and her sheriff brother become embroiled with her enigmatic student, whose dark secrets lead to terrifying encounters with an ancestral creature.\nDirector:Scott Cooper\nStars:Keri Russell, Jesse Plemons, Jeremy T. Thomas, Graham Greene", "Hostage (2021)": "Synopsis : Single father and former Marine Kyle Snowden, on a routine stop for his job in Child Protective Services, finds himself and a group of innocent customers trapped inside his stepfather's store.\nDirector:Jon Keeyes\nStars:Tyrese Gibson, Christopher Backus, John Malkovich, Michael Jai White", "Fortress (2021)": "Synopsis : A group of criminals hellbent on revenge, forces a retired officer and his son to save the day.\nDirector:James Cullen Bressack\nStars:Bruce Willis, Chad Michael Murray, Jesse Metcalfe, Shannen Doherty", "Death Valley (2021)": "Synopsis : Western stories and legends based, and filmed, in and around Death Valley, California. One of the longest-running Western series, originating on radio in the 1930s. The continuing sponsor was \"20 Mule Team\" Borax, a product formerly mined in Death Valley.\nStars:\nRobert Taylor, Ronald Reagan, Dale Robertson", "The Taste of Blood (2021)": "Synopsis : Three distinguished English gentlemen accidentally resurrect Count Dracula, killing a disciple of his in process. The Count seeks to avenge his dead servant, by making the trio die in the hands of their own children.\nDirector:Peter Sasdy\nStars:Christopher Lee, Geoffrey Keen, Gwen Watford, Linda Hayden", "American Refugee (2021)": "Synopsis : Follows a family seeking shelter in their neighbor's bunker, when the American economy is in collapse, and the danger inside is greater than outside.\nDirector:Ali LeRoi\nStars:Erika Alexander, Derek Luke, Sam Trammell, Zamani Wilder", "Hurt (2021)": "Synopsis : During the Iraq War, a Sergeant recently assigned to an army bomb squad is put at odds with his squad mates due to his maverick way of handling his work.\nDirector:Kathryn Bigelow\nStars:Jeremy Renner, Anthony Mackie, Brian Geraghty, Guy Pearce", "Famous (2021)": "Synopsis : A high-school boy in the early 1970s is given the chance to write a story for Rolling Stone magazine about an up-and-coming rock band as he accompanies them on their concert tour.\nDirector:Cameron Crowe\nStars:Billy Crudup, Patrick Fugit, Kate Hudson, Frances McDormand", "Agnes (2021)": "Synopsis : Rumors of demonic possession at a religious convent prompts a church investigation into the strange goings-on among its nuns. A disaffected priest and his neophyte are confronted with temptation, bloodshed and a crisis of faith.\nDirector:Mickey Reece\nStars:Molly C. Quinn, Sean Gunn, Chris Sullivan, Hayley McFarland", "The Last Son (2021)": "Synopsis : An outlaw attempts to end his evil family line.\nDirector:Tim Sutton\nStars:Sam Worthington, Machine Gun Kelly, Thomas Jane, Emily Marie Palmer", "The Unforgivable (2021)": "Synopsis : A woman is released from prison after serving a sentence for a violent crime and re-enters a society that refuses to forgive her past.\nDirector:Nora Fingscheidt\nStars:Sandra Bullock, Viola Davis, Vincent D'Onofrio, Jon Bernthal", "Back to the Outback (2021)": "Synopsis : Tired of being locked in a reptile house where humans gawk at them like they're monsters, a group of Australia's deadliest creatures plot a daring escape from their zoo to the Outback.\nDirectors:Harry Cripps,\n|     Stars:Isla Fisher, Guy Pearce, Jacki Weaver, Eric Bana", "Even Mice Belong in Heaven (2021)": "Synopsis : A film about two mortal enemies - a little Mouse and a Fox, who after an unfortunate accident, meet in animal heaven. They lose their natural instincts and become best friends. Their wish\nDirectors:Jan Bubenicek,\n|     Stars:Erica Schroeder, Marc Thompson, Tyler Bunch, Wayne Grayson", "Encounter (2021)": "Synopsis : Two brothers embark on a journey with their father, who is trying to protect them from an alien threat.\nDirector:Michael Pearce\nStars:Riz Ahmed, Octavia Spencer, Lucian-River Chauhan, Aditya Geddada", "The Hating Game (2021)": "Synopsis : Resolving to achieve professional success without compromising her ethics, Lucy embarks on a ruthless game of one-upmanship against cold and efficient nemesis Joshua, a rivalry that is complicated by her growing attraction to him.\nDirector:Peter Hutchings\nStars:Lucy Hale, Austin Stowell, Corbin Bernsen, Sakina Jaffrey", "The End of Us (2021)": "Synopsis : After a savage breakup, two exes must continue living together when California issues its stay-at-home order for COVID-19. Now they'll try to move on without moving out.\nDirectors:Steven Kanter,\n|     Stars:Ben Coleman, Ali Vingiano, Derrick Joseph DeBlasis, Gadiel Del Orbe", "The Devil's Ring (2021)": "Synopsis : After a Traumatic past, a once promising young Boxing prospect , Anthony Santiago ( Alexander Luna) returns home from Prison to seek redemption, only to catch the attention of a big Boxing\nDirector:Juan Salas\nStars:Jeremiah Alexander, Damian Chapa, Pablo De Leon, Alcides Dias", "The Reenactment (2021)": "Synopsis : A film crew working on a TV show like \"Unsolved Mysteries\" who get more than they bargained for when they arrive at what's supposed to be an abandoned house in the mid 90s.\nDirector:Andrew Ford\nStars:Megan Duffy, Tony Todd, Stephen Wesley Green, Kaitlyn Bausch", "Are You Happy Now (2021)": "Synopsis : Adam thinks marrying Gina will save his life, but to her, true love might mean divorce.\nDirector:David Beinstein\nStars:Josh Ruben, Catherine Curtin, Ismenia Mendes, Danny Johnson", "The Scrapper (2021)": "Synopsis : Ex-con turned \"scrapper\" Jake leads a quiet life caring for his family until he is pursued by violent Punjabi and Mexican criminals following a botched robbery.\nDirector:Bari Kang\nStars:Ava Paloma, Craig muMs Grant, Myles Clohessy, Anil Kumar", "Creatures (2020)": "Synopsis : The numerous adventures of a friendly staff at a country veterinarian practice in 1930s to 1940s Yorkshire.\nStars:\nAnna Madeley, Samuel West, Rachel Shenton", "John 316 (2021)": "Synopsis : A psychiatric hospital is turned upside down when a mysterious drifter is admitted and assigned to room 316. Known only as John Doe, the other patients believe that he bears an uncanny resemblance to Jesus Christ.\nDirector:Jarvis Greiner\nStars:Skylar Radzion, Afton Rentz, Jarvis Greiner, Griffin Cork", "India Sweets and Spices (2021)": "Synopsis : When college freshman Alia returns home for the summer, she discovers secrets and lies in her parents' past that make her question everything she thought she knew about her family.\nDirector:Geeta Malik\nStars:Sophia Ali, Manisha Koirala, Anita Kalathara, Rish Shah", "The Wishing Tree (2021)": "Synopsis : A special Christmas tree decorated with handwritten wishes helps Evan and his group of orphaned students develop a connection and a sense of family.\nDirector:Terry Ingram\nStars:Jason Gedrick, Erica Cerra, Richard Harmon, Amitai Marmorstein", "Maya and Her Lover (2021)": "Synopsis : The mundane life of a 39 year old introvert is disrupted when she begins a steamy but contentious affair with a much younger Man.\nDirector:Nicole Sylvester\nStars:Ashanti J'Aria, Shomari Love, Al Thompson, Faiven Feshazion", "The Handler (2021)": "Synopsis : After throwing a job, an ex-Marine seeks refuge in a safe house where he is swarmed by mercenaries sent to kill him.\nDirector:Michael Matteo Rossi\nStars:Rachel Alig, Maddison Bullock, Jazsmin Lewis, Cathy Baron", "Secrets in the Wilderness (2021)": "Synopsis : Lisa and Tyler's marriage is on the rocks after Lisa discovers she's pregnant - she's been hoping to start a family but Tyler wants to focus on his business - an outdoor adventure\nDirector:Jason Wan Lim\nStars:Stephanie Bennett, Stafford Perry, Kylee Bush, John Treleaven", "Deadly Cuts (2021)": "Synopsis : Things go badly for a hack director and film crew shooting a low budget zombie movie in an abandoned WWII Japanese facility, when they are attacked by real zombies.\nDirector:Shin'ichirô Ueda\nStars:Takayuki Hamatsu, Yuzuki Akiyama, Harumi Shuhama, Kazuaki Nagaya", "Red Snow (2021)": "Synopsis : Still on the run from a group of Nazi zombies, a man seeks the aid of a group of American zombie enthusiasts, and discovers new techniques for fighting the zombies.\nDirector:Tommy Wirkola\nStars:Geir Vegar Hoel, Ørjan Gamst, Martin Starr, Jocelyn DeBoer", "Badland Doves (2021)": "Synopsis : On the trail to seek justice for murders by a man the entire town is protecting, these girls are out for revenge and they're up to the fight.\nDirector:Paul Winters\nStars:Tyson Alexander, Fredrick Charles Bevington Iii, Paul Bukoskey, Jimmy Cochran", "Silent Night (2021)": "Synopsis : Nell, Simon, and their son Art are ready to welcome friends and family for what promises to be a perfect Christmas gathering. Perfect except for one thing: everyone is going to die.\nDirector:Camille Griffin\nStars:Keira Knightley, Matthew Goode, Roman Griffin Davis, Annabelle Wallis", "Red Stone (2021)": "Synopsis : A dangerous hitman (Neal McDonough) is tasked with hunting down a teenager who witnessed the murder of his older brother at the hands of a ruthless Southern crime lord (Michael Cudlitz).\nDirector:Derek Presley\nStars:Neal McDonough, Mike Dopud, Michael Cudlitz, Alexandria DeBerry", "Home (2021)": "Synopsis : With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man.\nDirector:Jon Watts\nStars:Benedict Cumberbatch, Zendaya, Marisa Tomei, Tom Holland", "Mixtape (2021)": "Synopsis : When a young girl accidentally destroys the mixtape that belonged to her mother, she sets out to track down each of the obscure songs on the cassette.\nDirector:Valerie Weiss\nStars:Gemma Brooke Allen, Julie Bowen, Audrey Hsieh, Olga Petsa", "Diary of a Wimpy Kid (2021)": "Synopsis : Greg Heffley is an ambitious kid with an active imagination and big plans to be rich and famous. The problem is that he has to survive middle school first.\nDirector:Swinton O. Scott III\nStars:Cyrus Arnold, Braxton Baker, Erica Cerra, Lossen Chambers", "This Game's Called Murder (2021)": "Synopsis : A modern, dark-humored tale of greed, romance, and lost innocence in consumer-crazed, alienated society that functions as a harsh critique of society today without taking itself too seriously.\nDirector:Adam Sherman\nStars:Natasha Henstridge, Ron Perlman, Vanessa Marano, Judson Mills", "Deadlock (2021)": "Synopsis : An ex-military man working at a Georgia power plant has to spring into action to prevent disaster when a group of rogue soldiers gain control of the plant and take the employees hostage.\nDirector:Jared Cohn\nStars:Patrick Muldoon, Bruce Willis, Matthew Marsden, Michael DeVorzon", "Castle Falls (2021)": "Synopsis : Rival gangs seek out millions of dollars hidden inside a luxury condominium that's scheduled to be demolished, but first they have to deal with the janitor who found the loot first.\nDirector:Dolph Lundgren\nStars:Scott Adkins, Dolph Lundgren, Kim DeLonghi, Jim E. Chandler", "Funny Thing About Love (2021)": "Synopsis : A successful business woman takes her boyfriend home for Thanksgiving only to find her family is scheming to reunite her with her lost love.\nDirector:Adam White\nStars:Landen Adams, Alaina Beauloye, Summer Bellessa, Barry Corbin", "Annie Live! (2021)": "Synopsis : A young orphan opens the heart of billionaire Sir Oliver \"Daddy\" Warbucks.\nDirectors:Lear Debessonet,\n|     Stars:Nicole Scherzinger, Taraji P. Henson, Harry Connick Jr., Celina Smith", "American Sicario (2021)": "Synopsis : American gangster Erik Vasquez (Philippe A. Haddad) is scheming to become the top dog in the Mexican underworld, only to find himself making enemies out of both the powerful cartels and his own allies.\nDirector:RJ Collins\nStars:Danny Trejo, Maya Stojan, Maurice Compte, Philippe A. Haddad", "I'm Your Man (2021)": "Synopsis : In order to obtain research funds for her studies, a scientist accepts an offer to participate in an extraordinary experiment: for three weeks, she is to live with a humanoid robot, created to make her happy.\nDirector:Maria Schrader\nStars:Maren Eggert, Sandra Hüller, Dan Stevens, Jürgen Tarrach", "Belfast (2021)": "Synopsis : A young boy and his working-class Belfast family experience the tumultuous late 1960s.\nDirector:Kenneth Branagh\nStars:Jude Hill, Lewis McAskie, Caitriona Balfe, Jamie Dornan", "Ron's Gone Wrong (2021)": "Synopsis : The story of Barney, an awkward middle-schooler and Ron, his new walking, talking, digitally-connected device. Ron's malfunctions set against the backdrop of the social media age launch them on a journey to learn about true friendship.\nDirectors:Sarah Smith,\nOctavio E. Rodriguez|     Stars:Jack Dylan Grazer, Zach Galifianakis, Ed Helms, Olivia Colman", "Last Shoot Out (2021)": "Synopsis : After newlywed Jocelyn learns that her husband Jody (Michael Welch, Twilight franchise) had her father shot down, she flees from the Callahan ranch in fear. She's rescued by gunman Billy\nDirector:Michael Feifer\nStars:Brock Harris, Skylar Witte, Peter Sherayko, Jay Pickett", "Devil's Triangle (2021)": "Synopsis : When a group of marine biologists crash land in the Bermuda Triangle, they realize they have stumbled into the lost city of Atlantis. But they quickly discover the city isn't friendly, and\nDirector:Brendan Petrizzo\nStars:Diana Prince, Fred Williamson, Alyson Gorske, Morgan Bradley", "The Unkind (2021)": "Synopsis : In 2008, six friends from NY decide to vacation together in Italy, they think they are in for a smooth and easy two weeks full of beers, partying, and fun. Their vacation soon turns\nDirector:Luca Gabriele Rossetti\nStars:Taylor Skeens, Tommaso Basili, Kavita Albizzati, Arianna Monguzzi", "Good Thief (2021)": "Synopsis : A Detroit-set crime noir thriller about three small-time thieves who rip off a neighborhood pawnbroker of his valuable baseball card collection, only to find out they've unleashed something much more sinister.\nDirector:Lance Kawas\nStars:Peter Donahue, Shomari Giles, Robert Laenen, Melanie Mahanna", "House of Glass (2021)": "Synopsis : Convinced of her husbands infidelity, a woman's obsessive search for the truth turns deadly.\nDirector:Reyn Del Rio\nStars:Jenny Shakeshaft, Stephen Ellis, Alexandra Bard, Clayton Farris", "BLONDE Purple (2021)": "Synopsis : An out-of-his depth inexperienced criminal is stuck in a bank, after a heist went wrong. How will he get out?\nDirector:Marcus Flemmings\nStars:Roger Ajogbe, Adam J. Bernard, Ellie Bindman, Andy Chaplin", "The Last Duel (2021)": "Synopsis : King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire by challenging him to a duel.\nDirector:Ridley Scott\nStars:Matt Damon, Adam Driver, Jodie Comer, Harriet Walter", "The Middle Man (2021)": "Synopsis : Frank Farrelli takes on the job as a middle man in the God-forsaken town of Karmack, USA, a community in a depression so deep that they need a middle man to professionally communicate more of the bad news.\nDirector:Bent Hamer\nStars:Don McKellar, Kenneth Welsh, Nina Andresen Borud, Nicolas Bro", "Nash Bridges (2021)": "Synopsis : Nash Bridges continues to run San Francisco's SIU in 2020 while confronting a changing city, a new boss, and a world in which police work focuses on modern data-crunching and predictive\nDirector:Greg Beeman\nStars:Don Johnson, Cheech Marin, Joe Dinicol, Diarra Kilpatrick", "Dirty Little Deeds (2021)": "Synopsis : Suspicious of her new husband, a woman begins digging into his family's past and uncovers a deadly web of lies.\nDirector:Dylan Vox\nStars:Nayirah Teshali, Adam Hollick, Ashley Doris, Nicole Danielle Watts", "Sinister Switch (2021)": "Synopsis : A couple welcomes their long-lost daughter home but begin to question whether she really is their child.\nDirector:Christopher Redmond\nStars:Emily Alatalo, Steve Belford, Jas Dhanda, Adrian Falconer", "Pups Alone (2021)": "Synopsis : While everyone is away on a company ski trip, Robert's neighbor hires two inept thieves to steal his latest invention. The neighborhood dogs will use Robert's inventions to set up a house of horrors for the thieves.\nDirector:Alex Merkin\nStars:Jerry O'Connell, Jennifer Love Hewitt, Rob Schneider, Danny Trejo", "An Intrusion (2021)": "Synopsis : Sam and his family are terrorized by a malicious stalker\nDirector:Nicholas Holland\nStars:Scout Taylor-Compton, Keir Gilchrist, Billy Boyd, Dustin Prince", "The Last Rite (2021)": "Synopsis : A medical student suffering from sleep paralysis finds herself plagued by a demonic entity, after moving in with her boyfriend.\nDirector:Leroy Kincaide\nStars:Bethan Waller, Johnny Fleming, Kit Smith, Tara Hoyos-Martinez", "Ayar (2021)": "Synopsis : Ayar, a first-generation American Latina, returns home to reunite with her daughter. But when her mother, Renata, refuses to let her see her due to Covid, Ayar is confronted by the many roles she's been forced to play.\nDirector:Floyd Russ\nStars:Ariana Ron Pedrique, Vilma Vega, Henry Foster Brown, Simon Haycock", "The Matchmaker (2021)": "Synopsis : After a career-ending accident, former NFL recruit Ian Hunter is back on campus-and he's ready to get his new game on.\nDirector:Tosca Musk\nStars:Nick Bateman, Caitlin Carver, Tyler Johnson, Justene Alpert", "Maysville (2021)": "Synopsis : A young boy, Teddy Rogers is devastated by a tragic accident and taken from his family to pay a penance which forces him into a life of hard labor. Four years later, he escapes to the town\nDirector:Leslie Goyette\nStars:Trin Miller, Russell Hodgkinson, Cheyenne Barton, Brian Sutherland", "Ashley Jones Is Perfectly Normal (2021)": "Synopsis : Desperate to get her life back to normal after a surprisingly uncommon medical diagnosis, Ashley Jones is forced to examine what \"normalcy\" really means in a world of mistaken identities, very old, old friends, and poisoned meatballs.\nDirector:Thomas Bangert\nStars:Hana Yuka Sano, Loa Allebach, Chris Yeschenko, Coby J. Marcum", "Off the Rails (2021)": "Synopsis : Three fifty-something women set out to repeat the European inter-railing adventures of their youth, after their close friend passes away leaving them rail tickets, and a final request: to take her teenage daughter with them.\nDirector:Jules Williamson\nStars:Jenny Seagrove, Sally Phillips, Ismael Calvillo Millán, Kelly Preston", "The Shuroo Process (2021)": "Synopsis : When a young NYC based freelance magazine writer, frustrated with the pressures of a failing publishing world and a less than promising romantic life, becomes infatuated by a wildly charismatic self-help guru it sends her on a journey of self improvement with catastrophic consequences.\nDirector:Emrhys Cooper\nStars:Brad Dourif, Fiona Dourif, Eric Roberts, Jeff Hephner", "The Humans (2021)": "Synopsis : Set inside a pre-war duplex in downtown Manhattan, The Humans follows the course of an evening in which the Blake family gathers to celebrate Thanksgiving. As darkness falls outside the\nDirector:Stephen Karam\nStars:Richard Jenkins, Jayne Houdyshell, Amy Schumer, Beanie Feldstein", "Nitram (2021)": "Synopsis : Events leading up to the 1996 Port Arthur massacre on Tasmania in an attempt to understand why and how the atrocity occurred.\nDirector:Justin Kurzel\nStars:Caleb Landry Jones, Judy Davis, Anthony LaPaglia, Phoebe Taylor", "My Fiona (2021)": "Synopsis : Devastated by the unexpected suicide of her best friend Fiona, Jane helps Fiona's widow care for their son. The relationship develops from a friendship to a deeper affair that's potentially catastrophic to the healing of all involved.\nDirector:Kelly Walker\nStars:Jeanette Maus, Corbin Reid, Elohim Nycalove, Sara Amini", "Ma Belle, My Beauty (2021)": "Synopsis : A surprise reunion in the South of France reignites passions and jealousies between two women who were formerly polyamorous lovers.\nDirector:Marion Hill\nStars:Idella Johnson, Hannah Pepper, Lucien Guignard, Sivan Noam Shimon", "Autumn Road (2021)": "Synopsis : Twin brothers running a haunted house and an aspiring actress are all affected by the disappearance of a young girl.\nDirector:Riley Cusick\nStars:Lorelei Linklater, Riley Cusick, Justin Meeks, Lar Park-Lincoln", "Boiling Point (2021)": "Synopsis : Enter the relentless pressure of a restaurant kitchen as a head chef wrangles his team on the busiest day of the year.\nDirector:Philip Barantini\nStars:Stephen Graham, Vinette Robinson, Alice Feetham, Jason Flemyng", "Welcome to the Show (2021)": "Synopsis : An invitation to a mysterious theatre piece, \"The Show,\" sends four best friends down a rabbit hole of mistrust and madness as they try to figure out who are the actors, who is the audience, who is doing this to them, and why.\nDirector:Dorie Barton\nStars:Richard Follin, Dillon Douglasson, Keegan Garant, Christopher Martin", "Spencer (2021)": "Synopsis : During her Christmas holidays with the royal family at the Sandringham estate in Norfolk, England, Diana Spencer, struggling with mental health problems, decides to end her decade-long marriage to Prince Charles.\nDirector:Pablo Larraín\nStars:Kristen Stewart, Timothy Spall, Jack Nielen, Freddie Spry", "God's Not Dead(2021)": "Synopsis : Reverend Dave defending himself and a group of Christian homeschooling families after the inspection by the local government official.\nDirector:Vance Null\nStars:David A.R. White, William Forsythe, Isaiah Washington, Antonio Sabato Jr.", "Fixed (2021)": "Synopsis : On the night low-level gambler, Daz Clemance is leaving Birmingham to start a crime-free life with his girlfriend in Spain, he's accused of fixing a bareknuckle fight in a warehouse. He is beaten, stabbed and locked in a cupboard.\nDirector:Jez Alsop\nStars:Nicholas Clarke, Nisaro Karim, Dean Kilbey, Darren Tassell", "Black Friday (2021)": "Synopsis : A group of toy store employees must protect each other from a horde of parasite infected shoppers.\nDirector:Casey Tebo\nStars:Devon Sawa, Ivana Baquero, Ryan Lee, Stephen Peck", "Skateshop (2021)": "Synopsis : A group of Skaters band together to save their local Skateshop\nDirectors:Ryan Peimer,\nZack Whyel|     Stars:Bo Mitchell, Chelsea Murphy, Zack Whyel, Michael Ruff", "The Elevator (2021)": "Synopsis : Roman Juniper, a husband, and father of three is forced to go work on the Saturday of his daughter's birthday. He plans to return home in time for his daughter's birthday party before\nDirectors:Jack Cook,\n|     Stars:Tim Dougherty, Elliot, Dan Gregory, Avery Ilardi", "The Feast (2021)": "Synopsis : Filmed in Welsh, the picture follows a young woman serving privileged guests at a dinner party in a remote house in rural Wales. The assembled guests do not realize they are about to eat their last supper.\nDirector:Lee Haven Jones\nStars:Annes Elwy, Nia Roberts, Julian Lewis Jones, Steffan Cennydd", "Old (2021)": "Synopsis : A vacationing family discovers that the secluded beach where they're relaxing for a few hours is somehow causing them to age rapidly, reducing their entire lives into a single day.\nDirector:M. Night Shyamalan\nStars:Gael García Bernal, Vicky Krieps, Rufus Sewell, Alex Wolff", "King Richard (2021)": "Synopsis : A look at how tennis superstars Venus and Serena Williams became who they are after the coaching from their father Richard Williams.\nDirector:Reinaldo Marcus Green\nStars:Will Smith, Aunjanue Ellis, Jon Bernthal, Saniyya Sidney", "Tick Tick Boom (2021)": "Synopsis : On the cusp of his 30th birthday, a promising young theater composer navigates love, friendship and the pressures of life as an artist in New York City.\nDirector:Lin-Manuel Miranda\nStars:Andrew Garfield, Alexandra Shipp, Robin de Jesus, Vanessa Hudgens", "The Pizzagate Massacre (2021)": "Synopsis : A dark social satire inspired by the real life conspiracy theory known as Pizzagate. An amateur journalist and a far-right militiaman team up to expose the ugly truth behind rumors involving sex cults, a pizza place and the lizard people.\nDirector:John Valley\nStars:Lee Eddy, John Valley, Gary Teague, Tinus Seaux", "Hide and Seek (2021)": "Synopsis : When a wealthy businessman follows a lead to find his missing brother, he dives headlong into a twisted underworld of squatters and vagrants that threatens to tear apart his family as he struggles to maintain his sanity.\nDirector:Joel David Moore\nStars:Mustafa Shakir, Joe Pantoliano, Jonathan Rhys Meyers, Jacinda Barrett", "She Paradise (2021)": "Synopsis : A teenage girl stumbles upon a free-spirited dance crew, leading to alluring but unsettling encounters with nightlife and money.\nDirector:Maya Cozier\nStars:Michael Cherrie, Kimberly Crichton, Denisia Latchman, Kern Mollineau", "A House on the Bayou (2021)": "Synopsis : Follows a troubled couple and their daughter who go on vacation to an isolated house in the Louisiana bayou to reconnect as a family. But when unexpected visitors arrive, the unity starts to unravel.\nDirector:Alex McAulay\nStars:Angela Sarafyan, Paul Schneider, Lia McHugh, Jacob Lofland", "Heart of Champions (2021)": "Synopsis : During their last year at an Ivy League college in 1999, a group of friends and crew teammates' lives are changed forever when an army vet takes over as coach of their dysfunctional rowing team.\nDirector:Michael Mailer\nStars:Michael Shannon, Alexander Ludwig, Charles Melton, Alex MacNicoll", "Freeland (2021)": "Synopsis : An aging pot farmer finds her world shattered as she races to bring in what could be her final harvest.\nDirectors:Mario Furloni,\n|     Stars:Lily Gladstone, Frank Mosley, Krisha Fairchild, Cameron James Matthews", "Last Night in Soho (2021)": "Synopsis : An aspiring fashion designer is mysteriously able to enter the 1960s where she encounters a dazzling wannabe singer. But the glamour is not all it appears to be and the dreams of the past start to crack and splinter into something darker.\nDirector:Edgar Wright\nStars:Thomasin McKenzie, Anya Taylor-Joy, Matt Smith, Diana Rigg", "Zeros and Ones (2021)": "Synopsis : An American soldier stationed in Rome with the Vatican blown up, embarks on a hero's journey to uncover and defend against an unknown enemy threatening the entire world.\nDirector:Abel Ferrara\nStars:Ethan Hawke, Valerio Mastandrea, Cristina Chiriac, Babak Karimi", "Bruised (2021)": "Synopsis : A disgraced MMA fighter finds redemption in the cage and the courage to face her demons when the son she had given up as an infant unexpectedly reenters her life.\nDirector:Halle Berry\nStars:Halle Berry, Adan Canto, Sheila Atim, Adriane Lenox", "Fisher (2021)": "Synopsis : A female sleuth sashays through the back lanes and jazz clubs of Melbourne in the late 1920s, fighting injustice with her pearl-handled pistol and her dagger-sharp wit.\nStars:\nNathan Page, Hugo Johnstone-Burt, Ashleigh Cummings", "Blue Moon Ball (2021)": "Synopsis : Grace Montague, a writer, returns to her hometown to finish her final novel. Upon arriving home she finds her first love, Sean, desperate to save the town's historic ballroom, and needs her help the night of the rare Blue Moon Ball.\nDirector:Tara Cowell-Plain\nStars:Oscar Balderrama, Jon Briddell, Brianne Buishas, Marco DelVecchio", "Divided We Fall (2021)": "Synopsis : A group of girls from the hood commit a robbery that has their lives spinning out of control.\nDirector:Jamal Doctor\nStars:Dan Sheynin, Kyah Baby, Yellow Diamond, Jamal Doctor", "The Towel Man (2021)": "Synopsis : A serial rapist terrorizes a small town and becomes infamously known as the Towel Man.\nDirector:Anthony Rolando Brown\nStars:Djuan Artist, Cassandra Ayers, Antonette Brown, Stephanie Elliot", "Madison Baker Was Here (2021)": "Synopsis : On her last night in town, a shy teenager sneaks out with her best friends to throw caution to the wind and confess her feelings to her longtime crush.\nDirector:Matt Gray\nStars:Joe Getty, Izzy Weaver, Madeline L'Engle, DeLanoye Robertson", "Noahs Shark (2021)": "Synopsis : A fame-seeking televangelist and his film crew team set out to find the fabled Noah's Ark, but discover it is guarded by both an ancient curse and a prehistoric great white shark.\nDirector:Mark Polonia\nStars:Jeff Kirkendall, Ryan Dalton, Jamie Morgan, Tim Hatch", "Introducing Jodea (2021)": "Synopsis : A struggling young actress's fortunes change when the a world famous movie director drives into the back of her car.\nDirector:Jon Cohen\nStars:Miles Faber, Chloe Traicos, Lou Pizarro, Sammy Anderson", "Sanzaru (2020)": "Synopsis : As dementia engulfs her employer, a fragile home health aide begins to question her own sanity.\nDirector:Xia Magnus\nStars:Aina Dumlao, Justin Arnold, Matthew Albrecht, Jon Viktor Corpuz", "Don't Say Its Name (2021)": "Synopsis : After environmental activist Kharis Redwater is called back to the living world by her mother Mary Lynn after a questionable \"accident\" that cost Kharis her life, an ancient spirit is\nDirector:Rueben Martell\nStars:Sera-Lys McArthur, Madison Walsh, Julian Black Antelope, Samuel Marty", "The Zeme (2021)": "Synopsis : A developer relocates to a remote island with his family, where the cursed land takes over his soul and makes him a killer.\nDirector:Goldie Dhillon\nStars:Nick Preston, Shenandoah Adams, Leysan Timirboulatova, Alexis Frison", "Motherly (2021)": "Synopsis : A father recounts to his children - through a series of flashbacks - the journey he and his four best friends took leading up to him meeting their mother.\nStars:\nJason Segel, Cobie Smulders, Neil Patrick Harris", "Night Night (2021)": "Synopsis : An aspiring fashion designer is mysteriously able to enter the 1960s where she encounters a dazzling wannabe singer. But the glamour is not all it appears to be and the dreams of the past start to crack and splinter into something darker.\nDirector:Edgar Wright\nStars:Thomasin McKenzie, Anya Taylor-Joy, Matt Smith, Diana Rigg", "Repeat (2021)": "Synopsis : While trying to make his sister's wedding day go smoothly, Jack finds himself juggling an angry ex-girlfriend, an uninvited guest with a secret, a misplaced sleep sedative, and the girl that got away in alternate versions of the same day.\nDirector:Dean Craig\nStars:Sam Claflin, Olivia Munn, Freida Pinto, Eleanor Tomlinson", "Adele One Night Only (2021)": "Synopsis : A primetime special welcoming back the superstar performer with an extraordinary concert performance that includes the earliest opportunity to hear her first new material in six years.\nDirector:Paul Dugdale\nStars:Adele, Oprah Winfrey, James Corden, Portia de Rossi", "The Accursed (2021)": "Synopsis : Hana spends twenty years suppressing a maleficent curse that was placed upon her bloodline, only to have a family member knowingly release it forcing her to kill or to be killed.\nDirectors:Kathryn Michelle,\n|     Stars:Yancy Butler, Izabela Vidovic, George Harrison Xanthis, Maiara Walsh", "The Legend of Jack and Jill (2021)": "Synopsis : A horror retelling of the nursery rhyme Jack and Jill. A group of friends grieving a recent loss meet up with one another only to discover they are being hunted by Jack and Jill.\nDirector:Jack Peter Mundy\nStars:Jo Barker, Sarah T. Cohen, Beatrice Fletcher, Clint Gordon", "The Book of Vision (2021)": "Synopsis : Eva, a mysterious doctor, searches for an answer to her urgent dilemma as she unravels Dr. Anmuth's Book of Vision. Stellan gets involved in her life and is forced to confront his own nature, as Eva faces the biggest decision of her life.\nDirector:Carlo Hintermann\nStars:Charles Dance, Lotte Verbeek, Sverrir Gudnason, Filippo Nigro", "The Pebble and the Boy (2021)": "Synopsis : The story follows John Parker, a 19 year old from Manchester who embarks on a journey to Brighton, the spiritual home of the Mods, on an old Lambretta scooter left to him by his father. The\nDirector:Chris Green\nStars:Jesse Birdsall, Max Boast, Rick S. Carr, Julian Clapton", "Red Notice (2021)": "Synopsis : An Interpol agent tracks the world's most wanted art thief.\nDirector:Rawson Marshall Thurber\nStars:Dwayne Johnson, Ryan Reynolds, Gal Gadot, Ritu Arya", "Clifford the Big Red Dog (2021)": "Synopsis : A young girl's love for a tiny puppy named Clifford makes the dog grow to an enormous size.\nDirector:Walt Becker\nStars:Darby Camp, Jack Whitehall, Izaac Wang, John Cleese", "Passing (2021)": "Synopsis : \"Passing\" follows the unexpected reunion of two high school friends, whose renewed acquaintance ignites a mutual obsession that threatens both of their carefully constructed realities.\nDirector:Rebecca Hall\nStars:Tessa Thompson, Ruth Negga, André Holland, Bill Camp", "Shang-Chi and the Legend of the Ten Rings (2021)": "Synopsis : Shang-Chi, the master of weaponry-based Kung Fu, is forced to confront his past after being drawn into the Ten Rings organization.\nDirector:Destin Daniel Cretton\nStars:Simu Liu, Awkwafina, Tony Chiu-Wai Leung, Ben Kingsley", "No Time to Die (2021)": "Synopsis : James Bond has left active service. His peace is short-lived when Felix Leiter, an old friend from the CIA, turns up asking for help, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.\nDirector:Cary Joji Fukunaga\nStars:Daniel Craig, Ana de Armas, Rami Malek, Léa Seydoux", "The Electrical Life of Louis Wain (2021)": "Synopsis : English artist Louis Wain rises to prominence at the end of the 19th century for his surreal cat paintings that seemed to reflect his declining sanity.\nDirector:Will Sharpe\nStars:Benedict Cumberbatch, Claire Foy, Andrea Riseborough, Toby Jones", "Finch (2021)": "Synopsis : On a post-apocalyptic earth, a robot, built to protect the life of his creator's beloved dog, learns about life, love, friendship and what it means to be human.\nDirector:Miguel Sapochnik\nStars:Tom Hanks, Caleb Landry Jones, Marie Wagenman, Lora Martinez-Cunningham", "The Harder They Fall (2021)": "Synopsis : When an outlaw discovers his enemy is being released from prison, he reunites his gang to seek revenge in this Western.\nDirector:Jeymes Samuel\nStars:Jonathan Majors, Zazie Beetz, RJ Cyler, Edi Gathegi", "Dangerous (2021)": "Synopsis : Desperate to take care of his pregnant wife before a terminal illness can take his life, Dodge Tynes accepts an offer to participate in a deadly game where he soon discovers that he's not the hunter - but the prey.\nStars:\nSarah Gadon, Christoph Waltz, Zach Cherry", "The Bezonians (2021)": "Synopsis : In the Bezonians social club in North London, A group of down and outs scheme, plot and dream of becoming rich and breaking out of the monotony of their dreary and financially impotent lives.\nDirector:Savvas D. Michael\nStars:Marina Sirtis, Vinnie Jones, Christopher Sciueref, Kem Hassan", "Night At The Eagle Inn (2021)": "Synopsis : Fraternal twins spend a hellish night at the remote inn their father disappeared from the night they were born.\nDirector:Erik Bloomquist\nStars:Amelia Dudley, Taylor Turner, Greg Schweers, Beau Minniear", "The Spore (2021)": "Synopsis : The lives of ten strangers intersect through a terrifying chain of events as a mutating fungus begins to spread through a small town wiping out everyone that comes into contact with it.\nDirector:D.M. Cunningham\nStars:Jeanie Jefferies, Haley Heslip, Peter Tell, Jackson Ezinga", "Isolation (2021)": "Synopsis : Nine tales of terror weave together the story of isolated citizens around the world as they confront their darkest fears in an attempt to survive an increasingly deadly outbreak.\nDirectors:Alix Austin,\nLarry Fessenden, Dennie Gordon, Andrew Kasch, Kyle I. Kelley, Alexandra Neary, Christian Pasquariello, Zach Passero, Bobby Roe, Keir Siewert|     Stars:Alix Austin, Bob Ballou, Fine Belger, Jack Bennett", "Carolina's Calling (2021)": "Synopsis : Add a Plot\nDirector:Michael Saquella\nStars:Antonio Sabato Jr., Stacey Dash, Jacob Hopkins, Savanah Moss", "Bigfoot Famous (2021)": "Synopsis : When a viral video of Bigfoot emerges, a once popular influencer goes on a mission to film a vlog with Bigfoot and regain her fame.\nDirectors:Sam Milman,\n|     Stars:Steph Barkley, Chris Kleckner, Sam Milman, Lauren Howard Hayes", "The Covid Killer (2021)": "Synopsis : A serial killer the media has dubbed \"The Covid Killer\" is terrorizing the citizens of New York during the coronavirus pandemic.\nDirector:Jeff Knite\nStars:Jeff Knite, Paugh Shadow, Johnny Careccia, Mike Benz", "Electric Jesus (2020)": "Synopsis : Alabama preacher's daughter runs off with a touring Christian hair metal band during the summer of 1986.\nDirector:Chris White\nStars:Brian Baumgartner, Judd Nelson, Rhoda Griffis, Claire Bronson", "The Eyes of Tammy Faye (2021)": "Synopsis : An intimate look at the extraordinary rise, fall and redemption of televangelist Tammy Faye Bakker.\nDirector:Michael Showalter\nStars:Jessica Chastain, Andrew Garfield, Cherry Jones, Vincent D'Onofrio", "Flag Day (2021)": "Synopsis : A father lives a double life as a counterfeiter, bank robber and con man in order to provide for his daughter.\nDirector:Sean Penn\nStars:Mitchell McCormick, Tom Anniko, Dylan Penn, Regina King", "13 Minutes (2021)": "Synopsis : Four families in a Heartland town are tested in a single day when a tornado hits, forcing paths to cross and redefining the meaning of survival.\nDirector:Lindsay Gossling\nStars:Amy Smart, Thora Birch, Anne Heche, Sofia Vassilieva", "Outlier (2021)": "Synopsis : An entry in the new sub-genre of \"movies made in lock-down\". Olivia Davis escapes her abuser with the help of a kind stranger, but his intentions are not yet clear to her. She must figure out the situation and escape her nightmare.\nDirector:Nate Strayer\nStars:Jessica Denton, Thomas Cheslek, Kally Khourshid, Nate Strayer", "Curtis (2020)": "Synopsis : A former basketball star battles with his mental illness while scouring the streets of Detroit with a young boy, in search of his lost high school championship ring.\nDirector:Chris Bailey\nStars:Alex Henderson, Dwight Henry, Kalena Knox, Thaddeus Street", "Lost Outlaw (2021)": "Synopsis : A Chinese gold mining camp is over-run by a group of outlaws. One of the outlaws has to question his morals after meeting the woman of his dreams.\nDirector:Darrell Mapson\nStars:David Novak, Jeffrey Smith, Heather Marie Peterson, Darrell Mapson", "Decrypted (2021)": "Synopsis : An outrageous and provocative dark comedy about a mismatched NSA team who kidnap the creator of Bitcoin - Satoshi Nakamoto - and attempt to torture him for the information they need to destroy cryptocurrencies.\nDirector:Tom Sands\nStars:Sophia Myles, David Hoflin, Amanda Abbington, Kevin McNally", "Torn from Her Arms (2021)": "Synopsis : True story of a mother and daughter who finds their way back to each other after being separated.\nDirector:Alan Jonsson\nStars:Vicky Araico, Kerry Ardra, Jose Becerra, Catalina Botello", "Coyote Creek Christmas (2021)": "Synopsis : The fate of the Coyote Creek Inn and Paige's relationships are both left to the magic of the holiday season to decide.\nDirector:David I. Strasser\nStars:Ryan Paevey, Janel Parrish, Cameron Bancroft, Naomi King", "Nine Days (2020)": "Synopsis : A reclusive man conducts a series of interviews with human souls for a chance to be born.\nDirector:Edson Oda\nStars:Winston Duke, Brandy Pitcher, Eric Ramaekers, Eliza de Azevedo Brown", "Where the Land Meets the Sky (2021)": "Synopsis : A family film about the journey or life and the beauty of second chances.\nDirector:Preston Walden\nStars:Tanya Christiansen, Steve Heinz, Nikole Rossitter, TeriEnna Blanco", "Nobody Sleeps in the Woods Tonight 2 (2021)": "Synopsis : When something horrible happens to the only survivor of a bloody massacre, an insecure rookie cop must overcome his fears to stop further carnage.\nDirector:Bartosz M. Kowalski\nStars:Mateusz Wieclawek, Julia Wieniawa-Narkiewicz, Zofia Wichlacz, Andrzej Grabowski", "Tango Shalom (2021)": "Synopsis : A Tango dancer and a rabbi develop a plan to enter a dance competition without sacrificing his orthodox beliefs. Family, tolerance, and community are tested one dazzling dance step at a time.\nDirector:Gabriel Bologna\nStars:Lainie Kazan, Renée Taylor, Philip Anthony-Rodriguez, Joseph Bologna", "The Spine of Night (2021)": "Synopsis : Ultra-violent, epic fantasy set in a land of magic follows heroes from a different eras and cultures battling against a malevolent force.\nDirectors:Philip Gelatt,\n|     Stars:Richard E. Grant, Lucy Lawless, Patton Oswalt, Betty Gabriel", "Snakehead (2021)": "Synopsis : A Chinese immigrant get caught up in an international crime ring of human smuggling while attempting to make a better life for her family.\nDirector:Evan Jackson Leong\nStars:Sung Kang, Celia Au, Shuya Chang, Devon Diep", "Later Days (2021)": "Synopsis : Four weeks after a mysterious, incurable virus spreads throughout the UK, a handful of survivors try to find sanctuary.\nDirector:Danny Boyle\nStars:Cillian Murphy, Naomie Harris, Christopher Eccleston, Alex Palmer", "Planet Dune (2021)": "Synopsis : A crew on a mission to rescue a marooned base on a desert planet turns deadly when the crew finds themselves hunted and attacked by the planet's apex predators: giant sand worms.\nDirectors:Glenn Campbell,\n|     Stars:Scot Derwingson-Peacock, Sharon Desiree, Sienna Farall, Cherish Holland", "Horror Noire (2021)": "Synopsis : Presents together six horror stories from Black directors and screenwriters in a single film: \"Daddy,\" \"Bride Before You,\" \"Brand of Evil,\" \"The Lake,\" \"Sundown\" and \"Fugue State\".\nDirectors:Zandashé Brown,\nRob Greenlea, Kimani Ray Smith|     Stars:Peter Stormare, Tony Todd, Lesley-Ann Brandt, Lenora Crichlow", "Lamb (2021)": "Synopsis : A childless couple, María and Ingvar discover a mysterious newborn on their farm in Iceland. The unexpected prospect of family life brings them much joy, before ultimately destroying them.\nDirector:Valdimar Jóhannsson\nStars:Noomi Rapace, Hilmir Snær Guðnason, Björn Hlynur Haraldsson, Ingvar Sigurdsson", "Paranormal Activity Next of Kin (2021)": "Synopsis : Margot, a young woman who was abandoned by her mother as a baby, travels to a secluded Amish community with a documentary film crew seeking answers about her mother and extended family.\nDirector:William Eubank\nStars:Emily Bader, Roland Buck III, Dan Lippert, Henry Ayres-Brown", "Apex (2021)": "Synopsis : Six elite hunters pay to hunt down a man on a deserted island, only to find themselves becoming the prey.\nDirector:Edward Drake\nStars:Neal McDonough, Bruce Willis, Corey Large, Alexia Fast", "Army of Thieves (2021)": "Synopsis : A prequel, set before the events of Army of the Dead, which focuses on German safecracker Ludwig Dieter leading a group of aspiring thieves on a top secret heist during the early stages of the zombie apocalypse.\nDirector:Matthias Schweighöfer\nStars:Matthias Schweighöfer, Nathalie Emmanuel, Ruby O. Fee, Stuart Martin", "Hypnotic (2021)": "Synopsis : A young woman seeking self-improvement enlists the help of a renowned hypnotherapist. But after a handful of intense sessions, she discovers unexpected and deadly consequences.\nDirectors:Matt Angel,\n|     Stars:Kate Siegel, Jason O'Mara, Dulé Hill, Lucie Guest", "Sold Out (2021)": "Synopsis : A music-based drama about a female talent scout who takes a down-on-his-luck construction worker under her wing and helps him rise to his potential as a singer/songwriter.\nDirector:Tim Dahlseid\nStars:Sam Bardwell, Kelsey McMahon, Bruce Bohne, Patrick Thomas O'Brien", "Lair (2021)": "Synopsis : When an archaeologist uncovers a strange skull in a foreign land, the residents of a nearby town begin to disappear, leading to further inexplicable occurrences.\nDirector:Ken Russell\nStars:Amanda Donohoe, Hugh Grant, Catherine Oxenberg, Peter Capaldi", "Time Now (2021)": "Synopsis : A young mother returns to her estranged hometown of Detroit after the sudden death of her twin brother and immerses herself in his friend group, soon discovering that his death is not what it seems.\nDirector:Spencer King\nStars:Eleanor Lambert, Claudia Black, Xxavier Polk, Paige Kendrick", "Attached Paranormal (2021)": "Synopsis : A man is found dead in his home deemed suicide for years by the local authorities. Years later tapes of the incident suddenly get released by a local detectives son. Do you believe in the paranormal?\nDirector:Rob Jankowski\nStars:Rob Jankowski, Bonnie Mercado, Jeff Dernlan, Jack Cullinan", "Language Lessons (2021)": "Synopsis : A Spanish teacher and her student develop an unexpected friendship.\nDirector:Natalie Morales\nStars:Mark Duplass, Natalie Morales, Desean Terry, Christine Quesada", "Saving Sloane (2021)": "Synopsis : After spoiled city girl Sloane Emerson gets in trouble yet again, her wealthy parents send her off to the country. There, the rebellious teen ends up forming a bond with the last thing in the world she would've thought - a horse.\nDirector:Steve Franke\nStars:Augustine Frizzell, Bryan Massey, Gerardo Davila, Liz Cardenas", "Women is Losers (2021)": "Synopsis : In 1960s San Francisco, a once-promising catholic school girl, Celina Guerrera, sets out to rise above the oppression of poverty and invest in a future for herself that sets new precedents for the time.\nDirector:Lissette Feliciano\nStars:Lorenza Izzo, Bryan Craig, Simu Liu, Chrissie Fit", "Frank (2021)": "Synopsis : In 1973, when Frank Bledsoe and his 18-year-old niece Beth take a road trip from Manhattan to Creekville, South Carolina, for the family patriarch's funeral, they're unexpectedly joined by Frank's lover, Walid.\nDirector:Alan Ball\nStars:Paul Bettany, Sophia Lillis, Peter Macdissi, Steve Zahn", "The Thieves Code (2021)": "Synopsis : A pickpocket thief in love with her wife also loves her partner in crime and is devastated when she finds that both owe debts to the mafia. The thieves are forced to take on a risky heist\nDirector:Alex Power\nStars:Odelia San Diego, Baraka Noel, Tracy Nguyen, Lily Donovan Seid", "Sweetheart (2021)": "Synopsis : British sitcom in which an unhappily married man discovers he can time travel back to 1940s war-torn London where he masquerades as an MI5 agent and part-time songwriter whilst courting the local barmaid.\nStars:\nVictor McGuire, Christopher Ettridge, Elizabeth Carling", "The Deep House (2021)": "Synopsis : A young and modern couple who go to France to explore an underwater house and share their findings on social media undergoes a serious change of plans when the couple enters the interior of\nDirectors:Alexandre Bustillo,\n|     Stars:Camille Rowe, James Jagger, Eric Savin, Alexis Servaes", "The Devil Came Home (2021)": "Synopsis : A family is torn apart when the stepfather's PTSD appears to develop into something far more sinister\nDirector:George McCluskey\nStars:Greg Hobbs, Jade Callender, Diane Ellis, Nick Sheard", "Night Teeth (2021)": "Synopsis : A college student moonlighting as a chauffeur picks up two mysterious women for a night of party-hopping across LA. But when he uncovers their bloodthirsty intentions - and their dangerous, shadowy underworld - he must fight to stay alive.\nDirector:Adam Randall\nStars:Jorge Lendeborg Jr., Debby Ryan, Lucy Fry, Raúl Castillo", "Happy Family 2 (2021)": "Synopsis : Raymond's brother visits and charms Arthur into lending him money; Eva's love life causes disruption in the Crabtree household.\nDirector:Robin Nash\nStars:William Gaunt, Patricia Garwood, Marcia Warren, Michael Sharvell-Martin", "Bergman Island (2021)": "Synopsis : A couple retreat to the island that inspired Ingmar Bergman to write screenplays for their upcoming films when the lines between reality and fiction start to blur.\nDirector:Mia Hansen-Løve\nStars:Vicky Krieps, Tim Roth, Grace Delrue, Mia Wasikowska", "Don't Let Her In (2021)": "Synopsis : When an attractive young couple rents out a room in their spacious loft to an eccentric, beautiful female artist, they soon live to regret it. Slowly but surely, their seductive new tenant\nDirector:Ted Nicolaou\nStars:Kelly Curran, Lorin Doctor, Austin James Parker, Cole Pendery", "Soul Pursuit (2021)": "Synopsis : After tragic events, a man and his dog seek solitude in the Oregon Columbia Gorge by hiking to the nations second highest waterfall. Winner for best feature film at Lift Off film festival Jan 2021.\nDirector:Larry Humphrey\nStars:Eric Roberts, Noel Gugliemi, Larry Humphrey, Tricia Pyle", "Farm to Fork to Love (2021)": "Synopsis : Alice, a young and talented sous chef at NY's top restaurant, receives an invitation to judge a food competition for a prestigious annual fundraiser. Despite the dismay of Bret, her boss\nDirector:Sandra L. Martin\nStars:Meggan Kaiser, Scot Cooper, Maurice Johnson, Patty Lambert", "Shark Huntress (2021)": "Synopsis : Venturing into the deep sea to battle the plastics industry and a blood-thirsty shark seeking revenge for her environmentalist mother's death.\nDirector:John Riggins\nStars:Katrina Grey, Dean Alexandrou, John Flano, Russell Geoffrey Banks", "Love in a Bottle (2021)": "Synopsis : Two people in two different countries, both in quarantine during lockdown time, have a love affair through Facetime- but how viable is a relationship that might as well be just a fantasy?\nDirector:Paula van der Oest\nStars:Hannah Hoekstra, James Krishna Floyd", "Amityville Cop (2021)": "Synopsis : A city haunted by a bloody past has led to the emergence of some serious police brutality. As bodies pile up, two detectives seek to stop a demonic force that is terrorizing the neighborhood.\nDirector:Gregory Hatanaka\nStars:Jason Toler, Nicole D'Angelo, Chris Spinelli, Jeffrey Moon", "White Sky (2021)": "Synopsis : A strange alien invasion strands a trio of campers in a distant forest where they attempt to survive and hide\nDirector:Adam Wilson\nStars:Ade Dimberline, Natalie Martins, Monika Gergelova, Makenna Guyler", "Coppelia (2021)": "Synopsis : When everyone in town falls under the spell of charismatic cosmetic surgeon Doctor Coppelius, feisty Swan must save her sweetheart Franz before his heart is used to spark life into Coppelia, the robot-woman the Doctor has created.\nDirectors:Steven de Beul,\nJeff Tudor|     Stars:Michaela DePrince, Daniel Camargo, Vito Mazzeo, Glynis Terborg", "The Thing Inside Us (2021)": "Synopsis : Daniel and Shelly have lost everything to the LV pandemic that has currently engulfed the world. Most show no symptoms to the disease, but Daniel barely survived the infection. Shelly seems\nDirector:Paul Catalanotto\nStars:Christine Tonry, Chad Graham, Ruben Juarbe, Escalante Lundy", "Pretenders (2021)": "Synopsis : A specially gifted man, with the ability to instantly master any skill, escapes from a secret testing facility and travels the country taking on different jobs and helping strangers while hiding from his kidnappers.\nStars:\nAndrea Parker, Patrick Bauchau, Jon Gries", "Last Testament (2021)": "Synopsis : The truth about the urban legend is finally revealed by George Harrison in newly discovered secret audio tapes: Paul McCartney was killed in a car crash in 1966 and replaced with a double!\nDirector:Joel Gilbert\nStars:Paul McCartney, George Harrison, John Lennon, Ringo Starr", "Fear PHarm 2 (2021)": "Synopsis : Melanie has just gained consciousness to discover that she is being held hostage by the Walker family so they can harvest her special skin in order to create a breakthrough skin care cream, and bloom the business; also she's not alone..\nDirector:Dante Yore\nStars:John Littlefield, Aimee Stolte, Tiana Tuttle, Mario Rocha", "Dashcam (2021)": "Synopsis : Two friends on a horror-fueled road trip and livestream the most terrifying night of their lives.\nDirector:Rob Savage\nStars:Annie Hardy, Amar Chadha-Patel, Angela Enahoro, Seylan Baxter", "Runt (2021)": "Synopsis : Neglected and unsupervised, a group of high school seniors are pulled into a downward cycle of violence.\nDirector:William Coakley\nStars:Brianna Hildebrand, Cyrus Arnold, Cameron Boyce, Jason Patric", "After We Fell (2021)": "Synopsis : Just as Tessa makes the biggest decision of her life, everything changes. Revelations about her family, and then Hardin's, throw everything they knew before in doubt and makes their hard-won future together more difficult to claim.\nDirector:Castille Landon\nStars:Josephine Langford, Hero Fiennes Tiffin, Louise Lombard, Chance Perdomo", "The Wedding Trip (2021)": "Synopsis : When Jack, a groomsman, leaves for his best friend's wedding several states away, he's asked to pick up Samantha, a stranded bridesmaid. Jack discovers they've met before and have had a less than friendly past.\nDirector:Sean King\nStars:Sydney Bakich, Bart Blachnio, Edwina Rai, Carson Lee Bradshaw", "Signed, Sealed Delivered The Vows We Have Made (2021)": "Synopsis : Follows Shane and Oliver who help a young boy fighting leukemia reunite with his long-lost friend while preparing for their wedding. Also, Rita and Norman deal with the challenges of trying to start a family.\nDirector:Linda-Lisa Hayter\nStars:Eric Mabius, Kristin Booth, Yan-Kay Crystal Lowe, Geoff Gustafson", "Grave Intentions (2021)": "Synopsis : In this anthology of chills, thrills, and kills, a practitioner of the magical arts teaches the basics of her craft. The most important lesson? You must be mindful of your intention. Five\nDirectors:Lukas Hassel,\nGabriel Olson, Matthew Richards, Brian Rish, Jocelyn Rish, Jaime Snyder|     Stars:Joy Vandervort-Cobb, Beth Grant, Sharon Lawrence, Catherine Carlen", "Honey Girls (2021)": "Synopsis : Mega pop star, Fancy G (Ashanti), hosts a contest to find the next big solo artist. But the young contestants realize they are \"better together\" and secretly form a band called Honey Girls and become a huge hit cloaked in mystery.\nDirector:Trey Fanjoy\nStars:Ashanti, Ava Grace, Aliyah Mastin, Frankie McNellis", "Aiyai Wrathful Soul (2020)": "Synopsis : A neighbourhood is plagued by mysterious tragedies when a young man becomes the conduit for an unknown spirit, the 'AIYAI' which lures victims to their chilling fates.\nDirector:Ilanthirayan Alan Arumugam\nStars:Richard Huggett, Korey Williams, Tahlia Jade Holt, Kabir Singh", "A Brixton Tale (2021)": "Synopsis : Wealthy YouTuber Leah chooses shy youth Benji as the subject of her Brixton documentary. They fall for each other, but the desire for edgy footage leads them down a violent path.\nDirectors:Darragh Carey,\n|     Stars:Barney Harris, Lily Newmark, Michael Maloney, Jaime Winstone", "Whitetail (2021)": "Synopsis : The great hunter Buck Ferguson (Josh Brolin) and his trusted cameraman Don (Danny McBride) set out for an epic weekend adventure to reconnect with Buck's young son (Montana Jordan).\nDirector:Jody Hill\nStars:Josh Brolin, Danny McBride, Montana Jordan, Scoot McNairy", "Slumber Party Massacre (2021)": "Synopsis : A female high school student's slumber party turns into a bloodbath, as a newly escaped psychotic serial killer wielding a power drill prowls her neighborhood.\nDirector:Amy Holden Jones\nStars:Michelle Michaels, Robin Stille, Michael Villella, Debra De Liso", "Dune (2021)": "Synopsis : Feature adaptation of Frank Herbert's science fiction novel about the son of a noble family entrusted with the protection of the most valuable asset and most vital element in the galaxy.\nDirector:Denis Villeneuve\nStars:Timothée Chalamet, Rebecca Ferguson, Zendaya, Oscar Isaac", "The Blazing World (2021)": "Synopsis : Decades after the accidental drowning of her twin sister, a self-destructive young woman returns to her family home, finding herself drawn to an alternate dimension where her sister may still be alive.\nDirector:Carlson Young\nStars:Carlson Young, Udo Kier, Dermot Mulroney, Vinessa Shaw", "The Four of Us (2021)": "Synopsis : After a four-week partner swap, two couples meet again in a remote beach house and discover that everything has changed. Suddenly, their feelings are put to the test and they start reevaluating their life choices and expectations.\nDirector:Florian Gottschick\nStars:Nilam Farooq, Paula Kalenberg, Jonas Nay, Louis Nitsche", "The Forgotten Battle (2020)": "Synopsis : 1944, the Second World War. A British glider pilot, a Dutch boy fighting on the German side and a Dutch female resistance member all end up involved in the Battle of the Schelde. Their choices differ, but their goal is the same: freedom.\nDirector:Matthijs van Heijningen Jr.\nStars:Gijs Blom, Jamie Flatters, Susan Radder, Jan Bijvoet", "The Trip (2021)": "Synopsis : A dysfunctional couple head to a remote cabin to reconnect, but each has intentions to kill the other. Before they can carry out their plans, unexpected visitors arrive and they face a greater danger.\nDirector:Tommy Wirkola\nStars:Noomi Rapace, Aksel Hennie, Atle Antonsen, Christian Rubeck", "Breaking Them Up (2020)": "Synopsis : When resourceful 15 year-old Damien decides that his parents are all wrong for each other, he enlists best friend Erin to help him set them up with other people.\nDirector:Scott Dow\nStars:Stephen Schneider, Kelen Coleman, Jakob Wedel, Tess Aubert", "Warning (2021)": "Synopsis : The meaning of life explored through multiple interconnected lives set in the near future.\nDirector:Agata Alexander\nStars:Thomas Jane, Tomasz Kot, Toni Garrn, Rupert Everett", "Halloween Kills (2021)": "Synopsis : The saga of Michael Myers and Laurie Strode continues in the next thrilling chapter of the Halloween series.\nDirector:David Gordon Green\nStars:Jamie Lee Curtis, Judy Greer, Andi Matichak, James Jude Courtney", "Needle in a Timestack (2021)": "Synopsis : Nick and Janine live in marital bliss until Janine's ex-husband warps time to try to tear them apart. As Nick's memories disappear, he must decide what he's willing to sacrifice in order to hold onto - or let go of - everything he loves.\nDirector:John Ridley\nStars:Leslie Odom Jr., Freida Pinto, Cynthia Erivo, Orlando Bloom", "Amityville Cult (2021)": "Synopsis : After unexpectedly, and mysteriously, inheriting his estranged grandmother's mansion, Stanley DeFeo finds himself in the small town of Amityville - surrounded by buried family secrets and a sinister plot against him.\nDirector:Trey Murphy\nStars:Chance Gibbs, Micha Marie Stevens, Tom Young, Patrick McAlister", "The Cleveland Kidnappings (2021)": "Synopsis : Follows the story of Michelle Knight and Gina DeJesus, as they recount the horrors they suffered when they were kidnapped.\nDirector:Camilla Hall\n", "Copshop (2021)": "Synopsis : On the run from a lethal assassin, a wily con artist devises a scheme to hide out inside a small-town police station-but when the hitman turns up at the precinct, an unsuspecting rookie cop finds herself caught in the crosshairs.\nDirector:Joe Carnahan\nStars:Gerard Butler, Frank Grillo, Alexis Louder, Toby Huss", "Megan (2021)": "Synopsis : Two teenage girls encounter an Internet child predator.\nDirector:Michael Goi\nStars:Amber Perkins, Rachel Quinn, Dean Waite, Jael Elizabeth Steinmeyer", "The Cleaner (2021)": "Synopsis : Paul 'Wicky' Wickstead, a state-certified cleaning technician, is responsible for the removal of any signs of death from the crime scenes.\nStars:\nZita Sattar, Helena Bonham Carter, Jo Hartley", "They Who Surround Us (2020)": "Synopsis : A Ukrainian farmer living in Alberta loses his wife in a tragic accident. Guilt and grief send him into an emotional spiral where mysterious and inexplicable events force him to relive traumatic incidents from his childhood in Ukraine.\nDirector:Troy Ruptash\nStars:Ali Liebert, Vera Graziadei, Ryan Northcott, Troy Ruptash", "Spirit Quest (2021)": "Synopsis : Two friends go on a hallucinogenic mushroom trip through the desert to face their fears, doubts, and failures.\nDirector:Brent Lydic\nStars:Tip Scarry, Brent Lydic, Navaris Darson, Tim Fox", "Envision (2021)": "Synopsis : Thomas had the perfect life until he lost his wife and Son. After a ground-breaking surgery he is given an implant that allows him to create his own virtual reality on the fly.\nDirector:Greg Galloway\nStars:Towanda Braxton, Mchael Butler, Case, Andre Hall", "Dwellers (2021)": "Synopsis : A comic book artist Whitney Taylor is doomed to repeat history in a most grotesque way when she unleashes a demon after drawing it..\nDirector:John Carl Buechler\nStars:Yvonne De Carlo, Debrah Farentino, Brian Robbins, Pamela Bellwood", "The Poltergeist Diaries (2021)": "Synopsis : After moving to an isolated cabin, Jacob Taylor vanishes without a trace. With the help of footage he leaves behind, his family members, friends and a detective try to find answers to the strange events that are centered around him.\nDirector:József Gallai\nStars:András Korcsmáros, Kata Kuna, Eric Roberts, Péter Inoka", "On the Fringe of Wild (2021)": "Synopsis : A 2000s \"Romeo and Juliet\" type romance between two teenage boys, set in a small Ontario town, where love does not win, but the surviving players grow to accept themselves as members of the LGBTQ+ community.\nDirector:Emma Catalfamo\nStars:Andrew Bee, Harrison Browne, Andrea Pavlovic, Bernadette Medhurst", "Oh Crappy Day (2021)": "Synopsis : A young filmmaker hopes to find love through online dating -- if he can just keep his OCD on the down low.\nDirector:Jon Lance Bacon\nStars:Ashton Leigh, John Wilkins III, Loosha Jones, Jaime Wallace", "Lust Life Love (2021)": "Synopsis : A star-crossed love story set in the world of polyamory and sex parties in New York City.\nDirectors:Benjamin Feuer,\n|     Stars:Jake Choi, Makeda Declet, Jeanna Han, Stephanie Sellars", "The Ghosts of Borley Rectory (2021)": "Synopsis : Harry Price investigates the ghosts of Borley Rectory during his stay there.\nDirector:Steven M. Smith\nStars:Toby Wynn-Davies, Julian Sands, Colin Baker, Christopher Ellison", "Ankle Biters (2021)": "Synopsis : 3 Feet Tall, with 2 Inch fangs and an Undying thirst for Blood. Drexel Vennis, Half Human/Half Vampire, along with his sidekick T-Bone, must stop dwarf vampires from unleashing a plague of vampires, before its too late.\nDirector:Adam Minarovich\nStars:Adam Minarovich, Jeremy Busbee, Michael Moore, Catherine Minarovich", "Hypocritical (2021)": "Synopsis : The parallel stories of a modern preacher and a medieval monk, Gabriel the Ascetic, who is killed by an ignorant mob for making a nude statue representing Truth, which is also represented by a ghostly naked girl who flits throughout the film.\nDirector:Lois Weber\nStars:Courtenay Foote, Myrtle Stedman, Herbert Standing, Adele Farrington", "Parallel (2020)": "Synopsis : The story of two mothers who give birth the same day.\nDirector:Pedro Almodóvar\nStars:Penélope Cruz, Aitana Sánchez-Gijón, Rossy de Palma, Milena Smit", "Demigod (2021)": "Synopsis : Upon the death of her grandfather, a woman and her husband return to her birthplace in Germany's Black Forest, only to find a terrifying secret awaits them.\nDirector:Miles Doleac\nStars:Rachel Nichols, Yohance Myles, Miles Doleac, Lindsay Anne Williams", "Aileen Wuornos(2021)": "Synopsis : Based on Aileen Wuornos's early life, America's most notorious female serial killer, back in 1976 a young Aileen arrives in Florida searching for a new life that will help her escape her\nDirector:Daniel Farrands\nStars:Peyton List, Tobin Bell, Lydia Hearst, Swen Temmel", "South Beach Love (2021)": "Synopsis : Follows a story about rival quinceañeras, glorious Cuban cooking, friendship, family and romance.\nDirector:Damián Romay\nStars:William Levy, Taylor Cole, Giselle Torres, Ariel Yasmine", "Witnesses (2021)": "Synopsis : Crimes through the eyes of a team of forensic pathologists and forensic scientists.\nStars:\nWilliam Gaminara, Tom Ward, David Caves", "Mickey's Tale of Two Witches (2021)": "Synopsis : On Halloween, Mickey tells Pluto a story about two witches-in-training, Minnie the Wonderful and Daisy Doozy, who must pass four tests to graduate from the Witch Academy in Happy Haunt Hills.\nDirector:Jeff Gordon\nStars:Bret Iwan, Kaitlyn Robrock, Daniel Ross, Tress MacNeille", "The Last Bus (2021)": "Synopsis : An old man crosses the country just using local buses.\nDirector:Gillies MacKinnon\nStars:Timothy Spall, Phyllis Logan, Natalie Mitson, Ben Ewing", "Muppets Haunted Mansion (2021)": "Synopsis : On Halloween night, Gonzo is challenged to spend one night in The Haunted Mansion.\nDirector:Kirk R. Thatcher\nStars:Will Arnett, Taraji P. Henson, Darren Criss, Yvette Nicole Brown", "Old Henry (2021)": "Synopsis : An action western about a farmer who takes in an injured man with a satchel of cash. When a posse comes for the money, he must decide who to trust. Defending a siege, he reveals a gunslinging talent calling his true identity into question.\nDirector:Potsy Ponciroli\nStars:Tim Blake Nelson, Scott Haze, Gavin Lewis, Trace Adkins", "Vengeance is Mine (2021)": "Synopsis : Harry, a broken man struggling to come to terms with the murder of his wife and daughter is living a hallucinatory life. When he discovers the whereabouts of the killers he awakens from his grief to destroy those who destroyed his life\nDirector:Hadi Hajaig\nStars:Matt Bainbridge, Philip Bulcock, Clint Clarke, Faruk Dogan", "Silent Hours (2021)": "Synopsis : Private detective John Duval, an ex-lieutenant commander in the Royal Navy and Naval Intelligence, finds himself the prime suspect in a police hunt for a sexual killer when three women are brutally murdered.\nDirector:Mark Greenstreet\nStars:Susie Amy, Tom Beard, Hugh Bonneville, Annie Cooper", "American Insurrection (2021)": "Synopsis : Set in a dystopian America where all people who aren't straight, white, Christian and cis gender are kept track of by the government with bar codes.\nDirector:William Sullivan\nStars:Nadine Malouf, Nick Westrate, Brandon Perea, Sarah Wharton", "Ida Red (2021)": "Synopsis : Ida \"Red\" Walker may not survive her terminal illness while incarcerated for armed robbery. She turns to her son, Wyatt, for one last job and a chance to regain her freedom.\nDirector:John Swab\nStars:Josh Hartnett, Frank Grillo, Melissa Leo, Sofia Hublitz", "Injustice (2021)": "Synopsis : On an alternate Earth, the Joker tricks Superman into killing Lois Lane, which causes a rampage in the hero. Superman decides to take control of Earth, Batman and his allies will have to attempt to stop him.\nDirector:Matt Peters\nStars:Justin Hartley, Anson Mount, Laura Bailey, Zach Callison", "Madres (2021)": "Synopsis : The story of two mothers who give birth the same day.\nDirector:Pedro Almodóvar\nStars:Penélope Cruz, Aitana Sánchez-Gijón, Rossy de Palma, Milena Smit", "The Manor (2021)": "Synopsis : After an au pair’s tragic death, Henry hires a young American nanny to care for his orphaned niece and nephew who reside at Bly Manor with the chef Owen, groundskeeper Jamie and housekeeper, Mrs. Grose.\nStars:\nOliver Jackson-Cohen, Amelia Eve, T'Nia Miller", "South of Heaven (2021)": "Synopsis : Convicted felon Jimmy gets early parole after serving twelve years for armed robbery. Upon his release, he vows to give Annie, his childhood love, now dying from cancer, the best last year of her life - unfortunately it's not that simple.\nDirector:Aharon Keshales\nStars:Jason Sudeikis, Evangeline Lilly, Mike Colter, Shea Whigham", "200 Meters (2021)": "Synopsis : A Palestinian father trapped on the other side of the separation wall is trying to reach the hospital for his son.\nDirector:Ameen Nayfeh\nStars:Ali Suliman, Anna Unterberger, Lana Zreik, Gassan Abbas", "You Only Live Once (2021)": "Synopsis : The public defender's secretary and an ex-convict get married and try to make a life together, but a series of disasters sends their lives spiraling out of control.\nDirector:Fritz Lang\nStars:Sylvia Sidney, Henry Fonda, Barton MacLane, Jean Dixon", "Blue Bayou (2021)": "Synopsis : As a Korean-American man raised in the Louisiana bayou works hard to make a life for his family, he must confront the ghosts of his past as he discovers that he could be deported from the only country he has ever called home.\nDirector:Justin Chon\nStars:Justin Chon, Alicia Vikander, Mark O'Brien, Linh-Dan Pham", "There's Someone Inside Your House (2021)": "Synopsis : The graduating class at Osborne High is being targeted by a masked assailant, intent on exposing the darkest secret of each victim, and only a group of misfit outsiders can stop the killings.\nDirector:Patrick Brice\nStars:Sydney Park, Théodore Pellerin, Asjha Cooper, Dale Whibley", "The Pharm (2021)": "Synopsis : Sam, an Afghanistan Veteran turned Pot Farmer, modifies a strain of cannabis to not only grow at a rapid rate, but also drastically reduce cancer cells. When the villainous Mr. Black is\nDirector:Ryan Altman\nStars:Adam Dorsey, Barry Altman, Brian Geiger, Ryan Altman", "BAB (2020)": "Synopsis : The social life of a syrian village in the 1930s under the french colonialism.\nStars:\nMilad Yousef, Ayman Bahnasi, Wafaa Mouselley", "The Last Inn (2021)": "Synopsis : Laura makes an unplanned stay at a peculiar hotel and is trapped in a life-changing game.\nDirector:David Kuan\nStars:Emily Hall, Walker Barnes, Tristan Cunningham, Jamel King", "Dave Chappelle(2021)": "Synopsis : A neurotic mid-20s suburbanite's convinced he's destined to be one of the greatest rappers of all time. Now he's got to prove it to everyone else.\nStars:\nAndrew Santino, Gata, Taylor Misiak", "Monsters of War (2021)": "Synopsis : Something has awoken, and a group of strangers must work together before prehistoric monsters and other deadly creatures take back the planet.\nDirector:Jack Peter Mundy\nStars:Chelsea Greenwood, Aimee Marie Higham, Antonia Johnstone, Sofia Lacey", "Dark Web(2021)": "Synopsis : When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.\nDirector:Christopher Nolan\nStars:Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine", "Monkie Kid(2020)": "Synopsis : Inspired by the classic Chinese story Journey to the West, the series follows the adventures of a young teenager, MK, as he comes into terms of his mission to save the world.\nStars:\nDave B. Mitchell, Stephanie Sheh, David Chen", "Paradox Lost (2020)": "Synopsis : A genre-bending love story about time travel, the end of the world, and long form improvisational comedy.\nDirector:Dennis Curlett\nStars:Clarissa Thibeaux, Danny Cymbal, Dennis Curlett, Sydney Steinberg", "Heaven (2020)": "Synopsis : Balian of Ibelin travels to Jerusalem during the Crusades of the 12th century, and there he finds himself as the defender of the city and its people.\nDirector:Ridley Scott\nStars:Orlando Bloom, Eva Green, Liam Neeson, Martin Hancock", "The Year of the Everlasting Storm (2021)": "Synopsis : Featuring seven stories from seven auteurs from around the world, the film chronicles this unprecedented moment in time, and is a true love letter to the power of cinema and its storytellers.\nDirectors:Anthony Chen,\nJafar Panahi, Laura Poitras, Dominga Sotomayor, Malik Vitthal, Apichatpong Weerasethakul|     Stars:Yay Yay Bobby Jones, Catherine Machovsky, Yu Zhang, Dongyu Zhou", "Escape The Undertaker (2021)": "Synopsis : Can The New Day survive the surprises at The Undertaker's spooky mansion? You can decide their fate!\nDirector:Ben Simms\nStars:Mark Calaway, Ettore Ewen, Kofi Kingston, Austin Watson", "Val (2021)": "Synopsis : Documentary centering on the daily life of actor Val Kilmer featuring never-before-seen footage spanning 40 years.\nDirectors:Ting Poo,\n|     Stars:Val Kilmer, Kevin Bacon, Marlon Brando, Jim Carrey", "Strings (2021)": "Synopsis : A guy and girl try to keep their relationship strictly physical, but it's not long before they learn that they want something more.\nDirector:Ivan Reitman\nStars:Natalie Portman, Ashton Kutcher, Kevin Kline, Cary Elwes", "Because of Charley (2021)": "Synopsis : An estranged racially-mixed stepfamily reluctantly gathers at a Central Florida home for an anniversary party, fully intending to keep the visit brief - but Hurricane Charley takes an unexpected turn that changes everything.\nDirector:Jon Binkowski\nStars:John Amos, Ashley Jones, Joshua Wade, Peg O'Keef", "Sunset on the River Styx (2020)": "Synopsis : A chance meeting of two morose lovers sends them spiraling down a surreal rabbit hole. Their relationship is challenged by their pasts, their futures, their perception of time, and a vampire death cult.\nDirector:Aaron Pagniano\nStars:Phillip Andre Botello, Jacqueline Jandrell, Cory Vaughn, Avery Kristen Pohl", "Distancing Socially (2021)": "Synopsis : Composed of a series of short vignettes that share a telecommunications application as a common thread, Distancing Socially focuses on loosely connected human interactions taking place virtually across a world in lock down.\nDirector:Chris Blake\nStars:Alan Tudyk, Sarah Levy, Melanie Chandra, Karissa Lee Staples", "Events Transpiring Before, During, and After a High School Basketball Game (2020)": "Synopsis : Students, coaches, and players interact at a high school on the evening of a basketball game.\nDirector:Ted Stenson\nStars:Andrew Phung, Paul Cowling, Jay Morberg, Reamonn Joshee", "The Rangers Bloodstone (2021)": "Synopsis : Fueled by determination and love, Elite Ranger Drustan Lorne embarks on a journey to rescue his captured daughter and save Adrasil from the forces of darkness.\nDirector:David Nordquist\nStars:David Nordquist, Dave Quirk, Wendy Tuck, Ken Nordquist", "The Amityville Moon (2021)": "Synopsis : As Alyssa and Karla try to escape from the church home that holds them captive, Karla is slaughtered by a vicious, semi-human creature.\nDirector:Thomas J. Churchill\nStars:Cody Renee Cameron, Michael Cervantes, Sheri Davis, Augie Duke", "The Mutation (2021)": "Synopsis : A scientist experiments with crossing humans and plants, for which he uses his students.\nDirector:Jack Cardiff\nStars:Donald Pleasence, Tom Baker, Brad Harris, Julie Ege", "The Night House (2021)": "Synopsis : A widow begins to uncover her recently deceased husband's disturbing secrets.\nDirector:David Bruckner\nStars:Rebecca Hall, Sarah Goldberg, Vondie Curtis-Hall, Evan Jonigkeit", "Cyst (2020)": "Synopsis : In the 1960s a nurse's last day is ruined when a doctor inadvertently creates a cyst monster that terrorizes the office.\nDirector:Tyler Russell\nStars:Eva Habermann, George Hardy, Greg Sestero, Jason Douglas", "Memoirs of a Black Girl (2021)": "Synopsis : Memoirs of a Black Girl is a Coming-of-Age story of a girl and her friends who are forced to grow up and make tough decisions. Aisha Johnson, an astute and bright student, is one of the\nDirector:Thato Rantao Mwosa\nStars:Christian Thomas, Colin Costello, Alexandra Cruz, Juvan Elisma", "One Summer (2021)": "Synopsis : An aspiring teenage cartoonist and his friends come to the aid of a singer trying to save her family property from developers.\nDirector:Savage Steve Holland\nStars:John Cusack, Demi Moore, Linda Warren, Joel Murray", "White Girl Apokalypse (2021)": "Synopsis : A basic white girl finds herself in the middle of the zombie apocalypse, forcing her to decide what is more important, survival or Starbucks? When she meets a group of survivors with\nDirector:Ashley Wilson\nStars:Angel Alvarez, Gayle Amey, Noah Artis, Brylee Bailey", "Eating Cars (2021)": "Synopsis : Fresh out of a Danish prison, Harald bosses his old gang around, into visiting his hospitalized foster dad, who wants to see his bio son before dying. The son's in a Swedish prison. Then there's a money matter - robbing a bank.\nDirector:Lasse Spang Olsen\nStars:Kim Bodnia, Torkel Petersson, Tomas Villum Jensen, Nikolaj Lie Kaas", "Love Strikes Twice (2021)": "Synopsis : Follows Maggie who is in an out-of-sync marriage and wishes for a do-over and wakes up 15 years earlier, and she would decide if she would choose her husband Josh again or not.\nDirector:Jeff Beesley\nStars:Katie Findlay, Wyatt Nash, Marshall Williams, Brynn Godenir", "Our Father (2021)": "Synopsis : The life stories of the six men who raised the flag at the Battle of Iwo Jima, a turning point in World War II.\nDirector:Clint Eastwood\nStars:Ryan Phillippe, Barry Pepper, Joseph Cross, Jesse Bradford", "One More Flip (2021)": "Synopsis : A final drug deal go wrong landing Demarco Beasley in jail with no one else to turn so he turns to his girlfriend Taji adds dealing drugs already full plate.\nDirector:Jeffrey T. Brown\nStars:Sada Baby, Daris Bass, Marvin Bennett, Kristin Clarke", "Like Dogs (2021)": "Synopsis : A 12-year-old tech prodigy's science experiment goes awry and he forges a telepathic connection with his dog. The duo join forces and use their unique perspectives on life to comically overcome complications of family and school.\nDirector:Gil Junger\nStars:Megan Fox, Josh Duhamel, Gabriel Bateman, Kunal Nayyar", "A Bend in the River (2021)": "Synopsis : The story of a writer who returns to Ireland, after spending twenty five years in New York, to confront the ghosts of his past.\nDirector:Colin Broderick\nStars:John Duddy, Kathy Kiera Clarke, John McConnell, Brendan Broderick", "The Black Book (2021)": "Synopsis : A collector of rare books finds the rumored \"Black Book\". Each of the stories is told by different directors, shot all over the United States.\nDirectors:Topher Chambers,\nSteven Durgarn, Joe Herbert|     Stars:Sherman Burdette, Emmanuel Carter, Heather Chambers, Topher Chambers", "Survive the Game (2021)": "Synopsis : A man's life on his farm is interrupted when a cop and a pair of dangerous criminals show up.\nDirector:James Cullen Bressack\nStars:Chad Michael Murray, Bruce Willis, Swen Temmel, Michael Sirow", "Rise of the Footsoldier(2021)": "Synopsis : In the riveting conclusion of the landmark Skywalker saga, new legends will be born-and the final battle for freedom is yet to come.\nDirector:J.J. Abrams\nStars:Daisy Ridley, John Boyega, Oscar Isaac, Adam Driver", "Blush (2021)": "Synopsis : A stranded horticulturist-astronaut meets an ethereal visitor on a desolate dwarf planet.\nDirector:Joe Mateo\n", "Adventures of a Mathematician (2021)": "Synopsis : The warmhearted story of Polish immigrant and mathematician Stan Ulam, who moved to the U.S. in the 1930s. Stan deals with the difficult losses of family and friends all while helping to create the hydrogen bomb and the first computer.\nDirector:Thor Klein\nStars:Philippe Tlokinski, Esther Garrel, Sam Keeley, Joel Basman", "The Guilty (2021)": "Synopsis : A demoted police officer assigned to a call dispatch desk is conflicted when he receives an emergency phone call from a kidnapped woman.\nDirector:Antoine Fuqua\nStars:Jake Gyllenhaal, Riley Keough, Peter Sarsgaard, Christina Vidal", "Last Man Down (2021)": "Synopsis : John Wood left the pieces of a broken civilisation behind, to go back to his roots in the woodland, after a virus pandemic struck the world.\nDirector:Fansu Njie\nStars:Daniel Stisen, Olga Kent, Daniel Nehme, Stanislav Yanevski", "Rise and Shine, Benedict Stone (2021)": "Synopsis : The story about Benedict Stone and his wife Emilia who got separated after 10 years, when trying for a baby becomes unsuccessful.\nDirector:Peter Benson\nStars:Tom Everett Scott, Ella Ballentine, Mía Maestro, Matt Hamilton", "No One Gets Out Alive (2021)": "Synopsis : An immigrant in search of the American dream who, after being forced to take a room in a boarding house, finds herself in a nightmare she can't escape.\nDirector:Santiago Menghini\nStars:Phil Robertson, Joana Borja, Victoria Alcock, Cristina Rodlo", "The Card Counter (2021)": "Synopsis : Redemption is the long game in Paul Schrader's THE CARD COUNTER. Told with Schrader's trademark cinematic intensity, the revenge thriller tells the story of an ex-military interrogator turned gambler haunted by the ghosts of his past.\nDirector:Paul Schrader\nStars:Oscar Isaac, Tiffany Haddish, Tye Sheridan, Willem Dafoe", "Under Wraps (2021)": "Synopsis : When an aspiring surgeon is turned down for a fellowship, she takes a temporary position working as a GP in a small Alaskan town in an effort to boost her résumé.\nDirector:Peter Sullivan\nStars:Candace Cameron Bure, David O'Donnell, Robert Pine, Kendra Mylnechuk", "LEGO Star Wars Terrifying Tales (2021)": "Synopsis : Dean, Poe and BB-8 must face their fears, stop an ancient evil from rising, and escape to make it back to their friends.\nDirector:Ken Cunningham\nStars:A.J. LoCascio, Barbara Goodson, Christian Slater, Dana Snyder", "Secret Agent Dingledorf and His Trusty Dog Splat (2021)": "Synopsis : Using quirky inventions from a spy backpack, young Bernie Dingledorf, his dog, and two best friends, are the only ones who can save the world by facing bullies, thwarting circus clowns and destroying Dr. Chuckles evil laugh generator.\nDirector:Billy Dickson\nStars:Zackary Arthur, Paul Johansson, Jason Dolley, Shiloh Nelson", "John Wynn's Playhouse (2021)": "Synopsis : At the \"Playhouse\" What was expected to be a lusty getaway, soon becomes an unwanted therapy session where hidden memories are unclothed by Dr. Williams and his peculiar methods.\nDirector:Reuben Johnson\nStars:Ernest Thomas, Vincent M. Ward, Aretha Perry Greene, Tola Lawal", "The Many Saints of Newark (2021)": "Synopsis : Witness the making of Tony Soprano. The story that reveals the humanity behind Tony's struggles and the influence his family - especially his uncle, Dickie Moltisanti - had over him becoming the most iconic mob boss of all time.\nDirector:Alan Taylor\nStars:Alessandro Nivola, Leslie Odom Jr., Jon Bernthal, Vera Farmiga", "Falling for Figaro (2021)": "Synopsis : A brilliant young fund manager leaves her unfulfilling job and long-term boyfriend to chase her lifelong dream of becoming an opera singer in the Scottish Highlands.\nDirector:Ben Lewin\nStars:Danielle Macdonald, Shazad Latif, Joanna Lumley, Gary Lewis", "American Night (2021)": "Synopsis : A courier carrying Andy Warhol's famous \"Pink Marilyn\" arrives in New York City. Art and life collide - as John Kaplan tries to juggle the mob and his talent as an art forger with his love for Sarah Flores - and chaos ensues.\nDirector:Alessio Della Valle\nStars:Jeremy Piven, Jonathan Rhys Meyers, Emile Hirsch, Paz Vega", "Implanted (2021)": "Synopsis : A struggling young woman is implanted with an experimental AI chip. She must fight to survive when it takes control.\nDirector:Fabien Dufils\nStars:Michelle Girolami, Nader Boussandel, Scott Broughton, David Dotterer", "Stop and Go (2021)": "Synopsis : Two directionless sisters brave a cross-country road trip to rescue their grandmother from a COVID outbreak at her nursing home.\nDirectors:Mallory Everton,\n|     Stars:Whitney Call, Mallory Everton, Julia Jolley, Anne Sward Hansen", "The Addams Family 2 (2021)": "Synopsis : The Addams get tangled up in more wacky adventures and find themselves involved in hilarious run-ins with all sorts of unsuspecting characters. Sequel to the 2019 animated film, 'The Addams Family'.\nDirectors:Greg Tiernan,\nLaura Brousseau, Kevin Pavlovic|     Stars:Oscar Isaac, Charlize Theron, Chloë Grace Moretz, Javon 'Wanna' Walton", "The Survivalist (2021)": "Synopsis : A year and a half after the fall of civilization due to a viral outbreak, a former FBI agent forced to protect a young woman immune to the disease from a dangerous gang leader hunting her.\nDirector:Jon Keeyes\nStars:Jonathan Rhys Meyers, John Malkovich, Jenna Leigh Green, Ruby Modine", "Bingo Hell (2021)": "Synopsis : In the Barrio of Oak Springs live a strong and stubborn group of elderly friends who refuse to be gentrified. Their leader, Lupita, keeps them together as a community, a family. But little\nDirector:Gigi Saul Guerrero\nStars:Adriana Barraza, L. Scott Caldwell, Joshua Caleb Johnson, Richard Brake", "Black as Night (2021)": "Synopsis : A teenage girl with self-esteem issues finds confidence in the most unlikely way, by spending her summer battling vampires that prey on New Orleans' disenfranchised with the help of her\nDirector:Maritte Lee Go\nStars:Asjha Cooper, Fabrizio Guido, Mason Beauchamp, Abbie Gayle", "While We Sleep (2021)": "Synopsis : After observing a hauntingly familiar abnormal CAT scan of a 13 year old girl, radiologist Nina Evanko battles to find the source of the young girl's sleeping disorder. What she discovers\nDirector:Andrzej Sekula\nStars:Slava Babenkov, Sergey Denga, Brian Gross, Lyra Irene Gross", "Hustle Down (2021)": "Synopsis : The driver for a Baja drug lord/Jefe steals a valuable car. Jefe hires a \"bounty hunter\" to deliver the driver and car. Many other gunmen are interested in the car and driver.\nDirector:R. Ellis Frazier\nStars:Tom Sizemore, Paul Sidhu, Bai Ling, Kevin Gage", "Mayday (2021)": "Synopsis : Dramatized reconstruction of real-life air disasters, along with interviews with aviation experts and eyewitnesses.\nStars:\nStephen Bogaert, Gregory Feith, John Cox", "Queenpins (2021)": "Synopsis : A pair of housewives create a $40 million coupon scam.\nDirectors:Aron Gaudet,\n|     Stars:Kristen Bell, Kirby Howell-Baptiste, Paul Walter Hauser, Bebe Rexha", "Chernobyl 1986 (2021)": "Synopsis : Add a Plot\nDirector:Toni Comas\nStars:Mikita Davyda, Alexander Notkin", "The Starling (2021)": "Synopsis : After Lilly suffers a loss, a combative Starling takes nest beside her quiet home. The feisty bird taunts and attacks the grief-stricken Lilly. On her journey to expel the Starling, she rediscovers her will to live and capacity for love.\nDirector:Theodore Melfi\nStars:Melissa McCarthy, Chris O'Dowd, Kevin Kline, Timothy Olyphant", "This Is the Year (2021)": "Synopsis : In a last ditch effort to win over the girl of his dreams, a nerdy high school senior and his best friends embark on a road trip to see their favorite band at the biggest music festival of the year.\nDirector:David Henrie\nStars:Vanessa Marano, Gregg Sulkin, Jeff Garlin, Bug Hall", "Time Is Up (2021)": "Synopsis : An accident will force 'Vivien' and Royan to come to a stop and reclaim their lives, one minute at the time, and finally start living in a present that perhaps will prove to be more exciting than any predefined.\nDirector:Elisa Amoruso\nStars:Bella Thorne, Benjamin Mascolo, Sebastiano Pigazzi, Bonnie Baddoo", "Apache Junction (2021)": "Synopsis : Apache Junction is an Old West outpost of lawlessness, a haven for thieves and cold-blooded killers. When big-city reporter Annabelle Angel arrives in town and becomes a target, notorious\nDirector:Justin Lee\nStars:Scout Taylor-Compton, Stuart Townsend, Thomas Jane, Ed Morrone", "East of the Mountains (2021)": "Synopsis : Based on the best-selling novel by David Guterson When retired heart surgeon Ben Givens learns that he has terminal cancer, he takes his beloved dog back to his boyhood home in Eastern\nDirector:S.J. Chiro\nStars:Tom Skerritt, Mira Sorvino, Annie Gonzalez, Wally Dalton", "Lone Wolf (2021)": "Synopsis : After helping the local police with some horse thieves, a Texas Ranger aims at a drug lord with arms trade as well. They're interested in the same woman and they're both into martial arts.\nDirector:Steve Carver\nStars:Chuck Norris, David Carradine, Barbara Carrera, Leon Isaac Kennedy", "My Little Pony(2021)": "Synopsis : After the time of the Mane 6, Sunny--a young Earth Pony--and her new Unicorn friend Izzy explore their world and strive to restore Harmony to Equestria.\nDirectors:Robert Cullen,\nMark Fattibene|     Stars:Vanessa Hudgens, Kimiko Glenn, James Marsden, Sofia Carson", "Birds of Paradise (2021)": "Synopsis : Two girls at an elite Parisian ballet academy have their bond and bodies tested as they compete for a contract to join the company of the Opéra national de Paris.\nDirector:Sarah Adina Smith\nStars:Diana Silvers, Kristine Froseth, Jacqueline Bisset, Toby Huss", "Paper Dragons (2021)": "Synopsis : A small-time hood, left for dead after double-crossing drug dealers, is taken in by a monastery and taught the art of kung fu.\nDirector:Adolfo Swaya\nStars:Victor Wong, James Hong, Adolfo Swaya, Michael Paul Chan", "Free Guy (2021)": "Synopsis : A bank teller discovers that he's actually an NPC inside a brutal, open world video game.\nDirector:Shawn Levy\nStars:Ryan Reynolds, Jodie Comer, Taika Waititi, Lil Rel Howery", "Confessions of an Invisible Girl (2021)": "Synopsis : When the clever but socially-awkward Tetê joins a new school, she'll do anything to fit in. But the queen bee among her classmates has other ideas.\nDirector:Bruno Garotti\nStars:Lucca Picon, Marcus Bessa, Caio Cabral, Klara Castanho", "Go! Go! Cory Carson(2021)": "Synopsis : Based on the Go. Go. toy line from VTech, children's series follows the adventures of Cory Carson.\nStars:\nKerry Gudjohnsen, Maisie Benson, Paul Killam", "Intrusion (2021)": "Synopsis : A woman moves to a small town with her husband, but is rattled when she is targeted for a home invasion.\nDirector:Adam Salky\nStars:Freida Pinto, Logan Marshall-Green, Robert John Burke, Megan Elisabeth Kelly", "Killer Grades (2021)": "Synopsis : Proud mom Katherine has just found out that her daughter Michelle has earned a spot on the academic decathlon team. But, when a student winds up in the hospital, she starts to wonder if there's more going on with the team than she knows.\nDirector:Jose Montesinos\nStars:Megan Ashley Brown, Laurie Fortier, Zack Gold, Kylie Acuña", "The Resonator(2021)": "Synopsis : Set in a high fantasy world where magic exists, but only some can access it, a woman named Moiraine crosses paths with five young men and women. This sparks a dangerous, world-spanning journey. Based on the book series by Robert Jordan.\nStars:\nDaniel Henney, Madeleine Madden, Zoë Robins", "Tethered (2021)": "Synopsis : TETHERED is a sci-fi mystery set in the present day. Detective Sam Morris starts on a missing-persons case that puts her own personal world into upheaval.\nDirector:Gregg Furuoka\nStars:Caroline Harris, Joshua Kwak, Connor Keene, Erika Enggren", "Blame (2021)": "Synopsis : While on vacation in rural Wisconsin, five friends seek refuge in a lone building after their vehicle crashes in a vicious snowstorm. With no cell service, the group splits up to find help but when they reunite, one of them is found dead.\nDirector:B.J. Rayniak\nStars:Lauren Elyse Buckley, Richard Blake, Rachel Lynn David, Austin Brook", "Most Dangerous Game (2020)": "Synopsis : Desperate to take care of his pregnant wife before a terminal illness can take his life, Dodge Tynes accepts an offer to participate in a deadly game where he soon discovers that he's not the hunter - but the prey.\nStars:\nSarah Gadon, Christoph Waltz, Zach Cherry", "The Alpines (2021)": "Synopsis : \"The Alpines\" is a psychological thriller that follows seven friends coming together for a weekend getaway after several years of little to no contact. They've grown apart. They've moved on\nDirector:Dante Aubain\nStars:Mally Corrigan, Katrina Diehm, Stephen Kazakoff, Aaron Latta-Morissette", "This is the Night (2021)": "Synopsis : A teenager living in Staten Island during the summer of 1982 embarks on a quest that draws in his family members.\nDirector:James DeMonaco\nStars:Madelyn Cline, Lucius Hoyos, Chase Vacnin, River Alexander", "Night of the Animated Dead (2021)": "Synopsis : Visiting their dad's grave in the countryside, two siblings are attacked by a zombie. Barbara escapes to a farmhouse. A man helps barricade the house as more zombies arrive outside.\nDirector:Jason Axinn\nStars:Josh Duhamel, Dulé Hill, Katharine Isabelle, James Roday Rodriguez", "Devil's Five (2021)": "Synopsis : Years have passed since the legions of hell have set foot in this world, but now a new demonic invasion has begun, and humanity's last hope will rest in the hands of three lone demon hunters, each offering a radically different play style.\nDirector:Hideaki Itsuno\nStars:Johnny Yong Bosch, Brian Hanford, Reuben Langdon, Faye Kingslee", "Finding Love in Mountain View (2021)": "Synopsis : After learning she's been entrusted to take care of her deceased cousin's children, an architect is torn between focusing on her career and honoring her cousin's wish.\nDirector:Sandra L. Martin\nStars:Danielle C. Ryan, Myko Olivier, John-Paul Lavoisier, Skyler Elyse Philpot", "Driven to Kill (2021)": "Synopsis : An ex-Russian mobster who is now a crime novelist must confront his past when his family is targeted by violence.\nDirector:Jeff King\nStars:Steven Seagal, Mike Dopud, Igor Jijikine, Robert Wisden", "People Just Do Nothing(2021)": "Synopsis : A mockumentary series about a group of failed MCs from West London and their passion for pirate radio.\nStars:\nHugo Chegwin, Asim Chaudhry, Steve Stamp", "Between Waves (2020)": "Synopsis : It's about a woman's pursuit to join her missing lover by crossing into a parallel dimension.\nDirector:Virginia Abramovich\nStars:Fiona Graham, Luke Robinson, Sebastian Deery, Stacey Bernstein", "C.I.Ape (2021)": "Synopsis : In the world of espionage, some missions require an agent with a unique set of skills, possessing not just bravery but an ability to melt even the most villanious heart. This is a job for C.I.Ape .\nDirector:Ali Zamani\nStars:Sophia Alongi, Skip Schwink, Madelyn Kientz, Lucas Ross", "Girls' Night In (2021)": "Synopsis : Three women who have been friends since childhood are enjoying their monthly dinner party when one announces to the other two, \"Together we make up the perfect woman -- you're the brains,\nDirector:Emmett Loverde\nStars:Tiana Tuttle, Alexis Phillips, Samantha Skelton, Arielle Gottesman", "Raise a Glass to Love (2021)": "Synopsis : Follows aspiring Master Sommelier Jenna who returns to her family vineyard to study and is fascinated by the natural methods of the new winemaker, Marcelo.\nDirector:David Weaver\nStars:Laura Osnes, Juan Pablo Di Pace, Matthew James Dowden, Eric Keenleyside", "Streamline (2021)": "Synopsis : A 15-year-old swimming prodigy self-destructs after his father is released from jail.\nDirector:Tyson Wade Johnston\nStars:Jason Isaacs, Levi Miller, Jake Ryan, Laura Gordon", "Help (2021)": "Synopsis : An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African American maids' point of view on the white families for which they work, and the hardships they go through on a daily basis.\nDirector:Tate Taylor\nStars:Emma Stone, Viola Davis, Octavia Spencer, Bryce Dallas Howard", "Dear Evan Hansen (2021)": "Synopsis : Film adaptation of the Tony and Grammy Award-winning musical about Evan Hansen, a high school senior with Social Anxiety disorder and his journey of self-discovery and acceptance following the suicide of a fellow classmate.\nDirector:Stephen Chbosky\nStars:Ben Platt, Julianne Moore, Kaitlyn Dever, Amy Adams", "I Love Us (2021)": "Synopsis : Sammy Silver struggle to trade his criminal ways for a married life after he falls in love with a single mother.\nDirector:Danny A. Abeckaser\nStars:Katie Cassidy, Robert Davi, David James Elliott, Jackie Cruz", "Adam's Package (2021)": "Synopsis : Living as an alien model in Hollywood certainly has its ISSUES.\nDirector:Andrew Chiaramonte\nStars:Andrew Rogers, Serena Hendrix, Shay Denison, Tim Mollen", "The Stronghold (2021)": "Synopsis : A police brigade working in the dangerous northern neighborhoods of Marseille, where the level of crime is higher than anywhere else in France.\nDirector:Cédric Jimenez\nStars:Gilles Lellouche, Karim Leklou, François Civil, Adèle Exarchopoulos", "Final Frequency (2021)": "Synopsis : A PhD student ties unusual tremors in Los Angeles to rogue scientists, who will weaponize Nikola Tesla's secrets and cause massive earthquakes, if they can only find his lost notebook.\nDirector:Tim Lowry\nStars:Nicolas Alexandre, Kirby Bliss Blanton, Eddie Buraye, Richard Burgi", "The Obscure Life of the Grand Duke of Corsica (2021)": "Synopsis : In 1221 a young man is set on his path to becoming St. Francis of Assisi. A thousand years later an architect must build a mausoleum for a dying billionaire. Separated by history, these men's lives will be forever changed by a pandemic.\nDirector:Daniel Graham\nStars:Timothy Spall, Peter Stormare, Matt Hookings, Alicia Agneson", "Cry Macho (2021)": "Synopsis : A one-time rodeo star and washed-up horse breeder takes a job to bring a man's young son home and away from his alcoholic mom. On their journey, the horseman finds redemption through teaching the boy what it means to be a good man.\nDirector:Clint Eastwood\nStars:Clint Eastwood, Dwight Yoakam, Daniel V. Graulau, Amber Lynn Ashley", "The Auschwitz Report (2020)": "Synopsis : This is the true story of Freddy and Walter - two young Slovak Jews, who were deported to Auschwitz in 1942. On 10 April 1944, after meticulous planning and with the help and the resilience\nDirector:Peter Bebjak\nStars:Noel Czuczor, Peter Ondrejicka, John Hannah, Wojciech Mecwaldowski", "Everybody's Talking About Jamie (2021)": "Synopsis : Feature film adaptation of the musical about a teenager from Sheffield, England who wants to be a drag queen.\nDirectors:Jonathan Butterell,\nTom MacRae|     Stars:Max Harwood, Lauren Patel, Sarah Lancashire, Shobna Gulati", "The Killing of Kenneth Chamberlain (2020)": "Synopsis : Based on the true story of the events that led to the death of Kenneth Chamberlain Sr., an elderly African American veteran with bipolar disorder, who was killed during a conflict with police officers who were dispatched to check on him.\nDirector:David Midell\nStars:Frankie Faison, Steve O'Connell, Enrico Natale, Ben Marten", "Last Night in Rozzie (2021)": "Synopsis : When a New York lawyer returns to his Boston hometown to reunite his dying friend with his young son, he is forced to finally confront a childhood trauma.\nDirector:Sean Gannet\nStars:Neil Brown Jr., Nicky Whelan, Jeremy Sisto, Kevin Chapman", "Candyman (2021)": "Synopsis : A sequel to the horror film Candyman (1992) that returns to the now-gentrified Chicago neighborhood where the legend began.\nDirector:Nia DaCosta\nStars:Yahya Abdul-Mateen II, Teyonah Parris, Nathan Stewart-Jarrett, Colman Domingo", "My Son (2021)": "Synopsis : Driving in the heart of the Highlands, Edmond Murray receives a call from his ex-wife, in tears. Their 7-year-old son went missing from a campsite. Soon it becomes clear that the child was kidnapped and the parents give way to despair.\nDirector:Christian Carion\nStars:James McAvoy, Claire Foy, Tom Cullen, Gary Lewis", "Typo (2021)": "Synopsis : Abbie, an aspiring writer who finds that her marriage is not what she expected after her husband starts abusing her. Her life gets out of control, her plans to find a way out have consequences she didn't foresee.\nDirector:Antony Meadley\nStars:Melissa Hollett, Guy Barnes, David Christopher-Turner, Spencer Collings", "Nightbooks (2021)": "Synopsis : Follows Alex, a boy obsessed with scary stories who is imprisoned by an evil young witch in her contemporary New York City apartment.\nDirector:David Yarovesky\nStars:Winslow Fegley, Lidya Jewett, Krysten Ritter, Jess Brown", "The Young and the Ratchet (2021)": "Synopsis : But what if it's all a lie? The lessons they teach, the rules you learned, the people you thought you knew? There is no \"Heartbreak 101\" or Graduate-level Backstabbing courses on the\nDirectors:Nigel Gabbidon,\n|     Stars:Alvin Abston, Becky Babatunde, Kane Bailey, Matthew Boykin-Derrill", "Moonbound (2021)": "Synopsis : Based on one of Germany's most popular children's books MOONBOUND tells the story of little Pete who embarks on an enchanting journey together with June bug Mr. Zoomzeman and the Sandman to rescue his little sister from the evil Moon Man.\nDirector:Ali Samadi Ahadi\nStars:Stephan Benson, David Daria, Lilian Gartner, Stefko Hanushevsky", "Together (2021)": "Synopsis : When Paris goes into lockdown during the pandemic, the quirky residents of an apartment building must adjust to a new life and one another.\nDirector:Dany Boon\nStars:Dany Boon, François Damiens, Laurence Arné, Yvan Attal", "Lady Usher (2021)": "Synopsis : This motion picture is a suspense/thriller based on the short story; The Fall of the House of Usher by Edgar Allan Poe. This updated re-telling is written by award winning filmmaker George\nDirector:George Adams\nStars:Theresa Santiago, Billie D. Merritt, John Tupy, John Ferguson", "Royal Jelly (2021)": "Synopsis : A high school social outcast is taken under the wing of a mysterious mentor, only to be groomed as the hive's next queen.\nDirector:Sean Riley\nStars:Jonas Chartock, Fiona McQuinn, Elizabeth McCoy, Sherry Lattanzi", "Best Sellers (2021)": "Synopsis : A cranky, retired author reluctantly embarks on a final book tour to help out a young publisher.\nDirector:Lina Roessler\nStars:Michael Caine, Aubrey Plaza, Scott Speedman, Ellen Wong", "Prisoners of the Ghostland (2021)": "Synopsis : A notorious criminal must break an evil curse in order to rescue an abducted girl who has mysteriously disappeared.\nDirector:Sion Sono\nStars:Nicolas Cage, Sofia Boutella, Nick Cassavetes, Bill Moseley", "Chompy & The Girls (2021)": "Synopsis : A troubled woman meets her father for the first time and their encounter goes from awkward to alarming when they witness a man swallow a little girl whole.\nDirector:Skye Braband\nStars:Christy St. John, Steve Marvel, Julie Dolan, Seneca Paliotta", "Bad Candy (2021)": "Synopsis : On Halloween night in New Salem, Radio DJs Chilly Billy (Corey Taylor) and Paul (Zach Galligan) tell a twisted anthology of terrifying local myths that lead to a grim end for small-town residents.\nDirectors:Scott B. Hansen,\n|     Stars:Zach Galligan, Derek Russo, Corey Taylor, Kevin Wayne", "Teenage Vampire (2020)": "Synopsis : Chase and Pam join the high school cheerleading squad in order to be cool and find out the team is infested with Vampires.\nDirector:Aaron Lee Lopez\nStars:Claire Tablizo, Jaeden Riley Juarez, Gabby Garcia, Mick Buck", "Another Girl (2021)": "Synopsis : Elle a student, becomes obsessed with Katie, the heroine of a novel she's just finished reading. When Elle, battling depression, becomes convinced that Katie is actually a human being, it sets her on a reckless and terrifying course.\nDirector:Allison Burnett\nStars:Samantha Hanratty, Peter Gadiot, Paul Rush, Peggy Goss", "Redemption in Cherry Springs (2021)": "Synopsis : Melanie and Jake follows a path of twists and turns till they uncover the shocking truth of Melanie's missing childhood friend Tony in her small town of Cherry springs.\nDirector:Letia Clouston\nStars:Rochelle Aytes, Keith D. Robinson, Hanna Lee Sakakibara, Rajiv Sharma", "Shelter in Place (2021)": "Synopsis : When a global pandemic limits the possibility of travel, a honeymooning couple gets stranded at the Hollywood Roosevelt Hotel where a skeleton staff of two employees tend to them. When\nDirectors:Chris Beyrooty,\n|     Stars:Kevin Daniels, Brendan Hines, Ola Kaminska, Tatjana Marjanovic", "What She Said (2021)": "Synopsis : When Sam decides to drop the charges against her rapist, her friends and siblings gather to stage a Thanksgiving intervention.\nDirector:Amy Northup\nStars:Jenny Lester, Juliana Jurenas, Britt Michael Gordon, Peter Evangelista", "The Influencer (2021)": "Synopsis : Although wife and mother Mabel is loved by her husband Nick, her mental illness places a strain on the marriage.\nDirector:John Cassavetes\nStars:Gena Rowlands, Peter Falk, Fred Draper, Lady Rowlands", "The Power of the Dog (2021)": "Synopsis : Charismatic rancher Phil Burbank inspires fear and awe in those around him. When his brother brings home a new wife and her son, Phil torments them until he finds himself exposed to the possibility of love.\nDirector:Jane Campion\nStars:Benedict Cumberbatch, Kirsten Dunst, Jesse Plemons, Kodi Smit-McPhee", "The Curse of Lizzie Borden (2021)": "Synopsis : Low Budget horror movie phenomenon Danielle De Luca (Queen Cobra) plays a girl who gets a job in a Lizzie Borden museum working for Mr. Moody (Mtv Singled Out's Randal Malone). Soon she\nDirector:Ford Austin\nStars:Randal Malone, Danielle De Luca, Jed Rowen, Kerry Feirman", "Tales of the Uncanny (2020)": "Synopsis : Add a Plot\nDirector:David Gregory\nStars:Ashim Ahluwalia, Chris Alexander, Joko Anwar, Mariano Baino", "Romeo & Juliet (2021)": "Synopsis : Shakespeare's famous play is updated to the hip modern suburb of Verona still retaining its original dialogue.\nDirector:Baz Luhrmann\nStars:Leonardo DiCaprio, Claire Danes, John Leguizamo, Harold Perrineau", "Prey (2021)": "Synopsis : After splitting with the Joker, Harley Quinn joins superheroines Black Canary, Huntress and Renee Montoya to save a young girl from an evil crime lord.\nDirector:Cathy Yan\nStars:Margot Robbie, Rosie Perez, Mary Elizabeth Winstead, Jurnee Smollett", "Dating & New York (2021)": "Synopsis : A 16-year-old tries to play matchmaker for her widowed father during Christmastime.\nDirector:Mick Davis\nStars:Jeremy Piven, Olivia-Mai Barrett, Hadar Cats, Joely Richardson", "Gunfight at Dry River (2021)": "Synopsis : The US-Mexican border in 1888. In Dry River, a desert town debilitated by drought, a promise of gold will bring hope, love, and death in equal measure.\nDirector:Daniel Simpson\nStars:Charlie Creed-Miles, Michael Moriarty, Ann Mitchell, Danny Shayler", "Kate (2021)": "Synopsis : A female assassin has 24 hours to get vengeance on her poisoner before she dies.\nDirector:Cedric Nicolas-Troyan\nStars:Mary Elizabeth Winstead, Woody Harrelson, Miku Patricia Martineau, Tadanobu Asano", "Malignant (2021)": "Synopsis : Madison is paralyzed by shocking visions of grisly murders, and her torment worsens as she discovers that these waking dreams are in fact terrifying realities.\nDirector:James Wan\nStars:Annabelle Wallis, Maddie Hasson, George Young, Michole Briana White", "The Manson Brothers Midnight Zombie Massacre (2021)": "Synopsis : After being relegated, the two fighting brothers signed up for a new game. But they didn't know that they need to stay in an arena to fight zombies.\nDirector:Max Martini\nStars:Chris Margetis, Mike Carey, David B. Meadows, Randy Couture", "Martyrs Lane (2021)": "Synopsis : Leah, 10, lives in a large vicarage, full of lost souls and the needy. In the day the house is bustling with people; at night it is dark, empty, a space for Leah's nightmares to creep into\nDirector:Ruth Platt\nStars:Kiera Thompson, Denise Gough, Sienna Sayer, Steven Cree", "Lady of the Manor (2021)": "Synopsis : A flatulent, aimless ne'er-do-well becomes a tour guide in a historic estate, and winds up befriending the manor's resident ghost.\nDirectors:Christian Long,\n|     Stars:Melanie Lynskey, Judy Greer, Justin Long, Ryan Phillippe", "Catch the Bullet (2021)": "Synopsis : Britt MacMaster, a U.S. Marshal who rarely brings them back alive, returns home from the trail to discover his 12-year-old son, Chad has been kidnapped by outlaws Jed Blake and his gang.\nDirector:Michael Feifer\nStars:Jay Pickett, Gattlin Griffith, Mason McNulty, Cody Jones", "The Voyeurs (2021)": "Synopsis : Pippa and Thomas move into their dream apartment, they notice that their windows look directly into the apartment opposite, this will set in motion a chain of events that will lead to disaster.\nDirector:Michael Mohan\nStars:Sydney Sweeney, Justice Smith, Ben Hardy, Natasha Liu Bordizzo", "Dune World (2021)": "Synopsis : A deep space crew takes a job on a mysterious remote planet. A crash landing strands them on the hostile surface. Soon they find out what creatures live there, and the hidden fate of the crew before them.\nDirector:Mark Polonia\nStars:Houston Baker, Samantha Coolidge, Ryan Dalton, Cassandra Hayes", "Synapse (2021)": "Synopsis : An addicted memory dealer is chased relentlessly by federal narcotics agents bent on keeping the secrets he has locked in his mind hidden.\nDirector:Kenlon Clark\nStars:Adam G. Simon, Sophina Brown, Joshua Alba, Henry Simmons", "Moon Rock for Monday (2021)": "Synopsis : Set in Sydney, 1999, after an unlikely encounter at a train station, a young girl befriends a fugitive teenage boy and they travel to visit a moon rock that the girl believes will heal her.\nDirector:Kurt Martin\nStars:Aaron Jeffery, David Field, Karina Banno, Jessica Napier", "Harry and Meghan(2021)": "Synopsis : An orphaned boy enrolls in a school of wizardry, where he learns the truth about himself, his family and the terrible evil that haunts the magical world.\nDirector:Chris Columbus\nStars:Daniel Radcliffe, Rupert Grint, Richard Harris, Maggie Smith", "Escape Room(2021)": "Synopsis : Santa, a.k.a. Scott Calvin, is faced with double-duty: how to keep his new family happy and how to stop Jack Frost from taking over Christmas.\nDirector:Michael Lembeck\nStars:Tim Allen, Martin Short, Elizabeth Mitchell, Eric Lloyd", "Wild Indian (2021)": "Synopsis : Two men learn to confront a traumatic secret they share involving the savage murder of a schoolmate.\nDirector:Lyle Mitchell Corbine Jr.\nStars:Michael Greyeyes, Chaske Spencer, Jesse Eisenberg, Kate Bosworth", "Webcam Cheerleaders (2021)": "Synopsis : Maisy transfers to her late sister's college to find the truth behind her death, where she uncovers that many of the girls on the cheerleading squad are also webcam girls, but revealing the truth may have deadly consequences.\nDirector:Curtis Crawford\nStars:Joelle Farrow, Krista Bridges, George Thomas, Ash Catherwood", "Language Arts (2021)": "Synopsis : Charles, a withdrawn high school English teacher, and his student Romy start documenting collaborations between autistic youth and senior dementia patients, causing Charles to tailspin into his past and confront the errors of his youth.\nDirector:Cornelia Duryée\nStars:Ashley Zukerman, Sarah Shahi, Elliott Smith, Lincoln Lambert", "Samantha Rose (2021)": "Synopsis : Sam reunites with a childhood friend for an unforgettable week leading her to see her life for what it really is: her own.\nDirector:Andrew Morgan\nStars:Allison Berman, Johnny Dawson, Marla Freeman, Nicholas Horiatis", "The Unlit (2021)": "Synopsis : A supernatural thriller with a witchy theme, starring Cassandra Magrath\nDirector:Kate Whitbread\nStars:Cassandra Magrath, Kevin Hofbauer, Lee Mason, John Voce", "Blood Sacrifice (2021)": "Synopsis : This three-part documentary discovers the origins and beliefs of the Celts in artifacts and human remains across Europe. What emerges is not a portrait of wild people on the western fringes\nStars:\nNeil Oliver, Mike Loades, Nigel Meeks", "Dramarama (2020)": "Synopsis : In 1994, a closeted teen struggles to part ways with his 4 high school drama friends at their final slumber party before they leave for college.\nDirector:Jonathan Wysocki\nStars:Nico Greetham, Anna Grace Barlow, Megan Suri, Zak Henri", "African America (2021)": "Synopsis : Black food is American food. Chef and writer Stephen Satterfield traces the delicious, moving throughlines from Africa to Texas in this docuseries.\nStars:\nAdrian Miller, Michael Twitty, Jessica B. Harris", "Shadowtown (2020)": "Synopsis : Set in Iceland, Maya inherits an old house from a schizophrenic grandmother she didn't know. Messages from a mysterious source lead to questions about her grandmother's death and ultimately put her own life in danger.\nDirectors:Jon Einarsson Gustafsson,\n|     Stars:Brittany Bristow, Edda Björgvinsdóttir, Kolbeinn Arnbjörnsson, John Rhys-Davies", "Sacrilege (2020)": "Synopsis : Four lifelong friends head to a remote lodge for a weekend of fun. What begins as an idyllic retreat quickly descends into a fight for their lives when a local Pagan cult offer them up to their Goddess as a sacrifice for the Solstice.\nDirector:David Creed\nStars:Tamaryn Payne, Emily Wyatt, Sian Abrahams, Naomi Willow", "Boy Meets Boy (2021)": "Synopsis : An adolescent with two siblings tests his various theories about life as he endures the trials of growing up alongside a good friend.\nStars:\nRider Strong, William Daniels, Betsy Randle", "Familiars (2021)": "Synopsis : A married couple suddenly finds themselves living entirely different lives after their fates magically change through an unexpected incident.\nStars:\nHan Ji-min, Seung-jo Jang, Kang Han-na", "The Day After Quarantine (2021)": "Synopsis : After the quarantine is lifted the world is getting back to business but for some that reality is too much. From rent to relationships, its all at stake in this hilarious movie that follows three men as they navigate the \"new normal\".\nDirectors:Chinedu Ernesto,\n|     Stars:Aaleyah Abron, Latoya Abron, Vee Amor, Ant The Barber", "Small Engine Repair (2021)": "Synopsis : Events spin wildly out of control when three lifelong friends agree to do a favor on behalf of the brash young woman they all adore.\nDirector:John Pollono\nStars:Jon Bernthal, Shea Whigham, Jordana Spiro, John Pollono", "Cheer for your Life (2021)": "Synopsis : A high school girl's spirits are crushed as she suffers through a humiliating \"Cheerleader Initiation Week,\" but her dreams aren't the only thing in danger when another girl on the squad turns up dead.\nDirector:Jared Cohn\nStars:Grace Patterson, Allison McAtee, Anna Belle Bayley, Marisa Lynae Hampton", "Pick A Side (2021)": "Synopsis : The quests of Lefiya Viridis together with Aiz Wallenstein the Sword Princess as they enter the Dungeon to investigate new kinds of monsters that have been causing uproars among adventurers.\nStars:\nJuri Kimura, Shelley Calene-Black, Kelley Peters", "Granada Nights (2021)": "Synopsis : In Granada, Spain a British tourist struggles with a broken heart as he befriends a group of young foreigners and crashes into the heart of the international student scene.\nDirector:Abid Khan\nStars:Antonio Aakeel, Óscar Casas, Quintessa Swindell, Virgile Bramly", "Range Roads (2021)": "Synopsis : When her parents are killed in a sudden car accident, television actor Frankie King (Alana Hawley Purvis) returns to her hometown in rural Alberta to face this tragedy after being estranged from her family for 20 years.\nDirector:Kyle Thomas\nStars:Alana Hawley Purvis, Joe Perry, Nicole de Boer, Chad Brownlee", "The Starter Marriage (2021)": "Synopsis : Add a Plot\nDirector:Arthur Muhammad\nStars:Tim Llewellyn, Gerardo Davila, Sahara Ale, Kenneisha Thompson", "The Miss OTB Scandal (2021)": "Synopsis : Two has been Vegas icons plot to scam the beauty pageant world by producing a fake beauty pageant on the Las Vegas strip. All hell breaks loose when the two are consumed by greed, fame and fortune.\nDirector:Andrew Osburn\nStars:Becky Jo Harris, Marla Robison, Shannyn Lambert, Greg Lutz", "Love Is Love Is Love (2021)": "Synopsis : The proudly privileged top two students of an elite school each makes it their mission to be the first to extract a confession of love from the other.\nStars:\nMakoto Furukawa, Konomi Kohara, Yutaka Aoyama", "The French Dispatch (2021)": "Synopsis : A love letter to journalists set in an outpost of an American newspaper in a fictional twentieth century French city that brings to life a collection of stories published in \"The French Dispatch Magazine\".\nDirector:Wes Anderson\nStars:Benicio Del Toro, Adrien Brody, Tilda Swinton, Léa Seydoux", "I Was a Simple Man (2021)": "Synopsis : A family in Hawai'i faces the imminent death of their eldest as the ghosts of the past haunt the countryside.\nDirector:Christopher Makoto Yogi\nStars:Steve Iwamoto, Constance Wu, Tim Chiou, Kanoa Goo", "Rumble (2022)": "Synopsis : In a world where monster wrestling is a global sport and monsters are superstar athletes, teenage Winnie seeks to follow in her father's footsteps by coaching a loveable underdog monster into a champion.\nDirector:Hamish Grieve\nStars:Geraldine Viswanathan, Will Arnett, Stephen A. Smith, Terry Crews", "South Park(2021)": "Synopsis : Follows the misadventures of four irreverent grade-schoolers in the quiet, dysfunctional town of South Park, Colorado.\nStars:\nMatt Stone, Isaac Hayes, Mona Marshall", "Swan Song (2021)": "Synopsis : In the near future, a terminally ill man explores a heart wrenching, emotionally complex solution to save his wife and son from grief by duplicating himself without them knowing.\nDirector:Benjamin Cleary\nStars:Mahershala Ali, Naomie Harris, Awkwafina, Glenn Close", "Mother Android (2021)": "Synopsis : In a post-apocalyptic world rocked by a violent android uprising, a young pregnant woman and her boyfriend desperately search for safety.\nDirector:Mattson Tomlin\nStars:Chloë Grace Moretz, Oscar Wahlberg, Raúl Castillo, Steve M. Robertson", "The Boathouse (2021)": "Synopsis : A music student is hired as a nanny for the summer at a remote cottage.\nDirector:Hannah Cheesman\nStars:Michaela Kurimsky, Alan Van Sprang, Taylor Belle, Jack Fulton", "The Scary of Sixty-First (2021)": "Synopsis : Two roommates' lives are upended after finding out that their new Manhattan apartment harbors a dark secret.\nDirector:Dasha Nekrasova\nStars:Madeline Quinn, Betsey Brown, Stephen Gurewitz, Dasha Nekrasova", "Last Words (2021)": "Synopsis : Harriet is a retired businesswoman who tries to control everything around her. When she decides to write her own obituary, a young journalist takes up the task of finding out the truth resulting in a life-altering friendship.\nDirector:Mark Pellington\nStars:Shirley MacLaine, Amanda Seyfried, AnnJewel Lee Dixon, Thomas Sadoski", "The Novice (2021)": "Synopsis : A college freshman joins her university's rowing team and undertakes an obsessive physical and psychological journey to make it to the top varsity boat, no matter the cost.\nDirector:Lauren Hadaway\nStars:Isabelle Fuhrman, Amy Forsyth, Dilone, Jonathan Cherry", "Wild Game (2021)": "Synopsis : When a cash-strapped rancher takes an offer to help a movie star poach elk it seems like easy money, until a fatal run-in with the local authorities triggers a series of events that pits man against man in a bloody showdown.\nDirector:Brock Harris\nStars:Creed Garnick, Charlie Barnett, Allison Paige, Matthew Daddario", "Twisted Little Lies (2021)": "Synopsis : Brianna is hurt when she finds her fiance Nick cheating on her with his co-worker Christina, so Brianna confides in a stranger online but soon her life unravels when she realizes he's no stranger.\nStars:\nConlan Kisilewicz, Ulyses Espinoza, Melissa Archer", "Venom(2021)": "Synopsis : Eddie Brock attempts to reignite his career by interviewing serial killer Cletus Kasady, who becomes the host of the symbiote Carnage and escapes prison after a failed execution.\nDirector:Andy Serkis\nStars:Tom Hardy, Woody Harrelson, Michelle Williams, Naomie Harris", "Hacker(2022)": "Synopsis : Hackers are blamed for making a virus that will capsize five oil tankers.\nDirector:Iain Softley\nStars:Jonny Lee Miller, Angelina Jolie, Jesse Bradford, Matthew Lillard", "Montford(2021)": "Synopsis : A remarkable story inspired by the life of renowned Chickasaw cattleman Montford T. Johnson, a man who overcame great hardships to establish a ranching empire along the famous cattle highway of the American West, the Chisolm Trail.\nDirector:Nathan Frankowski\nStars:Martin Sensmeier, Dermot Mulroney, Tommy Flanagan, James Landry Hébert", "Diana(2021)": "Synopsis : During the last two years of her life, Princess Diana embarks on a final rite of passage: a secret love affair with Pakistani heart surgeon Hasnat Khan.\nDirector:Oliver Hirschbiegel\nStars:Naomi Watts, Naveen Andrews, Cas Anvar, Charles Edwards", "star-crossed(2021)": "Synopsis : About an epic romance between a human girl and an alien boy when he and others of his kind are integrated into a suburban high school 10 years after they landed on Earth and were consigned to an internment camp.\nStars:\nMatt Lanter, Grey Damon, Greg Finley", "Journey of My Heart(2021)": "Synopsis : Unusually gifted, successful CEO/entrepreneur Sebastien Martin has experienced accurate prophetic visions for years. While ignoring his psychic abilities to build a normal life, Sebastien's\nDirector:Cybela Clare\nStar:Sebastien Martin", "Dogface(2021)": "Synopsis : After moving into a haunted trap house, a troubled young hustler from the streets begins to discover his true purpose.\nDirector:Felix Jordan\nStars:Know Cash, Abms Daisy, Garron Gates, Gotti", "Myth(2021)": "Synopsis : An unfathomable incident introduces a genius engineer to dangerous secrets of the world, and to a woman from the future who's come looking for him.\nStars:\nPark Shin-Hye, In-ho Tae, Halley Kim", "Journey of My Heart (2021)": "Synopsis : Unusually gifted, successful CEO/entrepreneur Sebastien Martin has experienced accurate prophetic visions for years. While ignoring his psychic abilities to build a normal life, Sebastien's\nDirector:Cybela Clare\nStar:Sebastien Martin", "VHS 94 (2021)": "Synopsis : A police S.W.A.T. team investigates about a mysterious VHS tape and discovers a sinister cult that has pre-recorded material which uncovers a nightmarish conspiracy.\nDirectors:Simon Barrett,\nChloe Okuno, Ryan Prows, Jennifer Reeder, Timo Tjahjanto|     Stars:Anna Hopkins, Christian Potenza, Brian Paul, Tim Campbell", "If I Cant Have Love I Want Power (2021)": "Synopsis : The music of Halsey's upcoming album, introduces a young pregnant Queen, Lila, as she wrestles with the chokehold of love to ultimately discover that the ability to create life (and end it) unlocks the paranormal power within her.\nDirector:Colin Tilley\nStars:Halsey, Sasha Lane, Vuk Celebic, Brian Caspe", "The Worst Person in the World (2021)": "Synopsis : The chronicles of four years in the life of Julie, a young woman who navigates the troubled waters of her love life and struggles to find her career path, leading her to take a realistic look at who she really is.\nDirector:Joachim Trier\nStars:Renate Reinsve, Anders Danielsen Lie, Maria Grazia Di Meo, Mia McGovern Zaini", "Deadly Girls Night Out (2021)": "Synopsis : Deadly Girls Night Out is the story of three close friends planning a party out for the night. However, the night ends up in a tragic death that unravel deep secrets.\nDirector:Ben Meyerson\nStars:Nicholas Downs, Carlos Enrique Escarcega, Annika Foster, Preston Geer", "Last Train to Christmas (2021)": "Synopsis : Followed by Tony Towers, he's a local celebrity, a successful nightclub manager and he is engaged to a younger woman, Sue. Things get a little strange when he embarks upon the 3:17 to Nottingham for a Christmas family reunion.\nDirector:Julian Kemp\nStars:Cary Elwes, Nathalie Emmanuel, Michael Sheen, Mia McKenna-Bruce", "The Worst Person in the World (2021) Subbed": "Synopsis : The chronicles of four years in the life of Julie, a young woman who navigates the troubled waters of her love life and struggles to find her career path, leading her to take a realistic look at who she really is.\nDirector:Joachim Trier\nStars:Renate Reinsve, Anders Danielsen Lie, Maria Grazia Di Meo, Mia McGovern Zaini", "By the Grace of (2021)": "Synopsis : Three men, abused by the same priest during their childhood, engage in a fight for justice that will expose their personal experiences and question their life with their wife, family, and colleagues.\nDirector:François Ozon\nStars:Melvil Poupaud, Denis Ménochet, Swann Arlaud, Éric Caravaca", "I Live Alone (2021)": "Synopsis : Sixteen year old Parker has to go stay with her reclusive Aunt Len while her Mother's in the hospital. Parker quickly realizes her Aunt is living in solitude for a very dark and horrific reason.\nDirector:Krsy Fox\nStars:Bonnie Aarons, Nyaling Marenah, Krsy Fox, Radek Lord", "Resident Evil(2021)": "Synopsis : Set in 1998, this origin story explores the secrets of the mysterious Spencer Mansion and the ill-fated Raccoon City.\nDirector:Johannes Roberts\nStars:Kaya Scodelario, Robbie Amell, Hannah John-Kamen, Tom Hopper", "Being the Ricardos (2021)": "Synopsis : Follows Lucy and Desi as they face a crisis that could end their careers and another that could end their marriage.\nDirector:Aaron Sorkin\nStars:Nicole Kidman, Javier Bardem, Nina Arianda, J.K. Simmons", "True to the Game 3 (2021)": "Synopsis : The trilogy picks right up where True 2 left us. Gena's awakes to find that her mysterious savior is Quadir. Before happily ever after, Gena has 72 hours to go back to Philly to check on Bria and Gah Git and let them know of her plans.\nDirector:David Wolfgang\nStars:Malik Barnhardt, Starletta DuPois, Omar Gooding, Iyana Halley", "The Matrix Resurrections (2021)": "Synopsis : Return to a world of two realities: one, everyday life; the other, what lies behind it. To find out if his reality is a construct, to truly know himself, Mr. Anderson will have to choose to follow the white rabbit once more.\nDirector:Lana Wachowski\nStars:Keanu Reeves, Carrie-Anne Moss, Yahya Abdul-Mateen II, Jonathan Groff", "Wolf (2021)": "Synopsis : Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government.\nDirector:Martin Scorsese\nStars:Leonardo DiCaprio, Jonah Hill, Margot Robbie, Matthew McConaughey", "Cmon Cmon (2021)": "Synopsis : Add a Plot\n\n", "Ebony Hustle (2021)": "Synopsis : Ex Stripper turns Private Investigator.\nDirector:Jamezz Hampton\nStars:Michelle l Lamb, Andrew Chandler, Ryan Elizabeth, Jessica Mitchell", "Encanto (2021)": "Synopsis : A young Colombian girl has to face the frustration of being the only member of her family without magical powers.\nDirectors:Jared Bush,\nCharise Castro Smith|     Stars:Stephanie Beatriz, María Cecilia Botero, John Leguizamo, Mauro Castillo", "Reno 911! The Hunt for QAnon (2021)": "Synopsis : Follows the deputies of the Reno Sheriff's Department as they hunt for Q, the one behind all the QAnon conspiracies. Their efforts cause them to get stuck at a QAnon convention at sea.\nDirector:Robert Ben Garant\nStars:Carlos Alazraqui, Mary Birdsong, Robert Ben Garant, Kerri Kenney", "Don't Look Up (2021)": "Synopsis : Two low-level astronomers must go on a giant media tour to warn mankind of an approaching comet that will destroy planet Earth.\nDirector:Adam McKay\nStars:Leonardo DiCaprio, Jennifer Lawrence, Meryl Streep, Cate Blanchett", "Cicada (2021)": "Synopsis : Follows hacker Connor, his best friend Avi and a cunning librarian who find themselves over their heads when forced to compete in a sophisticated dark web secret society's global recruitment game.\nDirector:Alan Ritchson\nStars:Jack Kesy, Conor Leslie, Ron Funches, Alan Ritchson", "Mothering Sunday (2021)": "Synopsis : A maid living in post-World War I England secretly plans to meet with the man she loves before he leaves to marry another woman.\nDirector:Eva Husson\nStars:Odessa Young, Josh O'Connor, Colin Firth, Olivia Colman", "The Kindred (2022)": "Synopsis : A woman suffering from amnesia pieces together the events that led to her father's suicide, only to be haunted by the ghosts of children that she begins to suspect were murdered by him.\nDirector:Jamie Patterson\nStars:James Cosmo, Samantha Bond, Patrick Bergin, Tahirah Sharif", "Jekyll and Hyde (2021)": "Synopsis : Dr. Jekyll faces horrible consequences when he lets his dark side run wild with a potion that transforms him into the animalistic Mr. Hyde.\nDirector:Rouben Mamoulian\nStars:Fredric March, Miriam Hopkins, Rose Hobart, Holmes Herbert", "Last Looks (2021)": "Synopsis : A disgraced ex-cop seeks solace by moving to the woods, but his quiet life comes to an end when a private eye recruits him to investigate a murder.\nDirector:Tim Kirkby\nStars:Clancy Brown, Mel Gibson, Morena Baccarin, Charlie Hunnam", "Superworm (2021)": "Synopsis : Superworm is super-long and super-strong, and is always saving the day. But who can save him when he gets too full of himself and is captured by the evil Wizard Lizard?\nDirectors:Jac Hamman,\n|     Stars:Olivia Colman, Matt Smith, Patricia Allison, Kobna Holdbrook-Smith", "Krays Code of Silence (2021)": "Synopsis : Ben, Lucinda and Luke talk about the screenwriting process, pre-production, location and performances plus directing and producing tips and tricks on their film Krays: Code of Silence\nDirector:Giles Alderson\nStars:Giles Alderson, Luke Bailey, Ben Mole, Lucinda Rhodes Thakrar", "The Gardener (2021)": "Synopsis : Two brothers find themselves lost in a mysterious land and try to find their way home.\nStars:\nCollin Dean, Melanie Lynskey, Christopher Lloyd", "National Champions (2021)": "Synopsis : Follows star quarterback who ignites a players strike hours before the biggest game of the year in order to fight for fair compensation, equality and respect for the student-athletes.\nDirector:Ric Roman Waugh\nStars:Stephan James, J.K. Simmons, Alexander Ludwig, Lil Rel Howery", "The Great and Terrible Day of the Lord (2021)": "Synopsis : For their first romantic get-away as a couple, Gabby and Michael take a trip to a remote, upscale cabin in the mountains. The first night takes a terrifying turn when Michael slips into an\nDirectors:Jared Jay Mason,\n|     Stars:Jordan Ashley Grier, Swayde McCoy", "Red Rocket (2021)": "Synopsis : Mikey Saber is a washed-up porn star who returns to his small Texas hometown, not that anyone really wants him back.\nDirector:Sean Baker\nStars:Simon Rex, Bree Elrod, Suzanna Son, Brenda Deiss", "The Seance (2021)": "Synopsis : Sarah and her friends decide to spend the weekend at an old villa Sarah mysteriously inherited. After finding a Ouija Board in the attic, Sarah and her friends unknowingly awaken an evil\nDirector:Andrea Mugnaini\nStars:Alan Cappelli Goetz, Andrea Fachinetti, Holly Louise Mumford, Gianfranco Quero", "Mass (2021)": "Synopsis : An isolated island community experiences miraculous events - and frightening omens - after the arrival of a charismatic, mysterious young priest.\nStars:\nZach Gilford, Kristin Lehman, Samantha Sloyan", "American Siege (2022)": "Synopsis : An ex-NYPD officer-turned-sheriff of a small rural Georgia town has to contend with a gang of thieves who have taken a wealthy doctor hostage.\nDirector:Edward Drake\nStars:Bruce Willis, Rob Gough, Timothy V. Murphy, Johann Urb", "Ghostbusters(2021)": "Synopsis : When a single mom and her two kids arrive in a small town, they begin to discover their connection to the original Ghostbusters and the secret legacy their grandfather left behind.\nDirector:Jason Reitman\nStars:Carrie Coon, Paul Rudd, Finn Wolfhard, Mckenna Grace", "Sensation (2021)": "Synopsis : Attempting to cure her mentally handicapped son's virginity, his mother and several friends embark on a cruise which strands them on nearly deserted island where lust and murder are on the menu!\nDirector:Ottavio Alessi\nStars:Maud Belleroche, Maurizio Bonuglia, Edwige Fenech, Ruggero Miti", "The Lost Daughter (2021)": "Synopsis : A woman's beach vacation takes a dark turn when she begins to confront the troubles of her past.\nDirector:Maggie Gyllenhaal\nStars:Olivia Colman, Jessie Buckley, Dakota Johnson, Ed Harris", "iGilbert (2021)": "Synopsis : Gilbert Gonzalez (Adrian Martinez), feels isolated from the world. He is 39, a virgin, obese and lives with his sarcastic, overprotective mother, who owns the Manhattan brownstone. Fearful\nDirector:Adrian Martinez\nStars:Mozhan Marnò, Raúl Castillo, Dascha Polanco, Monique Gabriela Curnen", "Seal Team (2021)": "Synopsis : The lives of the elite Navy SEALs as they train, plan and execute the most dangerous, high-stakes missions the United States of America can ask.\nStars:\nMax Thieriot, Neil Brown Jr., A.J. Buckley", "Megaboa (2021)": "Synopsis : A group of college students head into the rainforest to look for cave drawings. But a once thought to be extinct fifty-foot boa constrictor is out hungry for blood.\nDirector:Mario N. Bonassin\nStars:Eric Roberts, Emilia Torello, Joe Herrera, Michelle Elizabeth O'Shea", "Amityville in the Hood (2021)": "Synopsis : An Eastside gang uses the Amityville property to grow marijuana when they are attacked by a rival gang and their drugs stolen. Soon, it's unleashed on the Westside streets of Compton, where anyone who smokes it suffers one KILLER buzz.\nDirector:Dustin Ferguson\nStars:Dustin Ferguson, Jennifer Nangle, Ken May, Thom Michael Mulligan", "The Secret Sauce (2021)": "Synopsis : Laura is a Chicago marketing executive sent to oversee a small mid-west town cook-off and entice Jim, the local barbecue joint owner, to let her license his family's secret BBQ sauce. As\nDirector:Philippe Gagnon\nStars:Tori Anderson, Corey Sevier, Nora McLellan, Christian Paul", "The Ravine (2021)": "Synopsis : On a weekday morning in a peaceful suburb of Akron, Ohio, the town awakens to discover that Rachel Turner and her son, Evan, have been brutally murdered during the night. A short while\nDirector:Keoni Waxman\nStars:Teri Polo, Eric Dane, Peter Facinelli, Leslie Uggams", "Where Your Heart Belongs (2022)": "Synopsis : When a NY marketing executive returns home to help with her best friend's wedding, she learns the hard way that the love and support of family and friends means more than she'd ever imagined.\nDirector:Christie Will Wolf\nStars:Jen Lilley, Christopher Russell, Jill Morrison, Robert Wisden", "Into Schrodinger's Box (2021)": "Synopsis : In this daring psychological thriller, musician Sofia must cope with the stress and isolation of quarantine after her husband is infected with COVID-19. Sofia's loneliness leads to\nDirectors:Amir Ganjavie,\n|     Stars:Ada Shkalla, Lee Lawson, Geoff Mays, Frida Banks", "Sheer Pandemic (2022)": "Synopsis : Two unemployed friends become entangled with a gangster once the money starts rolling in after selling black-market toilet paper during a pandemic.\nDirectors:Grant Davis,\n|     Stars:Kris Clinton, Theo Bray, Robin Clayton, Grant Davis", "Delicate State (2022)": "Synopsis : Shot over the course of their actual pregnancy with cast doubling as 2-man crew, Paula and Charlie document their impending parenthood during a time of extreme political division. Their\nDirector:Paula Rhodes\nStars:Paula Rhodes, Charlie Bodin, Glenn Morshower, Cathy Baron", "The Way (2022)": "Synopsis : Desperate to avoid his family's judgment about his perpetual single status, Peter convinces his best friend Nick to join him for the holidays and pretend that they're now in a relationship.\nDirector:Michael Mayer\nStars:Michael Urie, Philemon Chambers, Luke Macfarlane, Barry Bostwick", "Monsters in the Closet (2022)": "Synopsis : Paul Dooley, Paul Walker, John Carradine and Henry Gibson head up an all-star cast in this horror-comedy about a murderous but misunderstood monster!\nDirector:Bob Dahlin\nStars:Donald Grant, Denise DuBarry, Claude Akins, Howard Duff", "Iris Warriors (2022)": "Synopsis : The Iris Warriors have brought light and beauty to the world, but when their bitter mother, Darkness, threatens to destroy them, they must find a way to work together to defeat her and bring colour back to their universe.\nDirector:Roydon Turner\nStars:Jessica Brown Findlay, Cindy Okkers, Sven-Eric Muller, Henk Opperman", "Rucker (The Trucker)": "Synopsis : A trucker attempts to reconnect with his family by killing women who remind him of his ex-wife.\nDirector:Amy Hesketh\nStars:Leona Britt, Jessica Cameron, Corey Taylor, Bobby C. King", "Deadly Garage Sale (2022)": "Synopsis : When thieves rob the garage sale of suburban mom Marcia, a struggle ensues, and one of the thieves is killed. Unbeknownst to Marcia, the dead thief's sister returns, masquerading as a kind\nDirector:Doug Campbell\nStars:Aryè Campos, Juliana Destefano, Autumn Noel, Matthew Pohlkamp", "A Mouthful of Air (2021)": "Synopsis : Julie Davis writes bestselling children's books about unlocking your fears, but has yet to unlock her own. When her daughter is born, that trauma is brought to the fore, and with it, a crushing battle to survive.\nDirector:Amy Koppelman\nStars:Jennifer Carpenter, Amanda Seyfried, Britt Robertson, Paul Giamatti", "The Lost Treasure (2022)": "Synopsis : A globetrotting archaeologist discovers danger and intrigue while searching for an elusive treasure of the ancient Kingdom of Ugarit.\nStars:\nJoanne Kelly, Thure Riefenstein, Susan Ward", "The Jack in the Box(2022)": "Synopsis : When a vintage Jack-in-the-box is un-earthed and opened, it's new owners soon have reason to believe the creepy clown doll within has a life of it's own.\nDirector:Lawrence Fowler\nStars:Ethan Taylor, Robert Strange, Lucy-Jane Quinlan, Philip Ridout", "Furry Friends Forever(2021)": "Synopsis : The Best Furry Friends crew are made up of six girlfriends--Angelina, Cassandra, Kristin, Phoebe, Stephanie, Zoe--and their six furry fashionista side-kicks---Stardust (a pegacorn), Dash (a\nStars:\nMadison Cox, Taylor Lyn Dawson, Lauren Kosteski", "The House (2022)": "Synopsis : The story of the House Targaryen set 200 years before the events of Game of Thrones (2011).\nStars:\nOlivia Cooke, Emma D'Arcy, Matt Smith", "Stoker Hills (2022)": "Synopsis : Three college students filming a horror movie find themselves trapped in their own worst nightmare. Their only hope for survival is two detectives who find the camera they left behind.\nDirector:Benjamin Louis\nStars:Tony Todd, Steffani Brass, David Gridley, Vince Hill-Bedford", "The Curse of La Patasola (2022)": "Synopsis : On a weekend camping trip, two struggling couples are haunted by La Patasola, a famed vampiric monster from Amazonian folklore, testing their relationships, morality, and will to survive.\nDirector:AJ Jones\nStars:Luciana Faulhaber, Patrick R. Walker, Najah Bradley, AJ Jones", "Shattered (2022)": "Synopsis : A rich divorcee Chris falls in love with a mysterious woman Sky where Chris, ex-wife and his child eventually gets trapped and a desperate fight for survival will most likely ensue.\nDirector:Luis Prieto\nStars:Cameron Monaghan, Sasha Luss, Ridely Asha Bateman, Lilly Krug", "Arctic Void (2022)": "Synopsis : When the power mysteriously fails, and almost everyone vanishes from a small tourist vessel in the Arctic, fear becomes the master for the three who remain. Forced ashore, the men\nDirector:Darren Mann\nStars:Michael Weaver, Tim Griffin, Justin Huen, Rune Temte", "The Free Fall (2021)": "Synopsis : After attempting to take her own life, a young woman must wrestle with an overbearing husband.\nDirector:Adam Stilwell\nStars:Andrea Londo, Shawn Ashmore, Jane Badler, Michael Berry Jr.", "Italian Studies (2022)": "Synopsis : A writer loses her memory. Adrift in NYC, she connects with a group of teenagers - in conversations both real and imagined - and searches for a way home.\nDirector:Adam Leon\nStars:Vanessa Kirby, David Ajala, Annika Wahlsten, Lars Wahlsten", "Borrego (2022)": "Synopsis : Borrego follows a young botanist who relocates to a small desert town to study an invasive plant species. She must fight for her survival when she's kidnapped by an inexperienced drug mule after his ultralight plane crashes in the desert.\nDirector:Jesse Harris\nStars:Lucy Hale, Nicholas Gonzalez, Olivia Trujillo, Jorge A. Jimenez", "Ray Donovan(2022)": "Synopsis : Ray Donovan, a professional \"fixer\" for the rich and famous in Los Angeles, can make anyone's problems disappear except those created by his own family.\nStars:\nEddie Marsan, Dash Mihok, Pooch Hall", "Sex Appeal (2022)": "Synopsis : Avery, a teenager with a tendency towards perfectionism, enlists her friend Larson to help her prepare for her first time with her long-distance boyfriend.\nDirector:Talia Osteen\nStars:Mika Abdalla, Jake Short, Rebecca Henderson, Mason Versaw", "The Tragedy of Macbeth (2021)": "Synopsis : A Scottish lord becomes convinced by a trio of witches that he will become the next King of Scotland, and his ambitious wife supports him in his plans of seizing power.\nDirector:Joel Coen\nStars:Denzel Washington, Frances McDormand, Alex Hassell, Bertie Carvel", "The Surprise Visit (2022)": "Synopsis : A robbery goes wrong, leaving two young drug addicts to make a difficult decision: to give up, or to do the unthinkable.\nDirector:Nick Lyon\nStars:Regan Ferrier, Tricia Hawn, Serah Henesey, Rob Riordan", "Hotel Transylvania(2022)": "Synopsis : A writer encounters the owner of an aging high-class hotel, who tells him of his early years serving as a lobby boy in the hotel's glorious years under an exceptional concierge.\nDirector:Wes Anderson\nStars:Ralph Fiennes, F. Murray Abraham, Mathieu Amalric, Adrien Brody", "Photocopier (2021)": "Synopsis : After losing her scholarship when photos of her at a party surface online, a student pairs with a photocopy worker to piece together what happened.\nDirector:Wregas Bhanuteja\nStars:Shenina Cinnamon, Dea Panendra, Giulio Parengkuan, Jerome Kurnia", "Dear Best Friend (2022)": "Synopsis : Dawn Goldie is a painter who seemingly has the perfect life. Thriving gallery, loving husband Alex, and adorable 2 year old son Lennox; but the tragic death of her best friend Cori two\nDirector:DeShon Hardy\nStars:Jeremy Meeks, Andra Fuller, Asia'h Epperson, Vernon Davis", "Brazen (2022)": "Synopsis : When her sister is killed and her double life as a webcam performer is revealed, Grace ignores the warnings of a cool-headed detective and gets involved in the case.\nDirector:Monika Mitchell\nStars:Alyssa Milano, Sam Page, Malachi Weir, Emilie Ullerup", "How I Fell in Love with a Gangster (2022)": "Synopsis : A mysterious woman recounts the rise and fall of Nikodem \"Nikos\" Skotarczak, one of the biggest gangsters in Poland's history.\nDirector:Maciej Kawulski\nStars:Tomasz Wlosok, Aleks Kurdzielewicz, Antoni Królikowski, Agnieszka Grochowska", "I Am Mortal (2022)": "Synopsis : Set 200 years in the future, a small band of rebels face off against the status quo where humans have achieved immortality through genetic engineering\nDirector:Tony Aloupis\nStars:Abraham Lewis, Eloise Smyth, Sean Gunn, Lauren Lindsey Donzis", "The Man with the Answers (2021)": "Synopsis : A former Greek diving champion and an eccentric German student take an adventurous road-trip of rediscovery from Bari to Bavaria.\nDirector:Stelios Kammitsis\nStars:Vasilis Magouliotis, Anton Weil, Pier Andrea Bosna, Vassilis Dimitroulias", "Eternals (2021)": "Synopsis : The saga of the Eternals, a race of immortal beings who lived on Earth and shaped its history and civilizations.\nDirector:Chloé Zhao\nStars:Gemma Chan, Richard Madden, Angelina Jolie, Salma Hayek", "A Journal for Jordan (2021)": "Synopsis : 1st Sgt. Charles Monroe King, before he is killed in action in Baghdad, authors a journal for his son intended to tell him how to live a decent life despite growing up without a father.\nDirector:Denzel Washington\nStars:Michael B. Jordan, Chanté Adams, Jalon Christian, Robert Wisdom", "Amityville Uprising (2022)": "Synopsis : A chemical blast at a military base sets off a supernatural disaster in this tense action-horror thriller. As Sgt. Dash tries to keep the peace at the local police station, the explosion unleashes a toxic acid rain.\nDirector:Thomas J. Churchill\nStars:Mike Ferguson, Kole Benfield, Michael Cervantes, Dan Yoon Hyuck Choi", "Old Strangers (2022)": "Synopsis : Three friends reconnect in a secluded mountain town after a long quarantine. While out for a hike, the trio stumble upon something dark and terrible in the deep woods.\nDirector:Nick Gregorio\nStars:Ted Evans, Madeleine Humphries, Colton Eschief Mastro, Andy Riesmeyer", "Never Alone (2022)": "Synopsis : A hiker's survival skills are put to the test, when he stumbles upon the remains of an old abandoned camp and discovers its long dark secrets.\nDirector:Vincente DiSanti\nStars:Drew Leighty, Vincente DiSanti, Katie Schwartz, Robert DuBois", "I, Challenger (2022)": "Synopsis : Sid, a perennial kid who spends his days playing video games and selling weed, is about to be evicted. Desperate to change his life, he enlists his gaming buddy Logan in a dangerous scheme involving the livestream of a self-burial video.\nDirector:Paul Boyd\nStars:James Duval, Coy Stewart, Tina Majorino, MC Lyte", "The Legend of La Llorona (2022)": "Synopsis : While vacationing in Mexico, a couple discovers their son's disappearance is tied to a supernatural curse.\nDirector:Patricia Harris Seeley\nStars:Autumn Reeser, Danny Trejo, Antonio Cupo, Josh Zaharia", "Stroke of Luck (2022)": "Synopsis : Young Nathan has pulled a damaging prank at his school in the city and is sent to his father's farm to work it off. But Nathan finds much more than he bargained for when he gets there,\nDirector:Christian Frelinghuysen\nStars:Kyle Derosiers, Sara Ball, John Popper, Patrick Lescarbeau", "Run & Gun (2021)": "Synopsis : A homeschooled teenager begins to suspect her mother is keeping a dark secret from her.\nDirector:Aneesh Chaganty\nStars:Sarah Paulson, Kiera Allen, Sara Sohn, Pat Healy", "North to Home (2022)": "Synopsis : Follows Suzanne McBride and her three adopted daughters, this looks like a great time for a family reunion, but the sisters are each wrestling with unique challenges that threaten to derail this special occasion.\nDirector:Ali Liebert\nStars:Lyndsy Fonseca, Kimberley Sustad, Erica Durance, Tom Stevens", "Small World (2021)": "Synopsis : Follows policeman Robert Goc, who becomes engaged in an international investigation to find a girl who was kidnapped by Russian mafia.\nDirector:Patryk Vega\nStars:Piotr Adamczyk, Enrique Arce, Jim Conway, Andris Keiss", "War Cake (2022)": "Synopsis : Judith, a small-town senior on the verge of graduation, struggles against the pressure of her strict religious upbringing and is pushed to extreme lengths when a terrible event brings her entire world crashing down.\nDirectors:Taylor Frost,\n|     Stars:Christopher Cutillo, Michael Ray Davis, Danielle Engelman, Jamie Frost", "Dancer in Danger (2022)": "Synopsis : An online dance contest turns deadly when an unknown assailant attacks and abducts a woman's teenage daughter.\nDirector:Chris Jaymes\nStars:Lauren Albo, Chelsea Rose Cook, Dylan Flynn, Emma Jessop", "Deadly Ex Next Door (2022)": "Synopsis : Elise and her husband Allan have finally found the perfect home: it's secluded, on a lake, and the two can finally enjoy a little quiet while Elise works on her novel. A few weeks later, a\nDirector:Joseph J. Gillanders\nStars:Tianna Nori, Jack Grinhaus, Jean Paul Najm, Brendee Green", "A World Of Worlds(2022)": "Synopsis : As an asteroid nears Earth, a man finds himself alone after his wife leaves in a panic. He decides to take a road trip to reunite with his high school sweetheart. Accompanying him is a neighbor who inadvertently puts a wrench in his plan.\nDirector:Lorene Scafaria\nStars:Steve Carell, Keira Knightley, Melanie Lynskey, Patton Oswalt", "Pleasure (2021)": "Synopsis : Bella Cherry arrives in Los Angeles with dreams of becoming an adult film star, but she soon learns that fame won't come easy as she harnesses her ambition and cunning to rise to the top of this mesmerizing and singular world.\nDirector:Ninja Thyberg\nStars:Sofia Kappel, Revika Anne Reustle, Evelyn Claire, Chris Cock", "Weekend Warriors (2021)": "Synopsis : A fun camping trip turns into a desperate fight for survival after two kids witness a horrific event in the wild. They have to endure the elements and wildlife and they must also find a way to reach civilization before it's too late.\nDirectors:Brett Bortle,\n|     Stars:Corbin Bernsen, Jason London, Jack Gross, Juliet Rusche", "Killer Stepmom (2022)": "Synopsis : A teen with a reputation for telling lies and creating trouble witnesses her new stepmother murder a man in a vacant parking lot. Now, she must convince her mother to believe her story before she enacts her plan to destroy her family.\nDirector:Richard Switzer\nStars:Julia Terranova, Jillian Murray, Jon Briddell, D.C. Douglas", "Another Us (2021)": "Synopsis : A high school senior finds himself in alternate realities where the one thing he wants the most is missing, his girlfriend.\nDirectors:Jeffrey Bruck,\n|     Stars:Jarrett Bloom, Haileigh Bruck, Sarah Fleming, Sonja Gallahan", "Harvey (2021)": "Synopsis : Steve Harvey welcomes a variety of conflicts and characters to his courtroom, from small claims to big disputes.\nStars:\nColbert Minga", "See for Me (2022)": "Synopsis : When blind former skier Sophie cat-sits in a secluded mansion, three thieves invade for the hidden safe. Sophie's only defense is army veteran Kelly. Kelly helps Sophie defend herself against the invaders to survive.\nDirector:Randall Okita\nStars:Skyler Davenport, Natalie Brown, Matthew Gouveia, Laura Vandervoort", "Sing 2 (2021)": "Synopsis : Buster Moon and his friends must persuade reclusive rock star Clay Calloway to join them for the opening of a new show.\nDirector:Garth Jennings\nStars:Matthew McConaughey, Reese Witherspoon, Scarlett Johansson, Tori Kelly", "The Tender Bar (2021)": "Synopsis : A boy growing up on Long Island seeks out father figures among the patrons at his uncle's bar.\nDirector:George Clooney\nStars:Ben Affleck, Tye Sheridan, Daniel Ranieri, Lily Rabe", "The Wasteland (2021)": "Synopsis : The tranquil lives of a family isolated from the rest of society are disturbed by a terrifying creature, testing the ties that bind them together.\nDirector:David Casademunt\nStars:Inma Cuesta, Roberto Álamo, Asier Flores, Alejandra Howard", "The Commando (2022)": "Synopsis : A DEA agent with PTSD returns home after a botched mission and must now protect his family from a home invasion after a recently freed convict and his henchmen come after their stash of millions inside of the agent's home.\nDirector:Asif Akbar\nStars:Mickey Rourke, Michael Jai White, Jeff Fahey, Brendan Fehr", "Chief Daddy 2(2021)": "Synopsis : 'Chief Daddy' tells the story of billionaire industrialist Chief Beecroft, a flamboyant benefactor to a large extended family of relatives, household staff, and assorted mistresses. Chief\nDirector:Niyi Akinmolayan\nStars:Aiyeola Bisola, Dakore Akande, Funke Akindele, Zainab Balogun", "Four to Dinner (2022)": "Synopsis : In this rom-com challenging the concept of soulmates, parallel storylines portray four single friends as they pair up in different couple combinations.\nDirector:Alessio Maria Federici\nStars:Ilenia Pastorelli, Matilde Gioli, Giuseppe Maggio, Matteo Martari", "Time Is Up (2022)": "Synopsis : An accident will force 'Vivien' and Royan to come to a stop and reclaim their lives, one minute at the time, and finally start living in a present that perhaps will prove to be more exciting than any predefined.\nDirector:Elisa Amoruso\nStars:Bella Thorne, Benjamin Mascolo, Sebastiano Pigazzi, Bonnie Baddoo", "Nightshade (2022)": "Synopsis : When a homicide detective's disturbing dreams reveal parallels to an ongoing investigation, he must do whatever it takes to discover his connection to the brutal killings.\nDirector:Landon Williams\nStars:Dina Meyer, Jason Patric, Lou Ferrigno Jr., Tim Russ", "Safe Space (2022)": "Synopsis : Lila and her autistic son Ian hide in a panic room and have to outsmart some intruders that would do anything to recover a video that Ian accidentally recorded of them breaking-in in a house and killing the homeowner.\nDirector:Boris Kodjoe\nStars:Mackenzie Astin, Monica Calhoun, Drea de Matteo, Junie Hoang", "The Perfect Pairing (2022)": "Synopsis : A food and wine critic who hits her head and loses her memory while accidentally visiting a winery she panned in the past, owned and operated by single dad Michael.\nDirector:Don McBrearty\nStars:Brennan Elliott, Zarina Rocha, Genelle Williams, Art Hindle", "Cyrano (2021)": "Synopsis : Too self-conscious to woo Roxanne himself, wordsmith Cyrano de Bergerac helps young Christian nab her heart through love letters.\nDirector:Joe Wright\nStars:Peter Dinklage, Haley Bennett, Kelvin Harrison Jr., Ben Mendelsohn", "The King's Daughter (2022)": "Synopsis : King Louis XIV's quest for immortality leads him to capture and steal a mermaid's life force, a move that is further complicated by his illegitimate daughter's discovery of the creature.\nDirector:Sean McNamara\nStars:Pierce Brosnan, William Hurt, Benjamin Walker, Kaya Scodelario", "The Finellis Movie (2022)": "Synopsis : Tony Finelli does a one-on-one exclusive interview with celebrity reporter Barbara Bischof for \"Hollywood Hotline.\" During the course of the interview, Tony looks back at his extraordinarily eventful life.\nStars:\nYvonne Denner, Mark Janicello, Bianca Karsten", "Outside (2022)": "Synopsis : The rivalry between two gangs, the poor Greasers and the rich Socs, only heats up when one gang member kills a member of the other.\nDirector:Francis Ford Coppola\nStars:C. Thomas Howell, Matt Dillon, Ralph Macchio, Patrick Swayze", "Dogtown 2 (2022)": "Synopsis : It's election time in Dogtown and longtime Mayor Jack Russel has his nose fixed on a fourth term. But Barney Lockjaw plots to take over the junkyard. Will Dogtown stop Barney Lockjaws before it's too late? Find out in Dogtown 2.\nDirector:Ryan Pollin\nStars:Todd Allen, Jonathon Carley, Jonathon Carley, Douglas Gaugard", "Fishing for Love (2021)": "Synopsis : When Kendall, a successful restaurant designer comes home to Mystic Bay for the annual Big Catch Festival, she finds herself in uncharted waters with town newcomer Zack. Is Kendall baited\nDirector:David Bercovici-Artieda\nStars:Reese Alexander, Andrea Brooks, Garry Chalk, Nhi Do", "Try Harder! (2021)": "Synopsis : Seniors at one the best public high schools in the country face the pressure of applying to elite colleges.\nDirector:Debbie Lum\nStars:Alvan Cai, Shealand Fairchild, Rachael Schmidt, Richard Shapiro", "Echoes of the Past (2021)": "Synopsis : A fictional drama inspired by true events, the \"Massacre of Kalavryta\" committed by invading German troops in December 1943. When the Greek government launches a multi-billion legal claim\nDirector:Nicholas Dimitropoulos\nStars:Max von Sydow, Astrid Roos, Danae Skiadi, Nikolas Papagiannis", "The Runner (2022)": "Synopsis : Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow \"runners\" for a shot at escape.\nDirector:Wes Ball\nStars:Dylan O'Brien, Kaya Scodelario, Will Poulter, Thomas Brodie-Sangster", "LOL Surprise(2021)": "Synopsis : As a new year at school begins, Lola's heart is broken by her boyfriend, though soon she's surprised by her best friend, promising musician Kyle, who reveals his feelings for her.\nDirector:Lisa Azuelos\nStars:Miley Cyrus, Douglas Booth, Ashley Greene, Demi Moore", "Fallen (2022)": "Synopsis : Sam Witwicky leaves the Autobots behind for a normal life. But when his mind is filled with cryptic symbols, the Decepticons target him and he is dragged back into the Transformers' war.\nDirector:Michael Bay\nStars:Shia LaBeouf, Megan Fox, Josh Duhamel, Tyrese Gibson", "Shut In (2022)": "Synopsis : When a young mother is barricaded inside a pantry by her violent ex-boyfriend, she must use ingenuity to protect her two small children from escalating danger while finding an escape.\nDirector:D.J. Caruso\nStars:Rainey Qualley, Jake Horowitz, Luciana VanDette, Vincent Gallo", "Bigbug (2022)": "Synopsis : A group of bickering suburbanites find themselves stuck together when an android uprising causes their well intentioned household robots to lock them in for their own safety.\nDirector:Jean-Pierre Jeunet\nStars:Isabelle Nanty, Elsa Zylberstein, Claude Perron, Stéphane De Groodt", "Tall Girl 2 (2022)": "Synopsis : After Jodi Kreyman gains popularity, her miscommunications start causing rifts with those around her and now she really needs to 'stand tall'.\nDirector:Emily Ting\nStars:Ava Michelle, Griffin Gluck, Sabrina Carpenter, Anjelika Washington", "A Week In Paradise (2022)": "Synopsis : An international film star's world collapses when her film director husband is outed by the paparazzi as having a baby with his new young leading lady. Seeking solace and healing, she escapes to a Caribbean boutique hotel resort.\nDirector:Philippe Martinez\nStars:Connie Nielsen, Malin Akerman, Philip Winchester, Jack Donnelly", "Those Who Walk Away (2022)": "Synopsis : After Max and Avery meet on a social media app for a first date, they end up at a haunted house only to realize the trauma they share may either save them or erupt into an unforgettable nightmare.\nDirector:Robert Rippberger\nStars:Booboo Stewart, Nils Allen Stewart, Scarlett Sperduto, Bryson JonSteele", "Catch the Fair One (2022)": "Synopsis : A former champion boxer embarks on the fight of her life when she goes in search of her missing sister.\nDirector:Josef Kubota Wladyka\nStars:Lisa Emery, Kimberly Guerrero, Kevin Dunn, Daniel Henshall", "North of the 10 (2022)": "Synopsis : Story of five friends struggling to succeed in Chicago's entertainment industry while one of them pursues an international romance with a wealthy young heiress\nDirector:Rhyan LaMarr\nStars:Mykelti Williamson, Stephanie Nur, Jaleel White, George Lopez", "Indemnity (2022)": "Synopsis : A Los Angeles insurance representative lets an alluring housewife seduce him into a scheme of insurance fraud and murder that arouses the suspicion of his colleague, an insurance investigator.\nDirector:Billy Wilder\nStars:Fred MacMurray, Barbara Stanwyck, Edward G. Robinson, Byron Barr", "Supercool (2021)": "Synopsis : Lifelong friends Neil and Gilbert's undeniable bond is tested to the limits when Neil makes a magical wish that comes true. With the assistance of Neil's charismatic neighbor, Jimmy, and Gilbert's wild ideas, Neil endures one epic night.\nDirector:Teppo Airaksinen\nStars:Jake Short, Miles J. Harvey, Damon Wayans Jr., Madison Davenport", "The In Between (2022)": "Synopsis : After surviving a car accident that took the life of her boyfriend, a teenage girl believes he's attempting to reconnect with her from the after world.\nDirector:Arie Posin\nStars:Joey King, Kyle Allen, Kim Dickens, John Ortiz", "Cosmic Dawn (2022)": "Synopsis : After witnessing the alien abduction of her mother as a child, Aurora joins the UFO cult \"The Cosmic Dawn\". Now moved on from the cult, Aurora is forced to confront her past and pursue the ultimate truth about The Cosmic Dawn.\nDirector:Jefferson Moneo\nStars:Camille Rowe, Emmanuelle Chriqui, Antonia Zegers, Joshua Burge", "The Sky Is Everywhere (2022)": "Synopsis : A shy, teenage musician tries to keep things together in the aftermath of her older, more outgoing sister's death.\nDirector:Josephine Decker\nStars:Grace Kaufman, Jacques Colimon, Cherry Jones, Jason Segel", "Rooney (2022)": "Synopsis : Plot kept under wrap.\nDirector:Luca Guadagnino\nStar:Rooney Mara", "Marry Me (2022)": "Synopsis : Music superstars Kat Valdez and Bastian are getting married before a global audience of fans. But when Kat learns, seconds before her vows, that Bastian has been unfaithful, she decides to marry Charlie, a stranger in the crowd, instead.\nDirector:Kat Coiro\nStars:Jennifer Lopez, Owen Wilson, Maluma, John Bradley", "I Want You Back (2022)": "Synopsis : Newly dumped thirty-somethings Peter and Emma team up to sabotage their exes' new relationships and win them back for good.\nDirector:Jason Orley\nStars:Charlie Day, Jenny Slate, Scott Eastwood, Gina Rodriguez", "Into the Wind (2022)": "Synopsis : She graduated from a prestigious high school in Warsaw and entered medicine in London. He works as a kitesurfing instructor at the seaside, thanks to which he combines earning money and\nDirector:Kristoffer Rus\nStars:Sonia Mietielica, Jakub Sasak, Waleria Gorobets, Sebastian Dela", "Kimi (2022)": "Synopsis : Two strangers find themselves linked in a bizarre way. When a connection forms, will distance be the only thing to keep them apart?\nDirector:Makoto Shinkai\nStars:Ryûnosuke Kamiki, Mone Kamishiraishi, Ryô Narita, Aoi Yûki", "Redeeming Love (2022)": "Synopsis : Sold into prostitution as a child, Angel knows nothing but betrayal. Can her heart ever be mended? Based upon the novel by Francine Rivers.\nDirector:D.J. Caruso\nStars:Abigail Cowen, Tom Lewis, Eric Dane, Famke Janssen", "Shapeless (2021)": "Synopsis : Ivy, a struggling singer in New Orleans trapped in the hidden underworld of her eating disorder, must face her addiction - or risk becoming a monster.\nDirector:Samantha Aldana\nStars:Kelly Murtagh, Bobby Gilchrist, Jamie Neumann, Erika Ashley", "The Wolf and the Lion (2021)": "Synopsis : A wolf pup and a lost lion cub are rescued by a girl in the heart of the Canadian wilderness. Their friendship will change their lives forever.\nDirector:Gilles de Maistre\nStars:Molly Kunz, Graham Greene, Charlie Carrick, Derek Johns", "The Privilege (2022)": "Synopsis : A wealthy teen and his friends attending an elite private school uncover a dark conspiracy while looking into a series of strange supernatural events.\nDirectors:Felix Fuchssteiner,\n|     Stars:Max Schimmelpfennig, Lea van Acken, Tijan Marei, Milena Tscharntke", "Exorcist Vengeance (2022)": "Synopsis : A tough priest with a troubled past is called to root out a murderous demon from a household of suspects.\nDirectors:Scott Jeffrey,\n|     Stars:Robert Bronzi, Steven Berkoff, Simon Furness, Adrienne Grant", "Just Swipe (2022)": "Synopsis : Vanessa has always had trouble in the dating world, never mind now being confined to her home. She soon discovers just how much you can get away with dating via webcam, but is the love she feels true or only a distorted version of reality?\nDirector:Elizabeth Blake-Thomas\nStars:Jodie Sweetin, David Lipper, Danielle Perez, Alec Mapa", "Set Secrets (2022)": "Synopsis : An actress, Valentine Woodward, gets the opportunity of a lifetime when she co-stars alongside of rising star Jason Desmond. Valentine begins to feel uncomfortable on set due to Jason's\nDirector:Jerard McKinzie\nStars:Jesse Dwight Bingham, Nadine Bone, Troy Jackson, Patreice Manders", "Miss Willoughby and the Haunted Bookshop (2022)": "Synopsis : A University professor with an insatiable appetite for investigation is asked by some old family friends to investigate a series of hauntings at their antique bookstore.\nDirector:Brad Watson\nStars:Robert Adams, Louise Bangay, Cassandra Barnes, Ruth Clarson-Horrocks", "Alter Ego (2021)": "Synopsis : This is a story of a reclusive paranoia genius author who spends a night in his isolated mansion waiting for his creation to come and destroy him.\nDirector:Ezio Massa\nStars:Dylan Walsh, Steve Stanulis, Eric Roberts, Rodrigo Guirao Díaz", "Alone with You (2022)": "Synopsis : As a young woman painstakingly prepares a romantic homecoming for her girlfriend, their apartment begins to feel more like a tomb when voices, shadows, and hallucinations reveal a truth she has been unwilling to face.\nDirectors:Emily Bennett,\n|     Stars:Emily Bennett, Barbara Crampton, Meghan Lane, Dora Madison", "Super Turnt (2022)": "Synopsis : Libaraiers \"Rilla\" Stanford, has just been released from prison and finds that his immediate world has changed, knowing that the dangers of the streets remain the same, his only mission it to take care of his 6yr old son, Kevin.\nDirector:Mann Robinson\nStars:Harry Lennix, Torrei Hart, Jamal Woolard, Patrice Fisher", "Student Body (2022)": "Synopsis : The semester has barely begun, and already the students of the Camella Swales School For Girls are bucking for extra credit. The race is on to the head fo the class, and these girls are\nDirector:Cybil Richards\nStars:Jacy Andrews, Chelsea Blue, Syren De Mer, Maya Divine", "The Tiger Rising (2022)": "Synopsis : A young boy discovers a caged tiger in the woods near his home.\nDirector:Ray Giarratana\nStars:Dennis Quaid, Katharine McPhee, Queen Latifah, Sam Trammell", "The King's Man (2021)": "Synopsis : In the early years of the 20th century, the Kingsman agency is formed to stand against a cabal plotting a war to wipe out millions.\nDirector:Matthew Vaughn\nStars:Ralph Fiennes, Gemma Arterton, Rhys Ifans, Harris Dickinson", "Cut, Color, Murder (2022)": "Synopsis : When a beauty pageant creator is found dead, a savvy hairdresser works with a new detective and risks everything to clear the names of those she loves.\nDirector:Stacey N. Harding\nStars:Julie Gonzalo, Ryan McPartlin, Eva Tamargo, Grace Beedie", "The Other Me (2022)": "Synopsis : An architect is diagnosed with a rare eye disease, entering him into a surreal reality in which he sees people's true motives. As the visions become intolerable, he falls for a mysterious\nDirector:Giga Agladze\nStars:Jim Sturgess, Andreja Pejic, Antonia Campbell-Hughes, Rhona Mitra", "A Violent Man (2022)": "Synopsis : Steve Mackleson is a dangerous prisoner, incarcerated for double murder in a maximum security prison. We follow, as he navigates his struggle against redemption the system and his inner\nDirector:Ross McCall\nStars:Craig Fairbrass, Stephen Odubola, Jason Flemyng, Ross McCall", "Book of Love (2022)": "Synopsis : Two writers thrown together on a book tour in Mexico.\nDirector:Analeine Cal y Mayor\nStars:Sam Claflin, Verónica Echegui, Fernando Becerril, Ruy Gaytan", "American Underdog (2021)": "Synopsis : The story of NFL MVP and Hall of Fame quarterback Kurt Warner, who went from stocking shelves at a supermarket to becoming an American Football star.\nDirectors:Andrew Erwin,\n|     Stars:Zachary Levi, Anna Paquin, Hayden Zaller, Ser'Darius Blain", "Last Survivors (2022)": "Synopsis : A father and son, who have been living off grid for 20 years, encounter an outsider who threatens to destroy the utopia they've built.\nDirector:Drew Mylrea\nStars:Drew Van Acker, Alicia Silverstone, Stephen Moyer, Mark Famiglietti", "Immanence (2022)": "Synopsis : Radio astronomers discover a mysterious signal in the deep sea that could be contact with extraterrestrials. After several terrifying manifestations threaten their beliefs, the team must fight to survive the ultimate evil.\nDirector:Kerry Bellessa\nStars:Michael Beach, Jamie McShane, Eugene Byrd, Anthony Ruivivar", "Slapface (2021)": "Synopsis : A boy deals with the loss of his mother by creating a dangerous relationship with a monster rumored to live in the woods.\nDirector:Jeremiah Kipp\nStars:August Maturo, Mike Manning, Libe Barer, Mirabelle Lee", "First Person Shooter (2022)": "Synopsis : The creative head of a video game development company is close to releasing his newest game when a mysterious coder begins to hack his life - destroying everything he knows.\nDirector:Steven R. Monroe\nStars:Jacob Blair, Jeremy Walmsley, Danika Frederick, Stephanie Sy", "Ghosts of the Ozarks (2022)": "Synopsis : In post-Civil War Arkansas, a young doctor is mysteriously summoned to a remote town in the Ozarks only to discover that the utopian paradise is filled with secrets and surrounded by a menacing, supernatural presence.\nDirectors:Matt Glass,\n|     Stars:Thomas Hobson, Phil Morris, Tara Perry, Tim Blake Nelson", "Double Walker (2021)": "Synopsis : A young woman's ghost investigates the mysterious events that led to her own murder.\nDirector:Colin West\nStars:Sylvie Mix, Justin Rose, Quinn Armstrong, Jacob Rice", "A Playful Romance (2021)": "Synopsis : A passionate theater director has to find a way to keep her theater from being sold by making this year's \"A Christmas Carol\" into the biggest success ever, and with the help of a handsome Hollywood actor, it may not be impossible.\nDirector:John Stimpson\nStars:Jamie Perez, Maureen Keiller, Caroline Portu, Robert Walsh", "The Reunion (2022)": "Synopsis : An unscripted Friends reunion special.\nDirectors:Russell Norman,\n|     Stars:Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc", "Nightmare Alley (2021)": "Synopsis : An ambitious carny with a talent for manipulating people with a few well-chosen words hooks up with a female psychiatrist who is even more dangerous than he is.\nDirector:Guillermo del Toro\nStars:Bradley Cooper, Cate Blanchett, Toni Collette, Willem Dafoe", "Moon Crash (2022)": "Synopsis : A global steel company is working with an aerospace partner to extract lunar material. When a drilling accident causes a giant piece of the moon to break off, it goes on a collision course with Earth.\nDirector:Noah Luke\nStars:Jeremy London, Tyler Christopher, Jamison Jones, Pauline Egan", "City of Vultures 2 (2022)": "Synopsis : City of Vultures 2 picks up as a brash of murders engulfs the Chicago streets. Richard Steele (Marcus Carothers), commonly known as \"G\", positions himself as the centerpiece of criminal activity on the city's Southside.\nDirector:Marcus Carothers\nStars:Zamien 'Az-Is' Shearer, Julian T. Allen, Harper Anthony, Valaun Baldwin", "They/Them/Us (2021)": "Synopsis : Charlie and Lisa, two divorced parents in their 40's who find themselves at a midlife crossroads. Both are single parents and they have four complicated teenagers.\nDirector:Jon Sherman\nStars:Joey Slotnick, Amy Hargreaves, Jack Steiner, Shanna Strong", "House of Gucci (2021)": "Synopsis : When Patrizia Reggiani, an outsider from humble beginnings, marries into the Gucci family, her unbridled ambition begins to unravel their legacy and triggers a reckless spiral of betrayal, decadence, revenge, and ultimately\nDirector:Ridley Scott\nStars:Lady Gaga, Adam Driver, Al Pacino, Jeremy Irons", "Werewolf Castle (2022)": "Synopsis : Village boy Thorfinn accompanies a group of Knights on a dangerous quest to end a werewolf invasion.\nDirector:Charlie Steeds\nStars:Peter Lofsgard, Jay O'Connell, Greg Draven, Reece Connolly", "Butlers in Love (2022)": "Synopsis : Follows Emma and Henry, they train to become royal butlers where the competition is fierce and sparks fly.\nDirector:David Weaver\nStars:Stacey Farber, Corey Cott, Maxwell Caulfield, Manuela Sosa", "Lotawana (2022)": "Synopsis : A monotonous life has pushed the unfulfilled Forrest (Todd Blubaugh) to a voyage of self-discovery by living aboard his sailboat on an alluring, Missouri lake. Soon he catches wind of the\nDirector:Trevor Hawkins\nStars:Todd Blubaugh, Nicola Collie, Anita Cordell, Colleen Kirk", "Evil at the Door (2022)": "Synopsis : One night every year the world sees an alarming surge in violent home invasions. This is no coincidence.\nDirector:Kipp Tribble\nStars:Andrea Sweeney Blanco, Bruce Davison, Sunny Doench, Robert Felsted Jr.", "Home Team (2022)": "Synopsis : The story about New Orleans Saints head coach Sean Payton coaching his son's 6th grade football team, when Payton was suspended for the entire 2012 season as a result of his role in the Saints' Bountygate scandal.\nDirectors:Charles Kinnane,\n|     Stars:Kevin James, Taylor Lautner, Rob Schneider, Jackie Sandler", "The Ice Age Adventures of Buck Wild (2022)": "Synopsis : The Ice Age Adventures of Buck Wild continues the escapades of the possum brothers Crash and Eddie who set out to find a place of their own. Together with the one-eyed weasel, Buck Wild, they face the dinosaurs who inhabit the Lost World.\nDirector:John C. Donkin\nStars:Utkarsh Ambudkar, Sean Kenin, Jake Green, Aaron Harris", "Damon's Revenge (2022)": "Synopsis : A group of young adults spend the weekend at a friend's house by the lake. Joined by the local sheriff, the group encounters an escaped convict Native American chief, a copycat killer and the return of the terrifying masked stalker, Damon.\nDirector:David Gere\nStars:Chelsea Vale, Tom Sizemore, Robert LaSardo, Michael Madsen", "In the Forest (2022)": "Synopsis : After a family camping trip turns horrific, a mother must fight to save her family from an angry landowner who's hiding a terrifying secret on his property.\nDirector:Hector Barron\nStars:Debbon Ayer, Lyman Ward, Cristina Spruell, Mathew Odette", "Clean (2022)": "Synopsis : Tormented by his past, a garbage man named Clean attempts a quiet life of redemption. But, soon finds himself forced to reconcile with the violence of his past.\nDirector:Paul Solet\nStars:Adrien Brody, Glenn Fleshler, Richie Merritt, Chandler DuPont", "The Requin (2022)": "Synopsis : A couple on a romantic getaway find themselves stranded at sea when a tropical storm sweeps away their villa. In order to survive, they are forced to fight the elements, while sharks circle below.\nDirector:Le-Van Kiet\nStars:Alicia Silverstone, James Tupper, Deirdre O'Connell, Danny Chung", "Deadly House Call (2022)": "Synopsis : A busy working mother hires a nurse to care for her wealthy father who has early onset dementia. Soon a bizarre deception creeps into play when the seductive nurse makes a play for the family fortune.\nDirector:Max McGuire\nStars:Sierra Wooldridge, Joanne Jansen, Neville Edwards, Sean Jones", "Love in Aruba (2021)": "Synopsis : Add a Plot\nDirector:Brian Brough\nStars:Sashleigha Hightower, David McConnell, Scarlett Hazen, Liz Christensen", "The Ledge (2022)": "Synopsis : A climber trapped on the face of a mountain fights off four killers stood on an overhanging ledge twenty feet above her.\nDirector:Howard J. Ford\nStars:Brittany Ashworth, Ben Lamb, Nathan Welsh, Louis Boyer", "The Fallout (2022)": "Synopsis : High schooler Vada navigates the emotional fallout she experiences in the wake of a school tragedy. Relationships with her family, friends and view of the world are forever altered.\nDirector:Megan Park\nStars:Jenna Ortega, Maddie Ziegler, Niles Fitch, Will Ropp", "The 355 (2022)": "Synopsis : When a top-secret weapon falls into mercenary hands, a wild card CIA agent joins forces with three international agents on a lethal mission to retrieve it, while staying a step ahead of a mysterious woman who's tracking their every move.\nDirector:Simon Kinberg\nStars:Jessica Chastain, Penélope Cruz, Bingbing Fan, Diane Kruger", "Juniper (2021)": "Synopsis : When a self-destructive teenager is suspended from school and asked to look after his feisty alcoholic grandmother as a punishment, the crazy time they spend together turns his life around.\nDirector:Matthew J. Saville\nStars:Charlotte Rampling, Marton Csokas, George Ferrier, Edith Poor", "Baja Come Down (2021)": "Synopsis : Charlie and Hannah can't say it out loud, but they both know their relationship is coming to an end. As a last ditch effort, the two head south with Hannah's cat, along the dusty coast of\nDirector:Anderson Matthew\nStars:Caitlin Michael Riley, Michelle Ortiz, Lou, Abel Ortega", "Gold (2022)": "Synopsis : When two men discover the biggest gold nugget ever found they must find a way to excavate it.\nDirector:Anthony Hayes\nStars:Zac Efron, Akuol Ngot, Thiik Biar, Andreas Sobik", "Confession (2022)": "Synopsis : One church, one priest, a wounded man and his loaded gun. An intense thriller played out in real time during one night where a vengeful confession must take place.\nDirector:David Beton\nStars:Colm Meaney, Stephen Moyer, Clare-Hope Ashitey, Kris Johnson", "MICerz (2022)": "Synopsis : 'MICerz' takes you into the wild, raw, and out-of-control world of underground stand-up comedy; As a rag-tag group of comics band together to try and save their hole-in-the wall open mic.\nDirector:Omar Dzlieri\nStars:Austin Torelli, Joe Manente, Dante Chang, Christopher Donnellon", "Crosses (2021)": "Synopsis : A \"sexy, brilliant\" Boston medical examiner. Despite a checkered career, Dr. Jordan Cavanaugh goes above and beyond to solve cases.\nStars:\nMiguel Ferrer, Ravi Kapoor, Steve Valentine", "Found Wandering Lost (2022)": "Synopsis : With girlfriend pulled into his ambitions, Trent runs from contracted hit men as he slips into the deep back roads that crisscross the empty rolling plains. Along the way he stumbles upon Ben, a drifter who now calls these roads home.\nDirector:Nicholaus James\nStars:Eric Bowles, Dylan Brown, Jessi Burkette, Christie Courville", "Tom and Jerry Cowboy Up! (2022)": "Synopsis : The film finds the duo in the Wild West where they help save a ranch from the hands of a villain. The rivals team up to help a cowgirl and her brother save their homestead from a greedy land-grabber.\nDirector:Darrell Van Citters\nStars:George Ackles, Sean Burgos, Trevor Devall, Chris Edgerly", "Birds Like Us (2022)": "Synopsis : The story follows a group of birds on a journey where they try to find a better life for themselves and the ones they love.\nDirectors:Faruk Sabanovic,\n|     Stars:Alicia Vikander, Sheridan Smith, Jeremy Irons, Jim Broadbent", "Don't Forget I Love You (2022)": "Synopsis : Follows Taylor, who opens a time capsule left by her deceased mother, which contains six envelopes, this will give her the push she needs in life and to help open her mind, and heart, to the possibility of love.\nDirector:Christie Will Wolf\nStars:Emilie Ullerup, Clayton James, Daphne Hoskins, Teagan Vincze", "Definition Please (2021)": "Synopsis : A former Scribbs Spelling Bee champion must reconcile with her estranged brother when he returns home to help care for their sick mother.\nDirector:Sujata Day\nStars:Katrina Bowden, Eugene Byrd, LeVar Burton, Lalaine", "Heatwave (2022)": "Synopsis : Claire, an ambitious young woman, starts working for a successful and rich businessman, but unknowingly gets involved in an affair with his wife.\nDirector:Ernie Barbarash\nStars:Kat Graham, Merritt Patterson, Sebastian Roché, Cardi Wong", "Killer Ambition (2022)": "Synopsis : Sylvia is an ambitious businesswoman and the owner of a successful jewelry company. However, strange things begin to happen to her when she joins a secret society for female entrepreneurs.\nDirector:Lindsay Hartley\nStars:Tahnee Harrison, Jonathan Stoddard, Sean Kanan, Shellie Sterling", "In Passing (2022)": "Synopsis : A young, melancholic musician falls in love with a French actress in New Zealand and is forced to face the weight of reality before he can begin the next chapter of his life.\nDirector:Joshua Prendeville\nStars:Arlo Green, Lydia Bensky, Layla Robinson, Ella Gilbert", "Last Radio Call (2022)": "Synopsis : On June 30th, 2018, Officer David Serling went missing inside an undisclosed abandoned hospital. Using his recovered body cam footage, his wife attempts to piece together what happened to him on that horrible night.\nDirector:Isaac Rodriguez\nStars:Sarah Froelich, Jason Scarbrough, June Griffin Garcia, Ali Alkhafaji", "Amandla (2022)": "Synopsis : Years after surviving a childhood tragedy, two brothers fall on opposing sides of the law as a gang-linked crime tests their loyalty to one another.\nDirector:Nerina De Jager\nStars:Lemogang Tsipa, Thabo Rametsi, Thabiso Masoti, Bahle Mashinini", "A Shot Through the Wall (2022)": "Synopsis : A Chinese-American police officer's life unravels after he accidentally shoots an innocent Black man. Facing trial, he wades through his guilt as he navigates the complicated worlds of media, justice, racial politics and his own morality.\nDirector:Aimee Long\nStars:Kenny Leu, Ciara Renée, Fiona Fu, Tzi Ma", "The Laureate (2021)": "Synopsis : A married couple on the brink of disillusion allows a stranger to live with them in their idyllic cottage. Will this stranger push their fragile state over the edge?\nDirector:William Nunez\nStars:Laura Haddock, Dianna Agron, Tom Hughes, Fra Fee", "Regrets (2022)": "Synopsis : In the later years of her life, as she's approaching the age of forty, the novelist Jane Austen helps her niece find a husband.\nDirector:Jeremy Lovering\nStars:Samuel Roukin, Olivia Williams, Greta Scacchi, Imogen Poots", "Untangled (2022)": "Synopsis : When an absence of communication reveals a love triangle, much more than lies come to light.\nDirector:Brandon Cornett\nStars:Jamal Woolard, Tory Monay, Kaylee Crossfire, Q. Davis Lea", "He Belongs to Me (2021)": "Synopsis : An overprotective mother will do anything to protect her son even if it means taking a life.\nDirector:Silk White\nStars:Kizra Deon, Joseph S James, Jehna Michelle, James Elwood Muller", "Phony (2022)": "Synopsis : A struggling filmmaker, unlucky in love, enlists the aid of a womanizing friend to create an exploitative documentary about online dating.\nDirector:David Bush\nStars:Shiree Adkins, Holly Bonney, David Bush, Sophia Dietzel", "The Hunting (2021)": "Synopsis : In this harrowing docuseries, a cruel conman masquerading as a British spy manipulates and steals from his victims, leaving ruined families in his wake.\nStars:\nStephen Corrall, Sophie Clifton, John Atkinson", "Warhunt (2022)": "Synopsis : A US Army plane flies over Germany's Black Forest in 1945. It's suddenly enveloped by a swarm of crow feathers. As the aircraft plummets toward the ground, the AIRMEN glimpse the feathers converging to form a MYSTERIOUS WOMAN IN BLACK.\nDirector:Mauro Borrelli\nStars:Mickey Rourke, Jackson Rathbone, Robert Knepper, Polina Pushkareva", "The Royal Treatment (2022)": "Synopsis : New York hairdresser Izzy seizes the chance to work at the wedding of a charming prince, but when sparks between them fly, will love or duty prevail?\nDirector:Rick Jacobson\nStars:Laura Marano, Peter Chin, Julie Edwards, Talia Lesser", "The Last Thing Mary Saw (2021)": "Synopsis : Winter, 1843. A young woman is under investigation following the mysterious death of her family's matriarch. Her recollection of the events sheds new light on the ageless forces behind the tragedy.\nDirector:Edoardo Vitaletti\nStars:Stefanie Scott, Daniel Pearce, Philip Hoffman, Matthew Stannah", "Gulliver Returns (2021)": "Synopsis : World traveler and adventurer Gulliver is invited to return to Lilliput, the town he previously saved from the enemy fleet of the neighboring Blefuscu. When he arrives, he only finds\nDirector:Ilya Maksimov\nStars:Tyler Bunch, Wayne Grayson, Alyson Leigh Rosenfeld, Billy Bob Thompson", "Raven (2022)": "Synopsis : The owner of a successful video game design company and his troubled staff struggle to keep their hit game 'Mythic Quest' on top.\nStars:\nF. Murray Abraham, Charlotte Nicdao, Ashly Burch", "Gutter (2022)": "Synopsis : Leo, Mathias, Jens and Herman were kings of High School. 8 years later they are still living together, and haven't done anything with their lives, except party, drink, and repeat. Society has left them behind, without them knowing it. Yet.\nStars:\nTorjus Tveiten, Eirik Hvattum Bjørnstad, Jørgen Evensen", "Borrelia Borealis (2021)": "Synopsis : In a global pandemic, chronically ill Beth is forced to confront her personal demons in quarantine. When she answers a call from a mysterious man, an unlikely romance opens a lush, new cosmic world through astral projection.\nDirector:Kathryne Isabelle Easton\nStars:Kathryne Isabelle Easton, Anthony Goes, Jack Herholdt, Maiya Reaves", "The Wrong Blind Date (2022)": "Synopsis : After a recent divorce, Laura is encouraged to move on with an online dating service. She receives a message from someone who catches her attention, but her daughter grows suspicious and is determined to discover the truth.\nDirector:David DeCoteau\nStars:Vivica A. Fox, Meredith Thomas, Matthew Pohlkamp, Clark Moore", "Half & Half (2022)": "Synopsis : A hedonistic jingle writer's free-wheeling life comes to an abrupt halt when his brother and 10-year-old nephew move into his beach-front house.\nStars:\nAshton Kutcher, Angus T. Jones, Conchata Ferrell", "Entropy (2022)": "Synopsis : On the same day Abbey is diagnosed with ovarian cancer, she and her girlfriend, Miranda, are invited to dinner by Miranda's former self-help group to celebrate the return of their estranged\nDirector:Kameron Hale\nStars:Miranda Nieman, Hayley Sunshine, Scott Hale, William E Newton", "Cosmic Radio (2021)": "Synopsis : A 38-year-old California trust fund kid tries to save his independent radio station, KZMC Cosmic Radio, from financial ruin when his wealthy father pulls the plug.\nDirector:Stephen Savage\nStars:Jonathan Sachar, Irene Bedard, Rider Strong, Michael Madsen", "Road to Perth (2021)": "Synopsis : Rejected after a marriage proposal, Alex finds himself alone on a journey from Los Angeles to Melbourne, Australia, on what was supposed to be a happy vacation with his new fiancée. Stuck\nDirector:Chad Peter\nStars:Tommy O'Brien, Hannah Lehmann, Rachel Scott, Ellen Grimshaw", "Ditched (2021)": "Synopsis : After a routine prison transfer crashes in the forest, young Inuit paramedic Melina finds herself surrounded by murderers with a mere 100 feet to climb out of a ditch to escape.\nDirector:Christopher Donaldson\nStars:Marika Sila, Kris Loranger, Lee Lopez, Declan O'Reilly", "Hanging on to Love (2022)": "Synopsis : Jewel cannot catch a break in the love department these days-she is failing in everything from her clothing design business to finding love.\nDirector:Crystal Ellis\nStars:Niamo Batchelor, Kiana Beime, Shayla Cheatham, Ken Glover", "Lot Lizards (2022)": "Synopsis : This story is about four women who hustle gullible men on the streets of Memphis selling sex at truck stops. Angie is the bottom chick who is often beaten and sexually abuse by her Pimp\nDirector:Robert L. Parker III\nStars:Jason Anderson, Amika Carr, Latrice Franklin, Meagan Harper", "Catwoman(2022)": "Synopsis : A shy woman, endowed with the speed, reflexes, and senses of a cat, walks a thin line between criminal and hero, even as a detective doggedly pursues her, fascinated by both of her personas.\nDirector:Pitof\nStars:Halle Berry, Sharon Stone, Benjamin Bratt, Lambert Wilson", "Dracula(2022)": "Synopsis : The centuries old vampire Count Dracula comes to England to seduce his barrister Jonathan Harker's fiancée Mina Murray and inflict havoc in the foreign land.\nDirector:Francis Ford Coppola\nStars:Gary Oldman, Winona Ryder, Anthony Hopkins, Keanu Reeves", "Popovich(2022)": "Synopsis : Get ready for a fun-filled, fast-paced family comedy extravaganza. A modern take on slapstick comedy, POPOVICH: ROAD TO HOLLYWOOD features amazing circus stunts, intricate set-piece gags,\nDirectors:Gregory Popovich,\n|     Stars:Gregory Popovich, Shannan Calcutt, Amos Glick, Carrie Gregory", "Spider-Man(2021)": "Synopsis : With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man.\nDirector:Jon Watts\nStars:Tom Holland, Zendaya, Benedict Cumberbatch, Jacob Batalon", "AI Love You (2022)": "Synopsis : A modern love story set in the near future where an AI building is powered by human feelings. Due to a software glitch, it falls in love with a real girl, escapes the building into the body of a real man, and tries to win her affections.\nDirectors:David Asavanond,\n|     Stars:Pimchanok Leuwisetpaiboon, Mario Maurer, Sahajak Boonthanakit, David Asavanond", "Reel Monsters (2022)": "Synopsis : Four teens are swept into the adventure of a lifetime involving a legendary creature and a mystery from the past that will change their lives forever.\nDirector:Mark Polonia\nStars:Dawson Hilfiger, Nicholas Olson, Sophie Guss, Lucien Limberg", "Apparitions (2021)": "Synopsis : A couple is haunted by a supernatural presence that is unleashed during a college experiment.\nDirector:Todd Lincoln\nStars:Ashley Greene, Sebastian Stan, Tom Felton, Julianna Guill", "The Souvenir(2021)": "Synopsis : Bounty hunter Boba Fett & mercenary Fennec Shand navigate the underworld when they return to Tatooine to claim Jabba the Hutt's old turf.\nStars:\nMing-Na Wen, Frank Trigg, Collin Hymes", "FLEE THE LIGHT (2022)": "Synopsis : A psychology student attempts to cure her sister's crippling psychosis only to expose them both to its origin: an ancient creature intent on claiming their souls.\nDirector:Alexandra Senza\nStars:Annie Tuma, Ariana Marquis, Jamar Adams Thompson, Jane Siberry", "Seize the Night (2022)": "Synopsis : Over the course of one night, a whirlwind romance between a drug dealer and a mysterious singer takes them on a collision course with a dangerous mind-control drug through the Los Angeles underground scene.\nDirector:Gene Blalock\nStars:Nina Bergman, Trevor Torseth, Matt Miller, Jonathan Erickson Eisley", "Here Before (2022)": "Synopsis : When a new family moves in next door to Laura and her family, their young daughter, Megan, quickly captivates her, stirring up painful memories of her own daughter, Josie, who died several years previously.\nDirector:Stacey Gregg\nStars:Andrea Riseborough, Jonjo O'Neill, Niamh Dornan, Eileen O'Higgins", "TQM (2022)": "Synopsis : One of the most prestigious psychiatrists in Mexico decides to put her three children to the test to determine how to divide their inheritance. Everything gets complicated when one of her patients decides not to collaborate with them.\nDirector:Oren Stambouli\nStars:Gabriel Tarantini, Ana Carolina Grajales, Pablo Azar, Saraí Meza", "Until We Meet Again (2022)": "Synopsis : A woman discovers that her new house is inhabited by the ghost of a passionate young concert pianist who died tragically thirty-five years earlier.\nDirector:Pece Dingo\nStars:Jackson Rathbone, Janel Parrish, Michael Madsen, Leslie Jordan", "Along Came Wanda (2021)": "Synopsis : A memory jogged by a teapot from an old lover quickly turns into an adventure of discovery for Mary Beth Higgins and her new found friend Wanda as they hit the road in Wanda's RV/Soup Truck.\nDirector:Jan Miller Corran\nStars:Isabella Hofmann, Max Adler, Cathy DeBuono, Adam Huss", "Harmony From The Heart (2022)": "Synopsis : Follows a woman chasing her dream job, not without getting a difficult task from her professor, she realizes that she loves helping people and her heart begins to open.\nDirector:Michael Robison\nStars:Linden McMillan, Christie Burke, Jesse Moss, Susan Hogan", "Old Flames Never Die (2022)": "Synopsis : When successful novelist Kira Young (Yan-Kay Crystal Lowe) returns to her hometown to escape bad press after her cheating fiancé Tyson (Rich Paul) is accused of murder, she rekindles a\nDirector:Jake Helgren\nStars:Yan-Kay Crystal Lowe, Lou Ferrigno Jr., Rich Paul, Whitney Able", "Line Sisters (2022)": "Synopsis : Four sorority sisters reunite at a Black Greek Weekend celebration. But the past comes knocking on their door and strange and inexplicable things begin to happen, threatening to unearth the deadly secret that may tear them apart.\nDirector:Tailiah Breon\nStars:LeToya Luckett-Walker, Kierra Sheard-Kelly, Drew Sidora, Ta'Rhonda Jones", "Bae Wolf (2022)": "Synopsis : In the year 500 A.D., a jealous, decapitating monster terrorizes the drunken revelers of Heorot. A fearless princess goes in search of a hero who can save her people. But that hero guards a secret more dangerous than any monster.\nDirector:David Axe\nStars:Mike Amason, Antonia Anderson, Santiago Azpurua-Borras, Aaron Blomberg", "Collide (2022)": "Synopsis : Based on the 2014 romance novel of the same name, this follows the love life of two young adults.\nDirector:Roger Kumble\nStars:Josephine Langford, Hero Fiennes Tiffin, Dylan Sprouse, Louise Lombard", "Non-Disclosure (2022)": "Synopsis : A new comer to a company climbs the corporate ladder very quickly, but pays a cost behind closed doors to get there.\nDirector:Nelson J. Davis\nStars:Donte Alston, Nelson J. Davis, Caranita Harrelson, Michelle Harts", "The Contrast (2022)": "Synopsis : At a quaint Bed and Breakfast, Maria is about to marry her longtime beau - the smooth talking, hipster Dimple, when her Maid-of-Honor's brother, Colonel Henry Manly, stops by to help set up\nDirectors:Sean Dube,\n|     Stars:Lance E. Nichols, Chip Carriere, Anton David Jeftha, Deanna Rashell", "Mortal Kombat Legends: Battle of the Realms (2021)": "Synopsis : The Earthrealm heroes must journey to Outworld and fight for the survival of their homeland, invaded by the forces of evil warlord Shao Kahn, in the tournament to end all tournaments: the final Mortal Kombat.\nDirector:Ethan Spaulding\nStars:Jennifer Carpenter, Joel McHale, Ike Amadi, Artt Butler", "Good Old Friends (2021)": "Synopsis : Three good old friends reunite in Berlin for a party. It becomes apparent how much their lives have changed in just 5 years. A harmless prank ends in murder and the other two are left scrambling for a plan to dispose of their friend's body\nDirectors:Peter Kondra,\n|     Stars:Peter Kondra, Andrej Vickers, Mikael Schallock, Marie Céline Yildirim", "Vacation Friends (2021)": "Synopsis : A couple meets up with another couple while on vacation in Mexico, but their friendship takes an awkward turn when they get back home.\nDirector:Clay Tarver\nStars:Lil Rel Howery, Yvonne Orji, John Cena, Meredith Hagner", "Monster Hunter: Legends of the Guild (2021)": "Synopsis : In a world where humans and fearsome monsters live in an uneasy balance, young hunter Aiden fights to save his village from destruction by a dragon.\nDirector:Steve Yamamoto\nStars:Dante Basco, Erica Lindbeck, Brando Eaton, Karen Strassman", "How It Ends (2021)": "Synopsis : In the midst of an apocalypse, a man struggles to reach his pregnant wife, who is thousands of miles away.\nDirector:David M. Rosenthal\nStars:Theo James, Kat Graham, Nancy Sorel, Nicole Ari Parker", "After The End (2020)": "Synopsis : The world has been left in ruins following the outbreak of a terrifying disease. Deep in the Australian countryside, a group of survivors are locked in a constant struggle to stay alive.\nDirector:Helen McFarlane\nStars:Jasper Bagg, Lee Beckhurst, Nick Cain, Amelia Corneby", "Ascendant (2021)": "Synopsis : A young woman discovers her destiny as an heiress of intergalactic nobility and must fight to protect the inhabitants of Earth from an ancient and destructive industry.\nDirectors:Lana Wachowski,\n|     Stars:Channing Tatum, Mila Kunis, Eddie Redmayne, Sean Bean", "Dark Spell (2021)": "Synopsis : A scorned woman uses black magic to try to get her husband back, with deadly consequences.\nDirector:Svyatoslav Podgaevskiy\nStars:Yana Yenzhayeva, Konstantin Beloshapka, Ilya Yermolov, Nikita Yuranov", "Dynasty Warriors (2021)": "Synopsis : This movie is adapted from a video game of the same title. The story is set in the turbulent late Eastern Han Dynasty. Ambitious Dong Zhuo controls the court and the commonalty, and heroes from all over the country begin to rise.\nDirector:Roy Hin Yeung Chow\nStars:Louis Koo, Kai Wang, Ray Lui, Justin Cheung", "Summer Days": "Synopsis : A high school grad and a hooker-in-training try to track down his stolen Corvette.\nDirector:Matthew Robbins\nStars:Mark Hamill, Annie Potts, Eugene Roche, William Bryant", "Take Back the Night (2021)": "Synopsis : Finding herself the victim of a violent monster attack, Jane launches a vigilante campaign to hunt the beast that tried to kill her. Jane's efforts intensify, but her troubling history of\nDirector:Gia Elliot\nStars:Emma Fitzpatrick, Angela Gulner, Jennifer Lafleur, Sibongile Mlambo", "The Witcher: Nightmare of the Wolf (2021)": "Synopsis : Escaping from poverty to become a witcher, Vesemir slays monsters for coin and glory, but when a new menace rises, he must face the demons of his past.\nDirector:Kwang Il Han\nStars:Theo James, Mary McDonnell, Lara Pulver, Graham McTavish", "The Green Knight (2021)": "Synopsis : A fantasy retelling of the medieval story of Sir Gawain and the Green Knight.\nDirector:David Lowery\nStars:Dev Patel, Alicia Vikander, Joel Edgerton, Sarita Choudhury", "Night Drive (2021)": "Synopsis : A ride share driver's life is turned upside down after an unexpected series of misfortunes.\nDirectors:Brad Baruh,\n|     Stars:AJ Bowen, Sophie Dalah, Scott Poythress, Lamar Bell", "Midnight in the Switchgrass (2021)": "Synopsis : An FBI agent and Florida State officer team up to investigate a string of unsolved murder cases.\nDirector:Randall Emmett\nStars:Emile Hirsch, Megan Fox, Bruce Willis, Lukas Haas", "Killer Cheer Mom (2021)": "Synopsis : Riley, who is new in town, tries out for the cheer squad, but as her changes get better, she notices some cheerleaders are suspiciously expelled or injured, and she wonders if her stepmom is doing whatever it takes to get her on the team.\nDirector:Randy Carter\nStars:Denise Richards, Thomas Calabro, Courtney Fulk, Jay Jay Warren", "The Santa Stakeout (2021)": "Synopsis : Tanya, a police detective who is partnered with fellow detective Ryan to solve a recent string of heists. They go undercover as newlyweds, moving into the vacant house next to Mr. Miller, the prime suspect in the case.\nDirector:Peter Benson\nStars:Tamera Mowry-Housley, Paul Campbell, Joe Pantoliano, Peter Bryant", "Christmas on the Carousel (2021)": "Synopsis : Four lifelong friends convene over winter break for their last Christmas at home together.\nDirector:Erik Bloomquist\nStars:Erik Bloomquist, Madeleine Dauer, Taylor Turner, Rachel Oremland", "Christmas Collision (2021)": "Synopsis : Theodora, a time consumed professional crosses paths with Charlie, a writer, when she travels to his hometown for business just before Christmas. Both are taken by surprise when unexpected circumstances present themselves.\nDirector:Lana Read\nStars:Sebrina Scott, Alyssa Ryan, Vernon Wells, Eric Six", "Christmas Freak (2021)": "Synopsis : Christmas comes just once a year. But for Rudy, every day is Christmas. And every day is perfect. Because Christmas is perfect. At least that's what Rudy tells himself.\nDirector:Sean Brown\nStars:Sean Marlow, Amy Hagan, David Drumgold, Gemma Bulos", "Uploaded (2021)": "Synopsis : A man is able to choose his own afterlife after his untimely death, by having his consciousness uploaded into a virtual world. As he gets used to his new life and befriends his angel (real world handler), questions about his death arise.\nStars:\nRobbie Amell, Owen Daniels, Andy Allo", "The J Team (2021)": "Synopsis : JoJo is kicked out of her dance troupe and finds out what dancing truly is.\nDirector:Michael Lembeck\nStars:JoJo Siwa, Tisha Campbell, Laura Soltis, Kiara T. Romero", "The Madness Inside Me (2020)": "Synopsis : A forensic psychiatrist's husband is killed during a home invasion, but instead of identifying the killer, she recants. She stalks the newly released psychopath, deciding whether she wants to kill him, sleep with him, or try to know him.\nDirector:Matthew Berkowitz\nStars:Merrin Dungey, Devon Graye, Jennifer Gelfer, Scotty Tovar", "Saving Paradise (2021)": "Synopsis : A ruthless corporate raider is forced to return to his small town roots where he suddenly inherits his father's nearly bankrupt pencil factory. He must decide to either let it close, or join the community's fight to save it.\nDirector:Jay Silverman\nStars:William Moseley, Johanna Braddy, Mimi Kennedy, Shashawnee Hall", "Worth (2021)": "Synopsis : An attorney in Washington D.C. battles against cynicism, bureaucracy and politics to help the victims of 9/11.\nDirector:Sara Colangelo\nStars:Michael Keaton, Amy Ryan, Stanley Tucci, Tate Donovan", "Yakuza Princess (2021)": "Synopsis : The heiress to half of the Yakuza crime syndicate forges an uneasy alliance with an amnesiac stranger who believes an ancient sword binds their two fates. She must unleash war against the other half of the syndicate who wants her dead.\nDirector:Vicente Amorim\nStars:MASUMI, Jonathan Rhys Meyers, Tsuyoshi Ihara, Eijiro Ozaki", "Karen (2021)": "Synopsis : Karen attempts to displace the new Black family that moved into the neighborhood, but they won't back down without a fight.\nDirector:Coke Daniels\nStars:Taryn Manning, Cory Hardrict, Jasmine Burke, Roger Dorman", "Hands Up (2021)": "Synopsis : After his cousin is shot and killed by a white police officer in Chicago and Black Lives Matter protests spread across the city, a black inner city teen desperately fights for a way out of the most notorious murder capital of America.\nDirector:Chuck Whitman\nStars:Jermaine Johnson, Jamal Woolard, LaRoyce Hawkins, Kris D. Lofton", "We Need to Do Something (2021)": "Synopsis : After Melissa and her family seek shelter from a storm, they become trapped. With no sign of rescue, Melissa comes to realize that she and her girlfriend Amy might have something to do with the horrors that threaten her family.\nDirector:Sean King O'Grady\nStars:Sierra McCormick, Vinessa Shaw, Pat Healy, Lisette Alexis", "Church People (2021)": "Synopsis : A heartfelt and laugh-out-loud comedy film, Church People is the story of real people with real struggles and their unique paths to discovering what faith in Jesus is all about. It all\nDirector:Christopher Shawn Shaw\nStars:Thor Ramsey, Erin Cahill, Michael Monks, Joey Fatone", "Burial Ground Massacre (2021)": "Synopsis : A group of college students spend a night at an old, eerie manor, only to realize that a terrifying stalker is watching their every move as he begins plans to repossess an ancient Native American artifact located inside.\nDirectors:Daniel Dahlstrom,\n|     Stars:Michael Madsen, Chelsea Vale, Vinny Marseglia, Chris Whitcomb", "Ted Bundy American Boogeyman (2021)": "Synopsis : The intrepid FBI agents Kathleen McChesney and Robert Ressler, organize one of the largest manhunt in history to apprehend America's most infamous serial killer, Ted Bundy.\nDirector:Daniel Farrands\nStars:Chad Michael Murray, Holland Roden, Jake Hays, Lin Shaye", "Zone 414 (2021)": "Synopsis : Set in the near future, private detective David Carmichael is hired by Marlon Veidt, an eccentric businessman, to track down his missing daughter. David teams up with Jane, a highly advanced A.I. to solve the mystery.\nDirector:Andrew Baird\nStars:Guy Pearce, Matilda Anna Ingrid Lutz, Jonathan Aris, Colin Salmon", "Cinderella (2021)": "Synopsis : When her father unexpectedly dies, young Ella finds herself at the mercy of her cruel stepmother and her scheming stepsisters. Never one to give up hope, Ella's fortunes begin to change after meeting a dashing stranger.\nDirector:Kenneth Branagh\nStars:Lily James, Cate Blanchett, Richard Madden, Helena Bonham Carter", "It Takes Three (2021)": "Synopsis : When the coolest guy in school discovers that the new girl sees through his popularity and good looks, he enlists the class nerd to take over his social media accounts to add substance to his style.\nDirector:Scott Coffey\nStars:Jared Gilman, David Gridley, Aurora Perrineau, Mikey Madison", "Plan A (2021)": "Synopsis : Three blue-collar acquaintances come across millions of dollars in lost cash and make a plan to keep their find from the authorities, but it isn't long before complications and mistrust weave their way into the plan.\nDirector:Sam Raimi\nStars:Bill Paxton, Billy Bob Thornton, Bridget Fonda, Brent Briscoe", "Small City (2021)": "Synopsis : A young street hustler from London and a drugs mule from Europe form an unlikely bond after a violent confrontation with a neighbourhood heavy.\nDirectors:Georgie Curran,\n|     Stars:Eddie Thompson, Isabella Nefar, Yasen Atour, Mitchell Hunt", "Vivandiere (2021)": "Synopsis : Two young women from both sides of the Civil War volunteer as battlefield nurses, facing down scornful commanders and murderous war criminals to accomplish their hazardous duty.\nDirector:James R. Temple\nStars:Robin Black, Mikyla Bordner, Dallan Starks", "Don't Breathe 2 (2021)": "Synopsis : The sequel is set in the years following the initial deadly home invasion, where Norman Nordstrom (Stephen Lang) lives in quiet solace until his past sins catch up to him.\nDirector:Rodo Sayagues\nStars:Stephen Lang, Madelyn Grace, Brendan Sexton III, Adam Young", "Afterlife of the Party (2021)": "Synopsis : A social butterfly who dies during her birthday week is given a second chance to right her wrongs on Earth.\nDirector:Stephen Herek\nStars:Victoria Justice, Midori Francis, Robyn Scott, Adam Garcia", "Man vs. Bigfoot (2021)": "Synopsis : After his brother goes missing on a hiking trail, Jack Rollins goes in search of him but in doing so, Jack soon finds himself in a game of cat and mouse with a creature thought only to be legend.\nDirector:David D. Ford\nStars:David D. Ford, Bob Gimlin, Theresa Mills, Timothy Eason", "Escape From Area 51 (2021)": "Synopsis : Sheera, a sexy alien warrior uses a power glitch to escape from captivity at Area 51. Now she must elude her enemies to rescue Kyra, her fellow warrior, and find her way home.\nDirector:Eric Mittleman\nStars:Donna D'Errico, Chris Browning, Sarah Schueler, Caleb Thomas", "Baby Money (2021)": "Synopsis : When a home invasion turns into a bloody shoot-out, a pair of ragtag fugitives take refuge in the house of a single mother as they wait on their fiery (and very pregnant) getaway driver to hatch an escape plan in time for a major payday.\nDirectors:Mikhael Bassilli,\n|     Stars:Danay Garcia, Taja V. Simpson, Michael Drayer, Joey Kern", "Live or Let Die (2021)": "Synopsis : Through an outbreak of a virus the human race has come near to extinction. Lone wolf Nick and reckless John wander through the destroyed land following a map, their last chance for hope to a safer sanctuary.\nDirector:Manuel Urbaneck\nStars:Jan Bohlenschmidt, Manuel Urbaneck, Steven Mooers, Alona Hertha", "Outlaw's Buckle (2021)": "Synopsis : During a terrible storm, a serial killer wreaks havoc inside of a Texas prison.\nDirector:Brett Bentman\nStars:Thom Hallum, Rachel G. Whittle, Andy Arrasmith, Tiffany McDonald", "Megalodon Rising (2021)": "Synopsis : When history's greatest aquatic predator returns, the armada of modern warships sent to destroy it has no chance at all.\nDirector:Brian Nowak\nStars:Tom Sizemore, Wynter Eddins, O'Shay Neal, Isidoro Perez", "Superhost (2021)": "Synopsis : With their follower count dwindling, travel vloggers Teddy and Claire pivot to creating viral content around their most recent \"superhost,\" Rebecca, who wants more from the duo than a great review.\nDirector:Brandon Christensen\nStars:Sara Canning, Osric Chau, Gracie Gillam, Barbara Crampton", "Wired Shut (2021)": "Synopsis : A disillusioned famous novelist, unable to talk while recovering in his remote mountain home from major reconstructive jaw surgery, is exposed to a life-threatening secret when he receives an unexpected visit from his estranged daughter.\nDirector:Alexander Sharp\nStars:Blake Stadel, Natalie Sharp, Behtash Fazlali", "Give Up the Ghost (2021)": "Synopsis : A day player from James Cameron's \"Titanic,\" joins a group of famous actors as they go on a search for a secret treasure vault in the doomed luxury liner, Titanic.\n\n", "The Last House on the Street (2021)": "Synopsis : After being released from prison, a young gangster with a chip on his shoulder decides to punish society by making snuff films.\nDirector:Roger Watkins\nStars:Roger Watkins, Ken Fisher, Bill Schlageter, Kathy Curtin", "Sweet Pecan Summer (2021)": "Synopsis : Sparks fly between a woman and her ex-boyfriend as they work together, to sell her aunt's pecan farm.\nDirector:Dustin Rikert\nStars:Christine Ko, Wes Brown, Lauren Tom, Chase Ramsey", "Danger in the Spotlight (2021)": "Synopsis : A single mom and recovering alcoholic becomes the caretaker to a woman she may or may not have paralyzed in a drunk driving accident.\nDirector:David Martín Porras\nStars:Jessica Morris, Anna Marie Dobbins, Alivea Disney, Harper Holmes", "Spoken (2021)": "Synopsis : A young Christian girl and her friends are vulnerable to demonic attack because of words spoken in their everyday conversations.\nDirector:Tenill Ransom\nStars:Ryan Paynter, Steven Serbones, Chelsea Skalski, Keely Dervin", "12 Mighty Orphans (2021)": "Synopsis : Haunted by his mysterious past, a devoted high school football coach leads a scrawny team of orphans to the state championship during the Great Depression and inspires a broken nation along the way.\nDirector:Ty Roberts\nStars:Luke Wilson, Vinessa Shaw, Wayne Knight, Martin Sheen", "The Gateway (2021)": "Synopsis : A social worker assigned to the care of the daughter of a single mother intervenes when the dad returns from prison and lures them into a life of crime.\nDirector:Michele Civetta\nStars:Shea Whigham, Olivia Munn, Zach Avery, Bruce Dern", "Respect (2021)": "Synopsis : Following the rise of Aretha Franklin's career from a child singing in her father's church's choir to her international superstardom, RESPECT is the remarkable true story of the music icon's journey to find her voice.\nDirector:Liesl Tommy\nStars:Jennifer Hudson, Forest Whitaker, Marlon Wayans, Tituss Burgess", "Summertime (2020)": "Synopsis : A young woman moves from the French countryside to Paris and begins a passionate love affair with a feminist leader in this drama set in 1970s France.\nDirector:Catherine Corsini\nStars:Cécile de France, Izïa Higelin, Noémie Lvovsky, Jean-Henri Compère", "Defining Moments (2021)": "Synopsis : Defining Moments is a highly comedic film about that one single moment in time that changes you from who you were to who you'll be.\nDirector:Stephen Wallis\nStars:Burt Reynolds, Sienna Guillory, Tammy Blanchard, Eric Peterson", "He's All That (2021)": "Synopsis : A teenage girl sets out to give a nebbish classmate the ultimate high school makeover. An updated remake of the 1999 film, 'She's All That'.\nDirector:Mark Waters\nStars:Addison Rae, Tanner Buchanan, Madison Pettis, Rachael Leigh Cook", "The Stairs (2021)": "Synopsis : Two adults and a juvenile break into a house occupied by a brother and sister and their stolen children. There, they must fight for their lives.\nDirector:Wes Craven\nStars:Brandon Quintin Adams, Everett McGill, Wendy Robie, A.J. Langer", "Rushed (2021)": "Synopsis : The merciless 1970s rivalry between Formula One rivals James Hunt and Niki Lauda.\nDirector:Ron Howard\nStars:Daniel Brühl, Chris Hemsworth, Olivia Wilde, Alexandra Maria Lara", "The Protege (2021)": "Synopsis : Rescued as a child by the legendary assassin Moody, Anna is the world's most skilled contract killer. However, when Moody is brutally killed, she vows revenge for the man who taught her everything she knows.\nDirector:Martin Campbell\nStars:Michael Keaton, Maggie Q, Samuel L. Jackson, David Rintoul", "Mosquito State (2020)": "Synopsis : Wall Street data analyst Richard Boca sees ominous patterns: His computer models are behaving erratically, as are the swarms of mosquitos breeding in his apartment, an infestation that attends his psychological meltdown.\nDirector:Filip Jan Rymsza\nStars:Beau Knapp, Charlotte Vega, Jack Kesy, Olivier Martinez", "His Stretch of Texas Ground (2021)": "Synopsis : A monstrous crime occurs in Arlettsville that shatters Sheriff Joe Haladin and his family. But then, on the very same day, another tsunami hits. Stars Jeff Weber as Sheriff Joe Haladin.\nDirector:Ralph Cinque\nStars:Jeff Weber, George Welder, Jeff Caperton, Hailley Lauren", "Jurassic Shark 2: Aquapocalypse (2021)": "Synopsis : A ferocious, prehistoric Megalodon has returned to the surface, terrorizing a group of oil rig workers and members of a local fishing village.\nDirector:Mark Polonia\nStars:Jeff Kirkendall, James Carolus, Jamie Morgan, Tim Hatch", "About Pie (2021)": "Synopsis : A young man's love of pie fuels a series of misadventures in modern romance.\nDirector:Joshua M. Lester\nStars:Joshua M. Lester, Skye LaFontaine, Greg Hirshland, Sam Anker", "The Old Ways (2020)": "Synopsis : An old gunslinger and his daughter must face the consequences of his past, when the son of a man he murdered years ago arrives to take his revenge.\nDirector:Brett Donowho\nStars:Nicolas Cage, Ryan Kiera Armstrong, Clint Howard, Nick Searcy", "Love Upstream (2021)": "Synopsis : Author Charlotte, a Chicago city girl heads to the wilderness of Minnesota to write her new book. Her guide, Rob, doubts Charlotte's skills. However, they realize they have more in common than not - and find themselves falling in love.\nDirector:Bill Corcoran\nStars:Kimberly-Sue Murray, Steve Lund, Nadine Whiteman Roden, Jeff Teravainen", "The Girl in Cabin 13 (2021)": "Synopsis : A young couple must fight for their lives in a remote cabin when three masked men appear outside their door at night.\nDirector:Brendan Rudnicki\nStars:Dylan DeVane, Brent Downs, Reggie Johnson, Stuart Maxheimer", "The Forever Room (2021)": "Synopsis : Claire wakes one day to find herself chained in a basement. Her horror is amplified when she discovers that her captor is her own mother. Finding herself between reality and insanity, and ultimately forced to face a dark truth.\nDirector:Kevin Hicks\nStars:Samantha Valletta, Kevin Hicks, Vickie Hicks, Christopher Hicks", "Broken Diamonds (2021)": "Synopsis : In the wake of his father's death, a twenty-something writer sees his dream of moving to Paris put in jeopardy when he's forced to temporarily take in his wildly unpredictable, mentally ill sister.\nDirector:Peter Sattler\nStars:Ben Platt, Yvette Nicole Brown, Lynda Boyd, Lola Kirke", "Paper Tiger (2020)": "Synopsis : Three Kung Fu prodigies have grown into washed-up, middle-aged men, now one kick away from pulling their hamstrings. But when their master is murdered, they must juggle their dead-end jobs, dad duties, and old grudges to avenge his death.\nDirector:Quoc Bao Tran\nStars:Yuji Okumoto, Ron Yuan, Matthew Page, Andy Le", "After Love (2021)": "Synopsis : Set in the port town of Dover, Mary Hussain suddenly finds herself a widow following the unexpected death of her husband. A day after the burial, she discovers he has a secret just twenty-one miles across the English Channel in Calais.\nDirector:Aleem Khan\nStars:Joanna Scanlan, Nathalie Richard, Talid Ariss, Nasser Memarzia", "Echoes of Violence (2021)": "Synopsis : An immigrant travels from Sedona to Los Angeles to seek revenge against the immigration lawyer who ruined her life.\nDirector:Nicholas Woods\nStars:Michaella Russell, Heston Horwin, Chase Cargill, Taylor Flowers", "The Show (2021)": "Synopsis : An inside look at the lives of the people who help America wake up in the morning, exploring the unique challenges faced by the men and women who carry out this daily televised ritual.\nStars:\nReese Witherspoon, Billy Crudup, Mark Duplass", "It Came from Below (2021)": "Synopsis : A group of friends find themselves hunted down in the caves by a creature\nDirector:Dan Allen\nStars:Megan Purvis, Tara MacGowran, Becca Hirani, Georgie Banks", "Stoker Hills (2020)": "Synopsis : Three college students filming a horror movie find themselves trapped in their own worst nightmare. Their only hope for survival is two detectives who find the camera they left behind.\nDirector:Benjamin Louis\nStars:Tony Todd, Steffani Brass, David Gridley, Vince Hill-Bedford", "The Wild Man Skunk Ape (2021)": "Synopsis : The skunk ape, also known as the Florida Bigfoot has been rumored to be responsible for several murders in South Florida. A documentary crew sets out to uncover the truth.\nDirector:Ryan Justice\nStars:Lauren Crandall, Julian Green, Mike Reed, David E. McMahon", "Past Shadows (2021)": "Synopsis : A forensic psychiatrist decides to change work. Days before leaving, a case of 5 shot on a Copenhagen city bus might involve an old patient of his. Other murders follow. He can't stop before the case is solved.\nDirector:Birger Larsen\nStars:Laura Bach, Jakob Cedergren, Lars Mikkelsen, Simon Kvamm", "Holiday Monday (2021)": "Synopsis : Two men are hired to protect a man who is fleeing a drug syndicate. The initial meeting turns into chaos and with a dead body, briefcase of stolen money and an assassin on their tail, Nick\nDirector:Nathan Shepka\nStars:Kayla Caldwell, Nathan Shepka, Colin MacDougall, Pauly McCluskey", "Poster Boys (2020)": "Synopsis : With the help of his smart ass kid nephew, broke Al Clancy steals a camper-van and heads on a cross country road trip to finally get his life together.\nDirector:Dave Minogue\nStars:Trevor O'Connell, Ryan Minogue-Lee, Norma Sheahan, Amy Hughes", "Jurassic Hunt (2021)": "Synopsis : Female adventurer Parker joins a crew of male trophy hunters in a remote wilderness park. Their goal: slaughter genetically recreated dinosaurs for sport using rifles, arrows, and grenades.\nDirector:Hank Braxtan\nStars:Courtney Loggins, Ruben Pla, Tarkan Dospil, Joston Theney", "A Little Daytime Drama (2021)": "Synopsis : In order to save her daytime soap drama from cancellation, head writer Maggie must convince Darin (her real-life ex-boyfriend) to return to the show.\nDirector:Heather Hawthorn Doyle\nStars:Jen Lilley, Ryan Paevey, Linda Dano, Brittany Mitchell", "The War of the Worlds 2021 (2021)": "Synopsis : Some say right-wing media has no bottom. But ALIENS! REALLY??! This can't be real.\nDirector:Matthew Cooke\nStars:Matthew Cooke, Martin Starr, Darlene Tejeiro, Steven Weber", "Extinct (2021)": "Synopsis : When humanity allies with a bounty hunter in pursuit of Optimus Prime, the Autobots turn to a mechanic and his family for help.\nDirector:Michael Bay\nStars:Mark Wahlberg, Nicola Peltz, Jack Reynor, Stanley Tucci", "The Loud House Movie (2021)": "Synopsis : With his parents and all 10 sisters in tow, Lincoln Loud heads to Scotland and learns that royalty runs in the family in this global musical journey.\nDirector:Dave Needham\nStars:Asher Bishop, David Tennant, Michelle Gomez, Jill Talley", "Reminiscence (2021)": "Synopsis : Nick Bannister, a private investigator of the mind, navigates the alluring world of the past when his life is changed by new client Mae. A simple case becomes an obsession after she disappears and he fights to learn the truth about her.\nDirector:Lisa Joy\nStars:Hugh Jackman, Rebecca Ferguson, Thandiwe Newton, Cliff Curtis", "Sweet Girl (2021)": "Synopsis : A devastated husband vows to bring justice to the people responsible for his wife's death while protecting the only family he has left, his daughter.\nDirector:Brian Andrew Mendoza\nStars:Jason Momoa, Isabela Merced, Manuel Garcia-Rulfo, Adria Arjona", "Risen (2021)": "Synopsis : In 33 AD, a Roman Tribune in Judea is tasked to find the missing body of Jesus Christ, who rose from the dead.\nDirector:Kevin Reynolds\nStars:Joseph Fiennes, Tom Felton, Peter Firth, Cliff Curtis", "Annette (2021)": "Synopsis : A stand-up comedian and his opera singer wife have a two-year-old daughter with a surprising gift.\nDirector:Leos Carax\nStars:Adam Driver, Marion Cotillard, Simon Helberg, Devyn McDowell", "The Girl Who Got Away (2021)": "Synopsis : A female serial killer escapes from prison to go after the one victim that got away.\nDirector:Michael Morrissey\nStars:Kaye Tuckerman, Timothy J. Alex, Eddie Beveridge, Aubin Bradley", "Demonic (2021)": "Synopsis : A family is attacked by demons and only two members survive - Tanjiro and his sister Nezuko, who is turning into a demon slowly. Tanjiro sets out to become a demon slayer to avenge his family and cure his sister.\nStars:\nYoshitsugu Matsuoka, Hiro Shimono, Akari Kitô", "PAW Patrol: The Movie (2021)": "Synopsis : Ryder and the pups are called to Adventure City to stop Mayor Humdinger from turning the bustling metropolis into a state of chaos.\nDirector:Cal Brunker\nStars:Tyler Perry, Ron Pardo, Will Brisbin, Kingsley Marshall", "Stillwater (2021)": "Synopsis : A father travels from Oklahoma to France to help his estranged daughter, who is in prison for a murder she claims she didn't commit.\nDirector:Tom McCarthy\nStars:Matt Damon, Camille Cottin, Abigail Breslin, Lilou Siauvaud", "Blood Conscious (2021)": "Synopsis : A vacationing family turns the tables on a mass shooter who claims to be fighting demonic forces.\nDirector:Timothy Covell\nStars:Oghenero Gbaje, DeShawn White, Lenny Thomas, Lori Hammel", "Bearry (2021)": "Synopsis : In order to cheer up recently divorced Chloe, her friend, Sam gives her a giant teddy bear, Bearry. As Chloe confides her wishes to Bearry, people close to her go missing or die. Is Chloe a murderer, is it her stalker? or is it Bearry?\nDirector:Alexander T. Hwang\nStars:Sarah French, Thomas Haley, Charles Chudabala, Felissa Rose", "Big House (2021)": "Synopsis : In order to protect a beautiful woman and her son from a robber, a male FBI agent disguises himself as a large grandmother.\nDirector:Raja Gosnell\nStars:Martin Lawrence, Nia Long, Paul Giamatti, Jascha Washington", "Overrun (2021)": "Synopsis : Former military extraction specialist Marcus Lombardi, whose only chance of saving his informant sister and their family is to track down a mysterious briefcase.\nDirector:Josh Tessier\nStars:Omid Zader, Johnny Messner, Bruce Dern, William Katt", "Habit (2021)": "Synopsis : Showgirl Deloris Van Cartier returns as Sister Mary Clarence to teach music to a group of Catholic students whose run-down school is slated for closure.\nDirector:Bill Duke\nStars:Whoopi Goldberg, Kathy Najimy, Maggie Smith, Barnard Hughes", "Mind Talker (2021)": "Synopsis : Detective Ben Stone hit on the head and hospitalized, his injury births a new gift of telepathy which sends him down a mysterious path to help troubled individuals to find that he is dealing with a higher level threat.\nDirector:Minh Tuan Nguyen\nStars:Mara D. Ramirez Angulo, Joe Caldarella, John R. Cerminara, Martin Chavez", "Sinister Sorority (2021)": "Synopsis : An ambitious college student is excited to have a new sorority sister until she uncovers her sister's dark past.\nDirector:Anna Elizabeth James\nStars:Maddison Bullock, Heather Lynn Harris, Briana Femia, Lena Harmon", "Boonie Bears: The Wild Life (2021)": "Synopsis : Genetics have never been so hilarious. A thrilling new place opens on Pine Tree Mountain, \"Wild Land\", that offers a legendary experience. By wearing a gene-altering bracelet, guests can\nDirector:Leon Ding\nStars:Chris Boike, Joseph S. Lambert, Nikki Stinson, Xiao Tan", "Love Is Not Love (2021)": "Synopsis : Elena is a beautiful, 35-year-old accomplished woman who has an unhealthy obsession with perfection. Elena's well-ordered life is thrown into chaos, however, when she meets Adriana, an 18-\nDirector:Francesca Muci\nStars:Anna Foglietta, Giulio Berruti, Camilla Filippi, Lorena Cacciatore", "Snake Eyes: G.I. Joe Origins (2021)": "Synopsis : A G.I. Joe spin-off centered around the character of Snake Eyes.\nDirector:Robert Schwentke\nStars:Henry Golding, Andrew Koji, Haruka Abe, Takehiro Hira", "Nowhere Special (2021)": "Synopsis : When John, a thirty-five-year-old window cleaner, is given only a few months to live, he attempts to find a new, perfect family for his three-year-old son, determined to shield him from the terrible reality of the situation.\nDirector:Uberto Pasolini\nStars:James Norton, Daniel Lamont, Eileen O'Higgins, Valerie O'Connor", "A Patriot's Day (2021)": "Synopsis : Based on true stories, \"The Patriot's Day\" follows the lives of three different American soldiers. Set during the Iraq war, the film helps shed light on the mental health issues many US military men and women deal with on a daily basis.\nDirector:Jason Campbell\nStars:Charlie Brown, Jeremiah Clark, Austin Cole, Jordon Gingrich", "About Us (2020)": "Synopsis : A young couple revisit the location where they spent their honeymoon eight years earlier, in an effort to rekindle their troubled marriage. We watch as they navigate the beauty and the pain\nDirector:Stefan Schwartz\nStars:Ross McCall, Allison Miller, Alessandra Mastronardi", "Collection (2021)": "Synopsis : An eccentric mortician recounts several macabre and phantasmagorical tales that he's encountered in his distinguished career.\nDirector:Ryan Spindell\nStars:Tristan Byon, Eden Campbell, Hannah R. Loyd, Clancy Brown", "Spin (2021)": "Synopsis : Mike Flaherty, the Deputy Mayor of New York City, and his team of half-wits must constantly save the Mayor from embarrassment and the media. Mike is later succeeded by Charlie Crawford.\nStars:\nCharlie Sheen, Heather Locklear, Richard Kind", "Demented (2021)": "Synopsis : An insane independent film director and his renegade group of teenage filmmakers kidnap an A-list Hollywood actress and force her to star in their underground film.\nDirector:John Waters\nStars:Melanie Griffith, Stephen Dorff, Alicia Witt, Adrian Grenier", "Buckley's Chance (2021)": "Synopsis : A year after the loss of his father, Ridley and his mother, Gloria, move to Western Australian to live with Ridley's estranged grandfather Spencer. Once there Spencer tries to connect with\nDirector:Tim Brown\nStars:Bill Nighy, Victoria Hill, Martin Sacks, Ben Wood", "CODA (2021)": "Synopsis : As a CODA (Child of Deaf Adults) Ruby is the only hearing person in her deaf family. When the family's fishing business is threatened, Ruby finds herself torn between pursuing her love of music by wanting to go to Berklee College of Music and her fear of abandoning her parents.\nDirector:Sian Heder\nStars:Emilia Jones, Marlee Matlin, Troy Kotsur, Daniel Durant", "Charming the Hearts of Men (2020)": "Synopsis : A romantic drama set during the politically charged early 60s where a sophisticated woman returns to her Southern home town and discovers her options are limited yet discrimination is plentiful. With the help of a Congressional ally, she inspires historic legislation which allows opportunities and protections never before afforded to women.\nDirector:S.E. DeRose\nStars:Anna Friel, Kelsey Grammer, Starletta DuPois, Pauline Dyer", "Crime Story (2021)": "Synopsis : An anthology series centered around America's most notorious crimes and criminals.\nStars:\nAnnaleigh Ashford, Sterling K. Brown, Kenneth Choi", "Beckett (2021)": "Synopsis : Following a tragic car accident in Greece, an American tourist finds himself at the center of a dangerous political conspiracy and on the run for his life.\nDirector:Ferdinando Cito Filomarino\nStars:John David Washington, Boyd Holbrook, Vicky Krieps, Alicia Vikander", "Naked Singularity (2021)": "Synopsis : An idealistic young New York City public defender burned out by the system, on the brink of disbarment, and seeing signs of the universe collapsing all around him decides to rob a multi-million drug deal of one of his clients.\nDirector:Chase Palmer\nStars:John Boyega, Olivia Cooke, Bill Skarsgård, Ed Skrein", "The Swarm (2020)": "Synopsis : A single mother's business of a locust farm isn't doing so well. She discovers by accident that blood makes them thrive, and does her best to hide her secrets.\nDirector:Just Philippot\nStars:Suliane Brahim, Sofian Khammes, Marie Narbonne, Raphael Romand", "The 27-Hour Day (2021)": "Synopsis : An entrepreneur takes a break from her wellness empire for some much-needed work-life balance but realizes it won't be easy. Will a relaxing retreat and new romance change her life, forever?\nDirector:David Winning\nStars:Autumn Reeser, Andrew W. Walker, Rhiannon Fish, Colleen Wheeler", "The Kissing Booth 3 (2021)": "Synopsis : It's the summer before Elle Evans is set to head off to college, and she has a big decision to make.\nDirector:Vince Marcello\nStars:Joey King, Joel Courtney, Jacob Elordi, Molly Ringwald", "The Florist (2021)": "Synopsis : Based on the 2014 short of the same name, The Florist follows millennial Annika, played by Murphy, who earns her living selling edible hypnotic flowers to fashionable eateries across Los Angeles.\nDirector:Andrew Ryan\nStars:Rebecca Murphy, Andrew Ryan, Alan Desatti, Dan Powers", "Chloe's Mountain (2021)": "Synopsis : A teenage girl, songwriter-singer Chloe, reluctantly enters a Christian University and then finds she must face the mountains that are holding her back and in God who can move them.\nDirector:Wesley Bristol\nStars:Kenzie Mae, Shalayna Janelle, Adam Thayer, Lynne Yeaman", "Lethal Love Triangle (2021)": "Synopsis : Two students become engrossed with their handsome research subject until his true nature puts them in harm's way.\nDirector:Daniel West\nStars:Savvy Shay, Jacob Taylor, April Martucci, Terry Woodberry", "Sweet Revenge: A Hannah Swensen Mystery (2021)": "Synopsis : As Hannah and Mike experience engaged life while balancing their busy careers, a murder at a 24-hour gym complicates their wedding planning.\nDirector:Pat Williams\nStars:Alison Sweeney, Cameron Mathison, Tess Atkins, Barbara Niven", "To Be Someone (2021)": "Synopsis : A lighthearted adventure movie set in the world of Mods.\nDirector:Ray Burdis\nStars:Sam Gittins, George Appleby, Leslie Ash, Amelia Bath", "Bleed with Me (2021)": "Synopsis : During a winter getaway at an isolated cabin, a self-destructive young woman becomes convinced that her best friend is stealing her blood.\nDirector:Amelia Moses\nStars:Lee Marshall, Lauren Beatty, Aris Tyros", "Joe Bell (2021)": "Synopsis : The true story of a small town, working class father who embarks on a solo walk across the U.S. to crusade against bullying after his son is tormented in high school for being gay.\nDirector:Reinaldo Marcus Green\nStars:Mark Wahlberg, Reid Miller, Connie Britton, Maxwell Jenkins", "Eye Without a Face (2021)": "Synopsis : A surgeon causes an accident which leaves his daughter disfigured and goes to extreme lengths to give her a new face.\nDirector:Georges Franju\nStars:Pierre Brasseur, Alida Valli, Juliette Mayniel, Alexandre Rignault", "Tomorrow I Quit (2021)": "Synopsis : \"Tomorrow I Quit\" depicts a generation struggling with unstable careers, un-affordable housing and the shame of expressing feelings in a new society of superficial success and false happiness.\nDirector:Bertrand Remaut\nStars:Géraldine Creff, Libby Grace, Jimi Hunt, Mustaq Missouri", "She Ball (2020)": "Synopsis : She Ball follows the love of the game through the struggles of Avery Watts, who enlists the baddest women's streetball league in the city to help him save the embattled Inglewood Community\nDirector:Nick Cannon\nStars:Rosa Acosta, K.D. Aubert, Delpha Baxter, Dj Bling", "John and the Hole (2021)": "Synopsis : A coming-of-age psychological thriller that plays out the unsettling reality of a kid who holds his family captive in a hole in the ground.\nDirector:Pascual Sisto\nStars:Charlie Shotwell, Michael C. Hall, Jennifer Ehle, Taissa Farmiga", "Notorious Nick (2021)": "Synopsis : Nick Newell, a one-armed MMA fighter gets a rare chance to fight for the lightweight championship. He strives to win for himself and all the other people in the world with physical challenges.\nDirector:Aaron Leong\nStars:Cody Christian, Elisabeth Röhm, Kevin Pollak, Barry Livingston", "The Pit (2021)": "Synopsis : A dangerous neighborhood, \"The Pit\", ran by a noble mafia family called Koçovali. When the family is in the danger of losing the control of The Pit, their youngest son now must come back to his home, where he could never escape from.\nStars:\nRiza Kocaoglu, Cem Uslu, Ertugrul Aytaç Usun", "Playing God (2021)": "Synopsis : A pair of con artists recruit their longtime mentor to \"play\" God in order to scam a grieving billionaire.\nDirector:Scott Brignac\nStars:Hannah Kasulka, Luke Benward, Jude Demorest, Marc Menchaca", "The Suicide Squad (2021)": "Synopsis : Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.\nDirector:James Gunn\nStars:Margot Robbie, Idris Elba, John Cena, Joel Kinnaman", "Vivo (2021)": "Synopsis : Vivo, Sony Pictures Animation's first-ever musical adventure featuring all-new original songs from Lin-Manuel Miranda, will take audiences on an epic adventure to gorgeous and vibrant locations never before seen in animation.\nDirectors:Kirk DeMicco,\n|     Stars:Lin-Manuel Miranda, Ynairaly Simo, Zoe Saldana, Juan de Marcos González", "Teddy (2021)": "Synopsis : In a rural French town, twenty-something Teddy is scratched by an unknown beast and slowly undergoes frightening changes.\nDirectors:Ludovic Boukherma,\n|     Stars:Anthony Bajon, Christine Gautier, Ludovic Torrent, Guillaume Mattera", "Lansky (2021)": "Synopsis : When the aging Meyer Lansky is investigated by the Feds, who suspect he has stashed away millions of dollars over half a century, the retired gangster reveals the untold truth about his life as the boss of the National Crime Syndicate.\nDirector:Eytan Rockaway\nStars:Harvey Keitel, Sam Worthington, John Magaro, Minka Kelly", "Faking a Murderer (2020)": "Synopsis : In search of their next hit series, two filmmakers embark on an investigation to find a man they believe to be a serial killer. Are they in over their heads? Yes.\nDirector:Stuart Stone\nStars:Adam Rodness, Stuart Stone, Josh Cruddas, Bill MacDonald", "Mount Adams (2021)": "Synopsis : A team of UFO investigators find themselves fighting for survival as alien monsters hunt them on the slopes of Mount Adams.\nDirector:Phillip Wade\nStars:Tim Wade, Emily Sweet, Matthew O'Donnell, Phillip Wade", "Pooling to Paradise (2021)": "Synopsis : A Los Angeles ride share pool turns into a road trip to Paradise, NV for four millennial strangers, each at a crossroads in their lives, who find unexpected connection.\nDirector:Roxy Shih\nStars:Lynn Chen, Charlotte Kniaz, Frances Kniaz, Bradley White", "Zone Drifter (2021)": "Synopsis : In the distant future, a former soldier battles through a ravaged post-war wasteland, and faces an army of programmed killers while searching for his missing brother.\nDirector:Charles Conkin\nStars:Adam Amick, Melissa Baker, Ryan Below, Charles Conkin", "Mondo Hollywoodland (2021)": "Synopsis : A groovy mushrooms dealer and a man from the 5th dimension journey through Hollywood to find the meaning of \"Mondo.\"\nDirector:Janek Ambros\nStars:Chris Blim, Alex Loynaz, Alyssa Sabo, Jessica Jade Andres", "Righteous Blood (2021)": "Synopsis : Outlaw gun for hire Jericho (played by Michael Pare) is on the run from the law when he finds himself tangled in a situation that will fundamentally change his life, his views and his beliefs forever.\nDirector:Rene Perez\nStars:Alexandra Amarell, Jaren Anderson, Hoyt Baker, Dan Bernstein", "Abducted (2021)": "Synopsis : On the night she plans on taking her own life, a 17-year-old girl is kidnapped and finds herself fighting to stay alive. She gets released, but when she returns home, no one believes her story except for one detective.\nDirector:Jim Donovan\nStars:Katie Douglas, David James Elliott, Rossif Sutherland, Amanda Arcuri", "A Savage Nature (2020)": "Synopsis : A troubled couple battles home invaders. As the night unfolds, loyalties shift, secrets spill, and lives shatter.\nDirector:Paul Awad\nStars:Joseph Carlson, Rayanne Gonzales, Jon Hudson Odom, Steve Polites", "Worth (2021) HC": "Synopsis : Mike and Alex plays with Pie Face Showdown is it worth the money?\nStars:\nAlexander Averbukh", "Bottle Monster (2021)": "Synopsis : An alcoholic mother trying to flee her life, moves to a new house with her young son where she must battle her addiction as she is confronted by a real-life monster.\nDirector:Marjorie DeHey\nStars:Willie Aames, Liam Attridge, Tammie Baird, Bob Clendenin", "Water 2: The Cleansing (2021)": "Synopsis : After a horrific experience at their previous house, Stephanie and her daughter relocate to a modest home in a quiet, private neighborhood or so they sought.\nDirector:Phillip Penza\nStars:Makena Ayala, Adam Berardi, Audrey Beth, Matt Broome", "Danny Doom (2021)": "Synopsis : A boy who seems destined for disaster joins a Christian church youth group then chases the girl of his dreams by masquerading as a mysterious rebel.\nDirector:Matthew Wilson\nStars:Gavin Michaels, Brett Hargrave, Vinnie Duyck, Paul Ryan Hobson", "The Five Rules Of Success (2021)": "Synopsis : An enterprising ex-convict overcomes tragedy by designing a modern-day guide to success for a society that failed him.\nDirector:Orson Oblowitz\nStars:Isidora Goreshter, Jennifer Field, Roger Guenveur Smith, Jonathan Howard", "2025 - The World enslaved by a Virus (2021)": "Synopsis : We are in 2025: since the appearance of covid-19 in 2020, the world is no longer the same: a new system with a single world government has been put in place.\nDirectors:Joshua Wesely,\n|     Stars:Joshua Wesely, Antonia Joy Speer, Matthew Dougan, Laura Wieder", "The Last Mercenary (2021)": "Synopsis : A mysterious former secret service agent must urgently return to France when his estranged son is falsely accused of arms and drug trafficking by the government, following a blunder by an overzealous bureaucrat and a mafia operation.\nDirector:David Charhon\nStars:Jean-Claude Van Damme, Alban Ivanov, Samir Decazza, Assa Sylla", "A Dark Foe (2021)": "Synopsis : A guilt-ridden FBI agent, stranded in the painful memory of the abduction of his sister, suffers from a rare condition known as Nyctophobia, an irrational fear of the dark, and will have to\nDirector:Maria Gabriela Cardenas\nStars:Oscar Cardenas, Kenzie Dalton, Graham Greene, Selma Blair", "Jungle Cruise (2021)": "Synopsis : Based on Disneyland's theme park ride where a small riverboat takes a group of travelers through a jungle filled with dangerous animals and reptiles but with a supernatural element.\nDirector:Jaume Collet-Serra\nStars:Dwayne Johnson, Emily Blunt, Edgar Ramírez, Jack Whitehall", "Resort to Love (2021)": "Synopsis : Erica, who ends up as the entertainment at her ex-fiancé's wedding after reluctantly taking a gig at a luxurious island resort while in the wake of a music career meltdown.\nDirector:Steven K. Tsuchida\nStars:Christina Milian, Tymberlee Hill, Kayne Lee Harrison, Ruth Nadler-Nir", "The Boy Behind the Door (2021)": "Synopsis : After Bobby and his best friend Kevin are kidnapped and taken to a strange house in the middle of nowhere, Bobby manages to escape. But then he hears Kevin's screams for help and realizes he can't leave his friend behind.\nDirectors:David Charbonier,\n|     Stars:Lonnie Chavis, Ezra Dewey, Kristin Bauer van Straten, Micah Hauptman", "F9 (2021)": "Synopsis : Dom and the crew must take on an international terrorist who turns out to be Dom and Mia's estranged brother.\nDirector:Justin Lin\nStars:Vin Diesel, Michelle Rodriguez, Jordana Brewster, Tyrese Gibson", "Hostage House (2021)": "Synopsis : When an ambitious realtor and her daughter are held hostage during an open house, they must work together to outsmart their captors.\nDirector:David Benullo\nStars:Jennifer Taylor, Julia Terranova, Emily Sweet, Justin C. Schilling", "Robot Apocalypse (2021)": "Synopsis : When expert hacker Tara tries to stop a powerful, sentient A.I. as it takes over the world's military, the A.I. marks her as a terrorist that must be exterminated.\nStars:\nKatalina Viteri, DeAngelo Davis, Jessica Chancellor", "Amy and Peter Are Getting Divorced (2021)": "Synopsis : The romantic comedy follows what happens when a seemingly perfect couple plans to divorce and how their once-tight friend group struggles to cope with the aftermath.\nDirector:April Moreau\nStars:Britt Baron, Jordan Barrow, Gabe Begneaud, Alli Brown", "Walking with Herb (2021)": "Synopsis : Sixty-five-year-old Joe Amable-Amo thinks nothing much in his background distinguishes him from other guys his age. He is struggling with his faith after tragedy hits. As the former amateur\nDirector:Ross Kagan Marks\nStars:Edward James Olmos, George Lopez, Kathleen Quinlan, Jessica Medoff", "Kringle Time (2021)": "Synopsis : The manager of a small town public access station questions the legacy of his favorite children's show mascot when he learns that the man inside the costume had been carrying a dark and scandalous secret.\nDirector:Matthew Lucas\nStars:Benny Elledge, Vernon Wells, Gigi Edgley, Jeff Wincott", "Batman: The Long Halloween": "Synopsis : Batman investigates a murder spree that takes place on holidays.\nDirector:Chris Palmer\nStars:Jensen Ackles, Josh Duhamel, Naya Rivera, Troy Baker", "Disencumber (2021)": "Synopsis : Out of options and out of cash, two best friends - a jaded wannabe filmmaker and an idealistic PhD candidate - contemplate robbing their drug dealer.\nDirector:Adam Ninyo\nStars:Patrick Dunning, Maggie Topkis, Abby Garber, Jack Schrader", "Scavengers (2021)": "Synopsis : To inherit a fortune, various addressees of a will must compete in a wild scavenger hunt to collect selected items, but cannot be simply bought.\nDirector:Michael Schultz\nStars:Richard Benjamin, James Coco, Scatman Crothers, Ruth Gordon", "Intuit (2021)": "Synopsis : Pipa begins her career as a police detective alongside her mentor, the controversial detective Francisco Juánez. Together they must solve the violent murder of a 19-year-old girl.\nDirector:Alejandro Montiel\nStars:Luisana Lopilato, Joaquín Furriel, Rafael Ferro, Maite Lanata", "Money Fight (2021)": "Synopsis : A group of friends decides to document their lives as they search for an underground fight club that exists in the dark web. They put everything on the line for money, respect, and friendship.\nDirector:James Boss\nStars:James Boss, Abel Ryu, Eric Park, Pedro Lanre", "Gun and a Hotel Bible (2021)": "Synopsis : Based on the original play, Gun and a Hotel Bible is a provocative film about a man on the verge of a violent act, and his encounter with a personified hotel bible.\nDirectors:Raja Gosnell,\n|     Stars:Bradley Gosnell, Daniel Floren, Mia Marcon, Grace Fae", "Twisted House Sitter (2021)": "Synopsis : When Alicia, a destitute young woman crosses paths with Morgan; a beautiful, affluent, entrepreneur, she realizes she'd rather live Morgan's luxurious life. So she takes it, by any means necessary.\nDirector:Courtney Miller\nStars:Crystal-Lee Naomi, Jennifer Freeman, Kareem Lewis, Ali Amin Carter", "Blood Red Sky (2021)": "Synopsis : A woman with a mysterious illness is forced into action when a group of terrorists attempt to hijack a transatlantic overnight flight.\nDirector:Peter Thorwarth\nStars:Peri Baumeister, Carl Anton Koch, Alexander Scheer, Kais Setti", "Lockdowners (2021)": "Synopsis : Rex (Kevin Nash) and his men aim to kill the homeless people living in a local deserted school hoping it'll slow an ultra deadly strand of covid. Now, outnumbered 100 to 1, \"Hap\" must save his little sister.\nDirector:Micah Lyons\nStars:Kevin Nash, Brooke Lyons, David D. Ford, Stephanie Kae Smith", "CompleX (2021)": "Synopsis : The futuristic adventures of a female cyborg counter intelligence agent and her support team.\nStars:\nMary Elizabeth McGlynn, William Frederick Knight, Richard Epcar", "Last Call in the Dog House (2021)": "Synopsis : The Dog House is a legendary New York dive bar, owned by an extraordinary family. Three people, from different back grounds, enter at closing time on separate nights, carrying the world on\nDirector:Bruce Reisman\nStars:Judy Geeson, Parker Stevenson, Yancy Butler, David Chokachi", "Kingdom: Ashin of the North (2021)": "Synopsis : Tragedy, betrayal and a mysterious discovery fuel a woman's vengeance for the loss of her tribe and family in this special episode of \"Kingdom.\"\nDirector:Seong-hun Kim\nStars:Jun Ji-hyun, Si-ah Kim, Byeong-eun Park, Kyo-hwan Koo", "The Last Letter from Your Lover (2021)": "Synopsis : A pair of interwoven stories set in the past and present follow an ambitious journalist determined to solve the mystery of a forbidden love affair at the center of a trove of secret love letters from 1965.\nDirector:Augustine Frizzell\nStars:Shailene Woodley, Joe Alwyn, Wendy Nottingham, Felicity Jones", "Heart of Hope (2021)": "Synopsis : Eight-year-old Iris's heart condition threatens her dream of becoming a professional dancer.\nDirector:Roydon Turner\nStars:Linda-Jean Barry, Colin Blyth, Renato De Fazio, Georgina Hellier", "The Birthday Cake (2021)": "Synopsis : On the 10th anniversary of his father's death, Giovanni reluctantly accepts the task of bringing a cake to the home of his uncle, a mob boss, for a celebration. Just two hours into the night, Gio's life is forever changed.\nDirector:Jimmy Giannopoulos\nStars:Shiloh Fernandez, Val Kilmer, Ewan McGregor, William Fichtner", "Trouble Will Find Us (2020)": "Synopsis : A couple's relationship threatens to collapse under the pressures of life.\nDirector:Alexander Milo Bischof\nStars:Isabella Brazier-Jones, Benjamin Chandler, Pepa Duarte, Dylan Edwards", "Jolt (2021)": "Synopsis : A bouncer with a slightly murderous anger-management problem that she controls with the help of an electrode-lined vest she uses to shock herself back to normalcy whenever she gets homicidal.\nDirector:Tanya Wexler\nStars:Kate Beckinsale, Jai Courtney, Stanley Tucci, Bobby Cannavale", "Alleyway (2021)": "Synopsis : An undercover cop is released from jail after being wrongfully convicted for uncovering a conspiracy that led to the death of hundreds of people living with HIV.\nDirector:Henry Charly\nStars:Jack Devnarain, Luthuli Dlamini, Bheki Nkosi, Renos Spanoudes", "Zola (2020)": "Synopsis : A stripper named Zola embarks on a wild road trip to Florida.\nDirector:Janicza Bravo\nStars:Taylour Paige, Riley Keough, Nicholas Braun, Ari'el Stachel", "Rock Paper Scissors (2021)": "Synopsis : Magdalena returns to her childhood home to settle her father's inheritance with her half-siblings. Things turn bleak when Magdalena suffers an accident and has to rely on Maria José and Jésus for her recovery.\nDirectors:Martín Blousson,\n|     Stars:Agustina Cerviño, Valeria Giorcelli, Pablo Sigal", "Trollhunters: Rise of the Titans (2021)": "Synopsis : The heroes from the Trollhunters series team-up on an epic adventure to fight the Arcane Order for control over the magic that binds them all.\nDirectors:Johane Matte,\nAndrew L. Schmidt|     Stars:Steve Alterman, Kay Bess, Brian Blessed, Vic Chao", "Who Am I Now? (2021)": "Synopsis : New friends Erin and Alex discover a mutual attraction that neither of them have ever felt before. While Alex tries to navigate her feelings, Erin refuses to acknowledge that she might be\nDirector:Louise E. Lathey\nStars:Barbara Beall, Joanna Gaskell, Alethea Sholomenko, Alicia c. Snee", "Coming For The King (2021)": "Synopsis : Coming for the King is a fictional account of the events and the people that surrounded Martin Luther King Jr. from early 1963 until his untimely demise in the Spring of 1968.\nDirector:Jermaine Smith\nStars:John Allen Shaw, Bill Johnson, Roberto Ragone, Dyesha Hicks", "The Demon's Waltz (2021)": "Synopsis : Becca, a private investigator, is hired to look into the origins of a viral TikTok Challenge that has haunted and caused the deaths of several people. The deeper she digs into the mystery,\nDirector:Ryan Callaway\nStars:Briana Aceti, Kailee McGuire, Sophia Zalipsky, Breanna Engle", "House of Quarantine (2021)": "Synopsis : Nine people have been locked down together in a house while trying to make a movie. Unknowingly, one of their group is infected with Covid-19. The next three weeks become a life and death\nDirector:Mitesh Kumar Patel\nStars:Drew Leatham, Philip P Carlisle, Zoey Walker, Dylan Garcia", "Jakob's Wife (2021)": "Synopsis : Anne, married to a small-town Minister, feels her life has been shrinking over the past 30 years. Encountering \"The Master\" brings her a new sense of power and an appetite to live bolder. However, the change comes with a heavy body count.\nDirector:Travis Stevens\nStars:Barbara Crampton, Larry Fessenden, Bonnie Aarons, Nyisha Bell", "1480 Radio Pirates (2021)": "Synopsis : It's 1965 and rock music is shaking up the world but not in New Zealand. Richard Davis a 23 year old journalist is determined to break the Government's monopoly on broadcasting and bring\nDirector:Craig Newland\nStars:Matt Whelan, Daniel Musgrove, Elliot Wrightson, Belinda Crawley", "Room 9 (2021)": "Synopsis : 9/11 from the President's perspective, with exclusive access to information from the one's that had to take decisions during the World Trade Center's attack.\nDirector:Adam Wishart\nStars:Jeff Daniels, George W. Bush, Dick Cheney, Condoleezza Rice", "Finding You (2021)": "Synopsis : Violinist Finley Sinclair travels to an Irish coastal village to begin her semester studying abroad. At the B&B run by her host family she encounters the gregarious and persistent heartthrob movie star Beckett Rush.\nDirector:Brian Baugh\nStars:Rose Reid, Jedidiah Goodacre, Katherine McNamara, Patrick Bergin", "Death Alley (2021)": "Synopsis : In 1892, the Dalton Gang set out to become the most famous outlaws in America. That dream would become a nightmare.\nDirector:Nicholas Barton\nStars:Delno Ebie, Joshua R. Outzen, Corey Cannon, Ryan T. Johnson", "Nobody Will Believe You (2021)": "Synopsis : Melanie and her daughter Hannah are ready for a fresh start. Hannah, a budding pianist is eager to fit in at her new school. When a stranger starts stalking her, she realizes danger lies much closer than she thought.\nDirector:Damián Romay\nStars:Jenna Rosenow, Emily Topper, Rebecca Adams, Grayson Bane", "Big Cat Trail (2021)": "Synopsis : Three couples go into the mountains for an overnight hike, seeking relaxation and fresh air. Instead, they find themselves engulfed in terror as they fight to stay alive.\nDirector:Beau Yotty\nStars:Beau Yotty, Lisa Barnes, Katrina F Kelly, Stew Jetson", "Roller Squad (2021)": "Synopsis : A group of roller skater friends join their forces to catch a serial killer who is too fast for the police.\nDirector:Berty Cadilhac\nStars:Alice Sanders, Benjamin McMahon, Amy Newton, David Wayman", "A State of Mind (2021)": "Synopsis : Darius Thomas' family history is filled with tragedy. Three generations of Thomas men have all taken their own lives, all struggling with mental illness. A promising writing career\nDirector:Mike Berry\nStars:Imani Khiry, Chanel Moore, Anthony Woods, Jason Floyd", "Blood Born (2021)": "Synopsis : A couple who are about to give up on their dream of having children find a doula who promises a magical solution to their infertility problems, but when she moves in for a series of strange\nDirector:Reed Shusterman\nStars:Rosie Moss, Antoine Perry, Melanie Haynes, Laurine Price", "Dark Ritual (2021)": "Synopsis : Jennifer, a young woman with a dark past, goes on a search for her missing brother. Jennifer soon discovers that her brother's disappearance was anything but planned\nDirector:Chris Warren\nStars:Natali Jones, Lisa Wilcox, Debbie Rochon, Sean Brison", "Bloomfield (2020)": "Synopsis : Eitan is yesterday's football star waiting for a tomorrow. He is a man who has nothing left but guts consulting the prospects of having to find a new profession and having to face a loving woman who doesn't understand his problems.\nDirectors:Richard Harris,\n|     Stars:Richard Harris, Romy Schneider, Kim Burfield, Maurice Kaufmann", "Lorelei (2021)": "Synopsis : A working-class fable about a biker, a mermaid and three shades of blue.\nDirector:Sabrina Doyle\nStars:Jena Malone, Pablo Schreiber, Ryan Findley, Cory Ellis", "Masquerade (2021)": "Synopsis : A young girl struggles to survive after a group of home invaders break into her house to steal her family's priceless artwork.\nDirector:Shane Dax Taylor\nStars:Bella Thorne, Alyvia Alyn Lind, Skyler Samuels, Mircea Monroe", "Hitman's Wife's Bodyguard (2021)": "Synopsis : The bodyguard, Michael Bryce, continues his friendship with assassin, Darius Kincaid, as they try to save Darius' wife Sonia.\nDirector:Patrick Hughes\nStars:Ryan Reynolds, Samuel L. Jackson, Salma Hayek, Antonio Banderas", "Joey and Ella (2021)": "Synopsis : When a baby kangaroo gets accidentally swept up in a jewelry heist, she becomes separated from her mother for the first time in her young life.\nDirector:Stephen Shimek\nStars:Ashton Leigh, Britt Allen, Jennifer Michele, Brooks Ryan", "The Duke (2021)": "Synopsis : In 1961, Kempton Bunton, a 60 year old taxi driver, steals Goya's portrait of the Duke of Wellington from the National Gallery in London.\nDirector:Roger Michell\nStars:Jim Broadbent, Heather Craney, Stephen Rashbrook, James Wilby", "The Forever Purge (2021)": "Synopsis : All the rules are broken as a sect of lawless marauders decides that the annual Purge does not stop at daybreak and instead should never end.\nDirector:Everardo Gout\nStars:Ana de la Reguera, Tenoch Huerta, Josh Lucas, Leven Rambin", "Pig (2021)": "Synopsis : A truffle hunter who lives alone in the Oregon wilderness must return to his past in Portland in search of his beloved foraging pig after she is kidnapped.\nDirector:Michael Sarnoski\nStars:Nicolas Cage, Alex Wolff, Adam Arkin, Cassandra Violet", "Randy Feltface the Book of Randicus (2020)": "Synopsis : An embarrassing near death experience led Randy Feltface to start a new religion. Now he's recruiting disciples. Welcome to the Temple of Randicus, may your enlightenment begin.\nDirector:Natalie van den Dungen\nStar:Heath McIvor", "Deep (2021)": "Synopsis : In the vicinity of the liberated planet of Bajor, the Federation space station Deep Space Nine guards the opening of a stable wormhole to the far side of the galaxy.\nStars:\nRene Auberjonois, Cirroc Lofton, Alexander Siddig", "Space Jam: A New Legacy (2021)": "Synopsis : A rogue artificial intelligence kidnaps the son of famed basketball player LeBron James, who then has to work with Bugs Bunny to win a basketball game.\nDirector:Malcolm D. Lee\nStars:LeBron James, Don Cheadle, Cedric Joe, Khris Davis", "A Classic Horror Story (2021)": "Synopsis : In this gruesome suspense film, strangers traveling in southern Italy become stranded in the woods, where they must fight desperately to get out alive.\nDirectors:Roberto De Feo,\n|     Stars:Matilda Anna Ingrid Lutz, Francesco Russo, Peppino Mazzotta, Will Merrick", "Creation Stories (2021)": "Synopsis : Creation Stories tells the unforgettable tale of infamous Creation Records label head Alan McGee; and of how one written-off young Glaswegian upstart rose to irrevocably change the face of British culture.\nDirector:Nick Moran\nStars:Ewen Bremner, Leo Flanagan, Richard Jobson, Rori Hawthorn", "Gunpowder Milkshake (2021)": "Synopsis : Three generations of women fight back against those who could take everything from them.\nDirector:Navot Papushado\nStars:Karen Gillan, Lena Headey, Carla Gugino, Michelle Yeoh", "June Again (2021)": "Synopsis : During a fleeting bout of lucidity from her dementia, June Wilton has precious little time to bring together her estranged children, save the family business, and rekindle an old flame.\nDirector:JJ Winlove\nStars:Noni Hazlehurst, Claudia Karvan, Stephen Curry, Di Adams", "River (2021)": "Synopsis : A veteran hunter helps an FBI agent investigate the murder of a young woman on a Wyoming Native American reservation.\nDirector:Taylor Sheridan\nStars:Elizabeth Olsen, Jeremy Renner, Graham Greene, Kelsey Asbille", "Giddy Stratospheres (2021)": "Synopsis : Loss and Love in the storm of Guitars and Broken Glass that was the mid 00's UK Indie Music Scene\nDirector:Laura Jean Marsh\nStars:Jamal Franklin, Laura Jean Marsh, Nick Helm, Richard Herring", "Knifecorp (2021)": "Synopsis : High School senior, Wally Banks is selling knives door to door, and gets trapped in a man's house with a dark secret and must escape before it's too late.\nDirector:Zach Zorba Grashin\nStars:Kane Hodder, Austin Kulman, Peter Gilroy, Hymnson Chan", "Downeast (2021)": "Synopsis : A story of love, loss, and redemption - Downeast dives into the often ignored seedy underbelly of Maine. The film combines crime, revenge, and the hope for a new life.\nDirector:Joe Raffa\nStars:Greg Finley, Dylan Silver, Judson Mills, Joss Glennie-Smith", "Crashing Through the Snow (2021)": "Synopsis : Maggie and Sam are crashing Christmas. When he proposes that they team up against his sister's perfect Christmas, neither of them are prepared for the blended family challenges that lie ahead.\nDirector:Rich Newey\nStars:Amy Acker, Warren Christie, Brooke Nevin, Kristian Bruun", "Out of Death (2021)": "Synopsis : A corrupt Sheriff's department in a rural mountain town comes undone when an unintended witness throws a wrench into their shady operation.\nDirector:Mike Burns\nStars:Jaime King, Bruce Willis, Lala Kent, Kelly Greyson", "Skinwalker (2021)": "Synopsis : A team of experts and scientists undertakes exhaustive research at Skinwalker Ranch, an infamous location for paranormal activity and UFO sightings.\nStars:\nBryant 'Dragon' Arnold, Brandon Fugal, Erik Bard", "The Rebels of PT-218 (2021)": "Synopsis : PT-218: THE REBELS OF WWII not only tells a true story, but gives us never seen details of what happened in 1943. At the height of WWII, the Atlantic Ocean becomes a deadly battleground as\nDirector:Nick Lyon\nStars:Eric Roberts, William Baldwin, Geoff Meed, Danny Trejo", "Black Medicine (2021)": "Synopsis : Black Medicine follows a black-market medic who carries out illegal operations for the criminal underworld. When she gives refuge to a young girl, she must choose between breaking her medical oath or crossing her ruthless employers.\nDirector:Colum Eastwood\nStars:Antonia Campbell-Hughes, Amybeth McNulty, Orla Brady, Shashi Rami", "Nebulous Dark (2021)": "Synopsis : Stuck in an endless time-loop, Captain Apollo wakes up to discover he is in the post-apocalypse, a pandemic has wiped out most of the population on Earth, and there are new tenants.\nDirector:Shahin Sean Solimon\nStars:Shahin Sean Solimon, Ginger Christie, Kent Hatch, Kaya Chyla", "Settlers (2021)": "Synopsis : Mankind's earliest settlers on the Martian frontier do what they must to survive the cosmic elements and each other.\nDirector:Wyatt Rockefeller\nStars:Sofia Boutella, Ismael Cruz Cordova, Brooklynn Prince, Nell Tiger Free", "Die in a Gunfight (2021)": "Synopsis : In New York City, a young guy falls for the daughter of his father's nemesis.\nDirector:Collin Schiffli\nStars:Diego Boneta, Alexandra Daddario, Justin Chatwin, Wade Allain-Marcus", "The House Next Door: Meet the Blacks 2 (2021)": "Synopsis : When best selling author Carl Black moves his family back to his childhood home, he must team up with oddball neighbors to do battle with a pimp, who may or may not be an actual vampire.\nDirector:Deon Taylor\nStars:Mike Epps, Katt Williams, Lil Duval, Zulay Henao", "Black Widow (2021)": "Synopsis : Natasha Romanoff confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises.\nDirector:Cate Shortland\nStars:Scarlett Johansson, Florence Pugh, David Harbour, Rachel Weisz", "This Little Love of Mine (2021)": "Synopsis : A workaholic lawyer returns to her island home to convince an old friend to take over his family's company - but rekindled feelings soon get in the way.\nDirector:Christine Luby\nStars:Saskia Hampele, Liam McIntyre, Lynn Gilmartin, James Blee", "The Simpsons: The Good": "Synopsis : The satiric adventures of a working-class family in the misfit city of Springfield.\nStars:\nNancy Cartwright, Harry Shearer, Julie Kavner", "Mott Haven (2021)": "Synopsis : Hal (Robert Davi), a former radio mogul who has fallen on hard times, enlists the aid of a beleaguered businessman (Paul Wilson) to battle a thuggish superintendent (Chuck Zito) and the forces of gentrification in the South Bronx.\nDirector:Michael Domino\nStars:Robert Davi, Chuck Zito, Paul Wilson, Deborah Green", "Ainbo: Spirit of the Amazon (2021)": "Synopsis : In the spirit of Moana and Frozen, 'Ainbo - Spirit of the Amazon' is the epic journey of a young hero and her Spirit Guides, \"Dillo\" a cute and humorous armadillo and \"Vaca\" a goofy\nDirectors:Richard Claus,\n|     Stars:Lola Raie, Naomi Serrano, Dino Andrade, Joe Hernandez", "Here Today (2021)": "Synopsis : When veteran comedy writer Charlie Burnz meets New York street singer Emma Payge, they form an unlikely yet hilarious and touching friendship that kicks the generation gap aside and redefines the meaning of love and trust.\nDirector:Billy Crystal\nStars:Billy Crystal, Chad Jennings, Dierdre Friel, Alex Brightman", "Ride the Eagle (2021)": "Synopsis : Leif is left with a conditional inheritance when his estranged mother Honey dies. Before he can move into her picturesque Yosemite cabin, he has to complete her elaborate, and sometimes dubious, to-do list.\nDirector:Trent O'Donnell\nStars:Jake Johnson, Susan Sarandon, D'Arcy Carden, J.K. Simmons", "Tides (2021)": "Synopsis : Set in the distant future, a female astronaut, shipwrecked on the long-decimated Earth, must decide the fate of the wasteland's remaining populace.\nDirector:Tim Fehlbaum\nStars:Nora Arnezeder, Iain Glen, Sarah-Sofie Boussnina, Sope Dirisu", "Meander (2021)": "Synopsis : A woman finds herself locked in a series of strange tunnels full of deadly traps.\nDirector:Mathieu Turi\nStars:Gaia Weiss, Peter Franzén, Romane Libert, Frédéric Franchitti", "Gerri Curls (2021)": "Synopsis : Gordon (Mike Grogan) joins forces with an unlikely ally (KK Brunson) to fight his half-sister (Renata Bresciani) for the family inheritance and his rightful place among South Florida's curling elite.\nDirector:Will Young\nStars:Charlotte Adams, Renata Bresciani, KK Brunson, Chris Cobas", "Marathon (2021)": "Synopsis : After the shocking murder of his older brother, a New York history student finds himself inexplicably hounded by shadowy government agents on the trail of a Nazi war criminal who is trying to retrieve smuggled diamonds.\nDirector:John Schlesinger\nStars:Dustin Hoffman, Laurence Olivier, Roy Scheider, William Devane", "Madison and the Happiness Jar (2021)": "Synopsis : When a happiness jar lands in Madison's possession, it unexpectedly leads her to interesting crossroads, new friendships, true love, self empowerment and ultimately new beginnings.\nDirector:Chrys Phillips\nStars:James Mana, Jamie Carter, Melanie Britton, Isabella Hayes", "The Blackout Experiment (2021)": "Synopsis : 6 strangers wake up inside a room garnished with weapons and are forced to kill each other or watch someone they care deeply about die.\nDirector:John David Moffat IV\nStars:Troy Jones, Dom Cole, Yasmin Irvine, Steven Synstelien", "No Loss / No Gain (2021)": "Synopsis : A mysterious modern-day Robin Hood gives the victims of a bank robbery a million dollar opportunity.\nDirector:Christian Rousseau\nStars:John Valley, Amanda Joy Erickson, Kevin McCarthy, Nathan Ehrmann", "Medusa (2021)": "Synopsis : After being bitten by a snake a young lady's life begins to take a sharp turn for the worst as a deadly virus plagues her body.\nDirector:Matthew B.C.\nStars:Nicola Wright, Megan Purvis, Sarah T. Cohen, Brahmdeo Shannon Ramana", "Hatched (2021)": "Synopsis : A young gymnast who tries desperately to please her demanding mother, discovers a strange egg. She hides it and keeps it warm, but when it hatches, what emerges shocks them all.\nDirector:Hanna Bergholm\nStars:Siiri Solalinna, Sophia Heikkilä, Jani Volanen, Reino Nordin", "Avocado Toast (2021)": "Synopsis : Avocado Toast is an intergenerational sex comedy exploring the comforts and awkwardness of sex from age 25 to 69. When it comes to millennials and baby boomers, these nuts haven't fallen so far from the family tree.\nStars:\nHeidi Lynch, Nelu Handa, Faye Marsay", "Danny Boy (2021)": "Synopsis : Follows Brian Wood who is humbled when he is accused of war crimes in Iraq by the human rights lawyer Phil Shiner.\nDirector:Sam Miller\nStars:Toby Jones, Alex Ferns, Sarah Niles, Leah McNamara", "Claw (2021)": "Synopsis : A look at the life and crimes of five women who work at a Florida nail salon.\nStars:\nCarrie Preston, Judy Reyes, Karrueche Tran", "Till Death (2021)": "Synopsis : A woman is left handcuffed to her dead husband as part of a sick revenge plot. Unable to unshackle, she has to survive as two killers arrive to finish her off.\nDirector:S.K. Dale\nStars:Megan Fox, Eoin Macken, Callan Mulvey, Jack Roth", "Some of Our Stallions (2021)": "Synopsis : When best friends Beautiful Bill and Andy struggle to fit into regular society, Bill decides they need romantic love. This kicks off a years-long series of misadventures that challenge not only their friendship, but their grasp on sanity.\nDirector:Carson Mell\nStars:Carson Mell, Al Di, Olivia Taylor Dudley, David Zellner", "Werewolves Within (2021)": "Synopsis : Feature adaptation of the video game where werewolves attack a small town.\nDirector:Josh Ruben\nStars:Sam Richardson, Milana Vayntrub, George Basil, Sarah Burns", "Let Us In (2021)": "Synopsis : A spirited girl starts investigating the sudden disappearances of several missing teens in their small town. Realizing there might be something deeper happening, Emily might be up against forces she can't even imagine.\nDirector:Craig Moss\nStars:Makenzie Moss, O'Neill Monahan, Eric Callero, Tobin Bell", "The God Committee (2021)": "Synopsis : An organ transplant committee has one hour to decide which of three patients deserves a life-saving heart. Seven years later, the committee members struggle with the consequences of that fateful decision.\nDirector:Austin Stark\nStars:Kelsey Grammer, Julia Stiles, Colman Domingo, Janeane Garofalo", "The Boss Baby: Family Business (2021)": "Synopsis : The Templeton brothers have become adults and drifted away from each other, but a new boss baby with a cutting-edge approach is about to bring them together again - and inspire a new family business.\nDirector:Tom McGrath\nStars:Alec Baldwin, James Marsden, Amy Sedaris, Ariana Greenblatt", "The Tomorrow War (2021)": "Synopsis : A family man is drafted to fight in a future war where the fate of humanity relies on his ability to confront the past.\nDirector:Chris McKay\nStars:Chris Pratt, Yvonne Strahovski, J.K. Simmons, Betty Gilpin", "Peter Rabbit 2: The Runaway (2021)": "Synopsis : Thomas and Bea are now married and living with Peter and his rabbit family. Bored of life in the garden, Peter goes to the big city, where he meets shady characters and ends up creating chaos for the whole family.\nDirector:Will Gluck\nStars:Rose Byrne, Domhnall Gleeson, David Oyelowo, James Corden", "Heir (2021)": "Synopsis : After a chance encounter in LA, two teens from different social backgrounds reunite at an exclusive high school attended by Korea's über rich.\nStars:\nPark Shin-Hye, Woo-bin Kim, Kim Ji-Won", "No Sudden Move (2021)": "Synopsis : A group of criminals are brought together under mysterious circumstances and have to work together to uncover what's really going on when their simple job goes completely sideways.\nDirector:Steven Soderbergh\nStars:Don Cheadle, Benicio Del Toro, David Harbour, Jon Hamm", "Alien Conquest (2021)": "Synopsis : Sibling astronomers discover Martians are threatening to attack Earth, but no one believes them-until Martians land and nearly destroy all of New York City.\nDirector:Mario N. Bonassin\nStars:Emily Killian, Anthony Jensen, Tom Sizemore, Michael DeVorzon", "Separation (2021)": "Synopsis : The family Paixão runs a farm for wedding parties, but the business is not going well. While the love between the parents, Vanessa and Daniel appears to have ended, the grandparents, Luisa\nStars:\nDinarte Branco, Madalena Almeida, Diogo Martins", "Blood Pageant (2021)": "Synopsis : Suspense and horror on the set of a cheesy reality show. Some will do anything to win, opening doors to ungodly evil. Who will win? Who will survive? David Chokachi, Stephen Baldwin and Snoop Dogg balance scares with comedy, music and fun.\nDirectors:Harvey Lowry,\nAnthony J. Sands|     Stars:Matthew Marsden, Stephen Baldwin, Danielle C. Ryan, Snoop Dogg", "All Who Loved Her (2021)": "Synopsis : Rianne Angers has spent the last nine years obsessing over the vicious murder of Gwen Anderson. And it is understandable: Her brother Nick went to prison for the crime. Now that Nick is\nDirector:Christian Vinces\nStars:Janice Blue, Andre Boyer, Clint Carmichael, Arthur De Larroche", "America: The Motion Picture (2021)": "Synopsis : A chainsaw-wielding George Washington teams with beer-loving bro Sam Adams to take down the Brits in a tongue-in-cheek riff on the American Revolution.\nDirector:Matt Thompson\nStars:Channing Tatum, Jason Mantzoukas, Olivia Munn, Bobby Moynihan", "Boss Moves (2021)": "Synopsis : Crutch hires his brother, Black, to kill his friend Kane. Crutch takes Kane's cash and becomes king of the streets. Not realizing he killed the wrong guy, Black is kidnapped and becomes the\nDirectors:Chad Hendricks,\n|     Stars:Tavares Walker, Antwan Bing, Matesha Redman, Mr. Popular McCloud", "Extraction Point (2021)": "Synopsis : When a UFO is taken down by the government making it crash, Nemon (Farid Jamal Khan) is taken to a secret Laboratory ran by Dr. Silva (Joe Bei) for anything and everything evil. Becoming\nDirector:Franklin Correa\nStars:Charles Heimlich, Tara London, Franklin Correa, Michael Ciesla", "Sand Dollar Cove (2021)": "Synopsis : Real estate development project manager Elli is sent by her company to acquire the beachfront property they've chosen as the site of their new resort. Brody, the charming local wants to make sure the town's beloved pier remains intact.\nDirector:Fred Gerber\nStars:Chad Michael Murray, Aly Michalka, Clare Bowen, Glynnis O'Connor", "Ripper Untold (2021)": "Synopsis : A detective and a medical examiner join forces to solve a series of horrific murders in Victorian London - but one of them harbours a deadly secret.\nDirector:Steve Lawson\nStars:Jacob Anderton, Chris Bell, Dawn Butler, Jonathan Hansler", "The Greenhouse (2021)": "Synopsis : Grieving the death of her mother Lillian, Beth Tweedy-Bell wakes one night to find a portal to the past in the forest surrounding her family home. Swept away by visions of her idyllic\nDirector:Thomas Wilson-White\nStars:Tel Benjamin, Rhondda Findleton, Harriet Gordon-Anderson, Michael Gosden", "A Quiet Place Part II (2021)": "Synopsis : Following the events at home, the Abbott family now face the terrors of the outside world. Forced to venture into the unknown, they realize the creatures that hunt by sound are not the only threats lurking beyond the sand path.\nDirector:John Krasinski\nStars:Emily Blunt, Millicent Simmonds, Cillian Murphy, John Krasinski", "Gaia (2021)": "Synopsis : An injured forest ranger on a routine mission is saved by two off-the-grid survivalists. What is initially a welcome rescue grows more suspicious as the son and his renegade father reveal a cultish devotion to the forest.\nDirector:Jaco Bouwer\nStars:Monique Rockman, Carel Nel, Alex van Dyk, Anthony Oseyemi", "The Ice Road (2021)": "Synopsis : After a remote diamond mine collapses in far northern Canada, a 'big-rig' ice road driver must lead an impossible rescue mission over a frozen lake to save the trapped miners.\nDirector:Jonathan Hensleigh\nStars:Liam Neeson, Marcus Thomas, Laurence Fishburne, Amber Midthunder", "An Unquiet Grave (2020)": "Synopsis : A year after the death of his wife, a man enlists her sister to help him bring her back.\nDirector:Terence Krey\nStars:Jacob A. Ware, Christine Nyland", "Black Easter (2021)": "Synopsis : An Extremist group travels back in time to assassinate Christ before the Crucifixion. The fate of the world now depends on a genius with no faith\nDirector:Jim Carroll\nStars:Jordyn Barrera, Christina Birdsong, Donny Boaz, Phoenix Brock", "Behemoth (2020)": "Synopsis : A desperate father will risk anything, even his soul, to save his terminally ill daughter\nDirector:Peter Szewczyk\nStars:Josh Eisenberg, Paul Statman, Jennifer Churchich, Richard Wagner", "Calm Like a Bomb (2021)": "Synopsis : A man, whose girlfriend was murdered some years before, takes his revenge during the course of a single night. He has one night, that's the time limit he gave to himself. Now he is ready to\nDirector:Mauro Russo Rouge\nStars:Serena Debianchi, Gianfranco Giglio, Mauro Pacenti, Giovanni Pescetti", "Sol Invictus (2021)": "Synopsis : Far into the future a group of young adults are stranded on a hostile alien planet with no hope of getting home.\nDirector:Ben Carland\nStars:Jake White, Jake Brown, Colin Conners, Caleb Courtney", "Spirit Untamed (2021)": "Synopsis : Lucky Prescott's life is changed forever when she moves from her home in the city to a small frontier town and befriends a wild mustang named Spirit.\nDirectors:Elaine Bogan,\n|     Stars:Isabela Merced, Marsai Martin, Mckenna Grace, Walton Goggins", "The Green Sea (2021)": "Synopsis : A lone writer lives a life of isolation until her world changes by the appearance of a strange young girl.\nDirector:Randal Plunkett\nStars:Katharine Isabelle, Hazel Doupe, Dermot Ward, Ciaron Davies", "Good on Paper (2021)": "Synopsis : After years of putting her career first, a stand-up comic meets a guy who seems perfect: smart, nice, successful and possibly too good to be true.\nDirector:Kimmy Gatewood\nStars:Iliza Shlesinger, Britney Young, Christopher Nicholas Smith, Adam Lustick", "To Catch a Spy (2021)": "Synopsis : When the newly renovated Hotel Optima in Malta has a grand reopening, Chloe and her team from Destination Traveler Magazine, head over to cover the travel scene in Malta and sees someone fall to their death, right past her hotel window.\nDirector:Jeff Beesley\nStars:Nathalie Kelley, Colin Donnell, Patti Murin, Davy Eduard King", "What We Found (2020)": "Synopsis : A trio of friends are starting high school when their friend vanishes. With the police unable, or unwilling to find her, they take it upon themselves to find out what happened, undertaking a harrowing journey that will change them all.\nDirector:Ben Hickernell\nStars:Elizabeth Mitchell, Giorgia Whigham, James Ransone, Oona Laurence", "Clairevoyant (2021)": "Synopsis : A Los Angeles socialite and so-called wellness practitioner seeks to overcome her life of luxury and achieve nirvana after hiring a film crew to document a more authentic journey along the path of enlightenment.\nDirectors:Arthur De Larroche,\n|     Stars:Micaela Wittman, Anousha, Amy Benedict, Arthur De Larroche", "A Soldier's Story 2: Return from the Dead (2020)": "Synopsis : In Watz Republic, Regina (Linda Ejiofor) confides in her friend, Zaya (Somkele Idhalama) to look after her younger brother while she goes after the desires of her heart to be with Major Egan (Tope Tedela).\nDirector:Frankie Ogar\nStars:Eric Roberts, John J. Vogel, Daniel K. Daniel, Somkele Iyamah-Idhalama", "White Demise (2021)": "Synopsis : A desperate woman embarks on a journey to find a life-saving bullet, seeking to reverse the tragic death of her daughter, but the only way to do that is through the man who revived her murderer.\nDirector:Daeil Kim\nStars:Kelly Macdougall, Lawrence Sams, John Spencer, Olivia Storm", "Babysitter Must Die (2020)": "Synopsis : Armed cultists invade a family's home, and their babysitter fights back.\nDirector:Kohl Glass\nStars:Riley Scott, Melinda Yeaman, Scarlett Hazen, Nathan Stevens", "Only (2020)": "Synopsis : Three strangers who share an obsession with true crime suddenly find themselves caught up in one.\nStars:\nMartin Short, Selena Gomez, Aaron Dominguez", "Cradle Did Fall (2021)": "Synopsis : A woman poses as an infant photographer in order to befriend a young mother and steal her baby.\nDirector:Keegan Connor Tracy\nStars:Ali Liebert, Lauren K. Robek, Matreya Scarrwener, Sydney Bell", "Let's Dream (2021)": "Synopsis : Let, a reclusive, insomniac photographer, is hired to photograph a mysterious client in the forest late one night, and soon finds himself pulled into a bizarre, otherworldly quest.\nDirector:Eric Gorlow\nStars:Eric Gorlow, Kara Schaaf, Douglas M. Eames, Lucia Joyce", "Vanished(2022)": "Synopsis : Story of a husband and wife that will stop at nothing to find their missing daughter, who disappeared on a family camping trip. When the police don't catch any leads, the duo take over.\nDirector:Peter Facinelli\nStars:Anne Heche, Thomas Jane, Jason Patric, Alex Haydon", "Munich(2021)": "Synopsis : A British diplomat travels to Munich in the run-up to World War II, where a former classmate of his from Oxford is also en route, but is working for the German government.\nDirector:Christian Schwochow\nStars:George MacKay, Jannis Niewöhner, Jeremy Irons, Liv Lisa Fries", "Alien(2021)": "Synopsis : A crash-landed alien named Harry who takes on the identity of a small-town Colorado doctor and slowly begins to wrestle with the moral dilemma of his secret mission on Earth.\nStars:\nSara Tomko, Elizabeth Bowen, Corey Reynolds"}